Jackcdut/Graduation-project-ESP32/BSP/GUIDER/generated/events_init.c
/*
* Copyright 2025 NXP
* NXP Confidential and Proprietary. This software is owned or controlled by NXP and may only be used strictly in
* accordance with the applicable license terms. By expressly accepting such terms or by downloading, installing,
* activating and/or otherwise using the software, you are agreeing that you have read, and that you agree to
* comply with and are bound by, such license terms.  If you do not agree to be bound by the applicable license
* terms, then you may not retain, install, activate or otherwise use the software.
*/

#include "events_init.h"
#include <stdio.h>
#include <string.h>
#include <math.h>
#include "lvgl.h"
#include "lv_textprogress.h"

#if LV_USE_FREEMASTER
#include "freemaster_client.h"
#endif

#include "custom.h"
#include "lv_textprogress.h"

/* WiFi manager includes */
#include "esp_wifi.h"
#include "esp_err.h"
#include "esp_log.h"

/* FreeRTOS includes for thread-safe timing */
#include "freertos/FreeRTOS.h"

/* Oscilloscope export module */
#include "oscilloscope_export.h"
#include "freertos/task.h"

/* SD Card Manager */
#include "sdcard_manager.h"
#include "sdcard_manager_ui.h"

/* Cloud Manager */
#include "cloud_manager.h"
#include "cloud_manager_ui.h"

/* BSP includes for backlight control */
#include "bsp/esp32_p4_function_ev_board.h"

/* Wireless Serial module */
#include "wireless_serial.h"

/* STM32 Communication module */
#include "stm32_comm.h"
#include "stm32_comm.h"

/* Font declarations for Chinese support */
LV_FONT_DECLARE(lv_font_ShanHaiZhongXiaYeWuYuW_16)
LV_FONT_DECLARE(lv_font_ShanHaiZhongXiaYeWuYuW_18)

/* ESP-DSP library for hardware-accelerated FFT */
#include "esp_dsp.h"

/* 示波器模块 - 统一头文件 */
#include "oscilloscope.h"

/* WiFi scan check timer callback - NON-BLOCKING version */
static void wifi_scan_check_timer_cb(lv_timer_t *timer)
{
	// Get scan results (non-blocking check)
	wifi_ap_record_t ap_records[20];
	uint16_t ap_count = 20;

	extern esp_err_t wifi_manager_get_scan_results(wifi_ap_record_t *, uint16_t *);
	extern void wifi_scan_result_callback(const char *[], int [], int);

	esp_err_t ret = wifi_manager_get_scan_results(ap_records, &ap_count);

	if (ret == ESP_OK) {
		// Scan completed successfully - convert to string arrays for callback
		static const char *ssids[20];
		static int rssi_values[20];

		for (int i = 0; i < ap_count && i < 20; i++) {
			ssids[i] = (const char*)ap_records[i].ssid;
			rssi_values[i] = ap_records[i].rssi;
		}

		wifi_scan_result_callback(ssids, rssi_values, ap_count);

		// Delete timer after successful scan
		if (timer != NULL) {
			lv_timer_del(timer);
		}
	} else if (ret == ESP_ERR_NOT_FINISHED) {
		// Scan still in progress - keep checking (timer will repeat)
		// Do nothing, timer will fire again
	} else {
		// Scan failed or error - stop timer and show error
		ESP_LOGE("WIFI_SCAN", "Scan failed: %s", esp_err_to_name(ret));
		if (timer != NULL) {
			lv_timer_del(timer);
		}

		// Show error in UI
		extern lv_ui guider_ui;
		if (guider_ui.scrSettings_listWifi != NULL) {
			lv_obj_clean(guider_ui.scrSettings_listWifi);
			lv_obj_t * btn = lv_list_add_btn(guider_ui.scrSettings_listWifi, LV_SYMBOL_WARNING, "Scan failed");
			lv_obj_set_style_text_color(lv_obj_get_child(btn, 1), lv_color_hex(0xe74c3c), LV_PART_MAIN|LV_STATE_DEFAULT);
		}

		// Re-enable scan button
		if (guider_ui.scrSettings_btnWifiScan != NULL) {
			lv_obj_clear_state(guider_ui.scrSettings_btnWifiScan, LV_STATE_DISABLED);
			lv_label_set_text(guider_ui.scrSettings_btnWifiScan_label, LV_SYMBOL_REFRESH " Scan");
		}

		// Hide spinner
		if (guider_ui.scrSettings_spinnerWifiScan != NULL) {
			lv_obj_add_flag(guider_ui.scrSettings_spinnerWifiScan, LV_OBJ_FLAG_HIDDEN);
		}
	}
}

static void scrHome_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);

	switch (code) {
	case LV_EVENT_SCREEN_LOADED:
	{
		/* Reset weather display pointers to prevent accessing invalid objects */
		reset_weather_display_pointers();

		/* Re-initialize carousel effect when screen is loaded */
		configure_scrHome_scroll(&guider_ui);
		setup_contMain_carousel_effect(&guider_ui);

		/* Restore WiFi status display with animation */
		restore_wifi_status_on_screen_load(&guider_ui);
		break;
	}
	default:
		break;
	}
}
static void scrHome_contPrint_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);

	switch (code) {
	case LV_EVENT_CLICKED:
	{
		ui_load_scr_animation(&guider_ui, &guider_ui.scrPrintMenu, guider_ui.scrPrintMenu_del, &guider_ui.scrHome_del, setup_scr_scrPrintMenu, LV_SCR_LOAD_ANIM_FADE_ON, 0, 0, false, true);
		break;
	}
	default:
		break;
	}
}
static void scrHome_contCopy_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);

	switch (code) {
	case LV_EVENT_CLICKED:
	{
		ui_load_scr_animation(&guider_ui, &guider_ui.scrCopy, guider_ui.scrCopy_del, &guider_ui.scrHome_del, setup_scr_scrCopy, LV_SCR_LOAD_ANIM_FADE_ON, 0, 0, false, true);
		break;
	}
	default:
		break;
	}
}
static void scrHome_contScan_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);

	switch (code) {
	case LV_EVENT_CLICKED:
	{
		// Jump to Oscilloscope screen instead of Scan screen
		ui_load_scr_animation(&guider_ui, &guider_ui.scrOscilloscope, guider_ui.scrOscilloscope_del, &guider_ui.scrHome_del, setup_scr_scrOscilloscope, LV_SCR_LOAD_ANIM_FADE_ON, 0, 0, false, true);
		break;
	}
	default:
		break;
	}
}
static void scrHome_cont_5_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);

	switch (code) {
	case LV_EVENT_CLICKED:
	{
		ui_load_scr_animation(&guider_ui, &guider_ui.scrPowerSupply, guider_ui.scrPowerSupply_del, &guider_ui.scrHome_del, setup_scr_scrPowerSupply, LV_SCR_LOAD_ANIM_FADE_ON, 0, 0, false, true);
		break;
	}
	default:
		break;
	}
}
static void scrHome_btn_1_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);

	switch (code) {
	case LV_EVENT_CLICKED:
	{
		// 只显示文字，不跳转页面
		break;
	}
	default:
		break;
	}
}
static void scrHome_cont_1_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);

	switch (code) {
	case LV_EVENT_CLICKED:
	{
		ui_load_scr_animation(&guider_ui, &guider_ui.scrWirelessSerial, guider_ui.scrWirelessSerial_del, &guider_ui.scrHome_del, setup_scr_scrWirelessSerial, LV_SCR_LOAD_ANIM_FADE_ON, 0, 0, false, true);
		break;
	}
	default:
		break;
	}
}
static void scrHome_cont_2_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);

	switch (code) {
	case LV_EVENT_CLICKED:
	{
		ESP_LOGI("SETTINGS_BTN", "Settings button clicked! Navigating to scrSettings...");
		ui_load_scr_animation(&guider_ui, &guider_ui.scrSettings, guider_ui.scrSettings_del, &guider_ui.scrHome_del, setup_scr_scrSettings, LV_SCR_LOAD_ANIM_FADE_ON, 0, 0, false, true);
		break;
	}
	case LV_EVENT_PRESSED:
	{
		ESP_LOGI("SETTINGS_BTN", "Settings button pressed");
		break;
	}
	case LV_EVENT_RELEASED:
	{
		ESP_LOGI("SETTINGS_BTN", "Settings button released");
		break;
	}
	default:
		break;
	}
}
void events_init_scrHome(lv_ui *ui)
{
	lv_obj_add_event_cb(ui->scrHome, scrHome_event_handler, LV_EVENT_ALL, ui);
	lv_obj_add_event_cb(ui->scrHome_contPrint, scrHome_contPrint_event_handler, LV_EVENT_ALL, ui);
	lv_obj_add_event_cb(ui->scrHome_contCopy, scrHome_contCopy_event_handler, LV_EVENT_ALL, ui);
	lv_obj_add_event_cb(ui->scrHome_contScan, scrHome_contScan_event_handler, LV_EVENT_ALL, ui);
	lv_obj_add_event_cb(ui->scrHome_cont_5, scrHome_cont_5_event_handler, LV_EVENT_ALL, ui);
	lv_obj_add_event_cb(ui->scrHome_cont_1, scrHome_cont_1_event_handler, LV_EVENT_ALL, ui);
	lv_obj_add_event_cb(ui->scrHome_cont_2, scrHome_cont_2_event_handler, LV_EVENT_ALL, ui);
	lv_obj_add_event_cb(ui->scrHome_btn_1, scrHome_btn_1_event_handler, LV_EVENT_ALL, ui);
}
/* Signal generator state variables */
static int current_wave_type = 0;  // 0=sine, 1=triangle, 2=square
static lv_obj_t * scrCopy_slider_amp = NULL;  // Reference to amplitude slider

/* Set amplitude slider reference for safe access in event handlers */
void scrCopy_set_amplitude_slider(lv_obj_t *slider)
{
	scrCopy_slider_amp = slider;
}

/* Get amplitude slider reference */
lv_obj_t* scrCopy_get_amplitude_slider(void)
{
	return scrCopy_slider_amp;
}

static void scrCopy_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);

	switch (code) {
	case LV_EVENT_SCREEN_LOADED:
	{
		/* Safety check before animation */
		if (guider_ui.scrCopy_contBG && lv_obj_is_valid(guider_ui.scrCopy_contBG)) {
			ui_scale_animation(guider_ui.scrCopy_contBG, 150, 0, 800, 80, &lv_anim_path_ease_out, 0, 0, 0, 0, NULL, NULL, NULL);
		}
		
		/* 切换STM32到信号发生器模式 */
		stm32_set_mode(STM32_MODE_SIGGEN);
		ESP_LOGI("SIGGEN_UI", "Signal generator screen loaded, mode switched to SIGGEN");
		break;
	}
	case LV_EVENT_SCREEN_UNLOADED:
	{
		/* 页面卸载时切换回空闲模式 */
		stm32_set_mode(STM32_MODE_IDLE);
		ESP_LOGI("SIGGEN_UI", "Signal generator screen unloaded, mode switched to IDLE");
		
		/* Clean up signal generator resources when leaving screen */
		extern void deinit_signal_generator(void);
		deinit_signal_generator();
		/* Clear amplitude slider reference to prevent use-after-free */
		scrCopy_slider_amp = NULL;
		/* Clear all static references in setup_scr_scrCopy.c */
		scrCopy_clear_static_refs();

		/* Clear guider_ui member pointers for scrCopy to prevent use-after-free */
		guider_ui.scrCopy = NULL;
		guider_ui.scrCopy_contBG = NULL;
		guider_ui.scrCopy_contPanel = NULL;
		guider_ui.scrCopy_imgScanned = NULL;
		guider_ui.scrCopy_sliderBright = NULL;
		guider_ui.scrCopy_sliderHue = NULL;
		guider_ui.scrCopy_btnNext = NULL;
		guider_ui.scrCopy_imgColor = NULL;
		guider_ui.scrCopy_imgBright = NULL;
		guider_ui.scrCopy_btnBack = NULL;
		break;
	}
	default:
		break;
	}
}

/* Frequency slider event handler - Range: 0-2MHz */
static void scrCopy_sliderBright_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);

	/* Safety check - ensure screen objects are valid */
	if (!guider_ui.scrCopy_sliderBright || !lv_obj_is_valid(guider_ui.scrCopy_sliderBright)) return;

	switch (code) {
	case LV_EVENT_VALUE_CHANGED:
	{
		/* Get frequency value (0-1000 representing 0Hz-2MHz) */
		int32_t freq_val = lv_slider_get_value(guider_ui.scrCopy_sliderBright);
		uint32_t frequency;
		char freq_str[32];

