Jackcdut/Graduation-project-ESP32/BSP/GUIDER/generated/events_init.c
		/* Convert slider value to frequency:
		 * 0-100: 0-1kHz (step 10Hz), 100-190: 1k-10kHz (step 100Hz)
		 * 190-590: 10k-110kHz (step 250Hz), 590-1000: 110kHz-2MHz */
		if (freq_val <= 100) {
			frequency = freq_val * 10;  // 0-1kHz
			snprintf(freq_str, sizeof(freq_str), "%lu Hz", (unsigned long)frequency);
		} else if (freq_val <= 190) {
			frequency = 1000 + (freq_val - 100) * 100;  // 1k-10kHz
			if (frequency < 10000) {
				snprintf(freq_str, sizeof(freq_str), "%.1f kHz", frequency / 1000.0f);
			} else {
				snprintf(freq_str, sizeof(freq_str), "%.0f kHz", frequency / 1000.0f);
			}
		} else if (freq_val <= 590) {
			frequency = 10000 + (freq_val - 190) * 250;  // 10k-110kHz
			snprintf(freq_str, sizeof(freq_str), "%.1f kHz", frequency / 1000.0f);
		} else if (freq_val >= 1000) {
			frequency = 2000000;  // Clamp to max 2MHz
			snprintf(freq_str, sizeof(freq_str), "2.00 MHz");
		} else {
			/* 590-999: 110kHz to ~2MHz, use interpolation */
			frequency = 110000 + (uint32_t)((freq_val - 590) * 4609.756f);
			if (frequency >= 1000000) {
				snprintf(freq_str, sizeof(freq_str), "%.2f MHz", frequency / 1000000.0f);
			} else {
				snprintf(freq_str, sizeof(freq_str), "%.1f kHz", frequency / 1000.0f);
			}
		}

		/* Update frequency label */
		lv_label_set_text(guider_ui.scrCopy_imgBright, freq_str);

		/* Update frequency input textarea */
		extern void scrCopy_update_freq_input(uint32_t freq_hz);
		scrCopy_update_freq_input(frequency);

		/* Get current amplitude safely */
		uint16_t amplitude = 150;  // Default 1.5V
		if (scrCopy_slider_amp != NULL && lv_obj_is_valid(scrCopy_slider_amp)) {
			amplitude = lv_slider_get_value(scrCopy_slider_amp);
		}

		/* Update waveform display with animation */
		update_waveform_display(guider_ui.scrCopy_imgScanned, current_wave_type, frequency, amplitude);

		/* Send command to STM32 signal generator */
		float amp_volts = amplitude / 100.0f;  /* Convert to Vpp */
		stm32_siggen_set_all((uint8_t)current_wave_type, (float)frequency, amp_volts);
		break;
	}
	default:
		break;
	}
}

/* Helper function to calculate frequency from slider value (0-2MHz range) */
static uint32_t calc_frequency_from_slider(int32_t freq_val)
{
	if (freq_val <= 100) {
		return freq_val * 10;  // 0-1kHz (step 10Hz)
	} else if (freq_val <= 190) {
		return 1000 + (freq_val - 100) * 100;  // 1k-10kHz (step 100Hz)
	} else if (freq_val <= 590) {
		return 10000 + (freq_val - 190) * 250;  // 10k-110kHz (step 250Hz)
	} else if (freq_val >= 1000) {
		return 2000000;  // Clamp to max 2MHz
	} else {
		/* 590-999: 110kHz to ~2MHz, use interpolation */
		/* (2000000 - 110000) / (1000 - 590) = 1890000 / 410 = 4609.756 */
		return 110000 + (uint32_t)((freq_val - 590) * 4609.756f);
	}
}

/* Helper function to safely get amplitude value */
static uint16_t get_amplitude_value(void)
{
	if (scrCopy_slider_amp != NULL && lv_obj_is_valid(scrCopy_slider_amp)) {
		return lv_slider_get_value(scrCopy_slider_amp);
	}
	return 150;  // Default 1.5V
}

/* Square wave button event handler (reusing sliderHue variable) */
static void scrCopy_sliderHue_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);

	/* Safety check - ensure screen objects are valid */
	if (!guider_ui.scrCopy_sliderBright || !lv_obj_is_valid(guider_ui.scrCopy_sliderBright)) return;
	if (!guider_ui.scrCopy_imgScanned || !lv_obj_is_valid(guider_ui.scrCopy_imgScanned)) return;

	switch (code) {
	case LV_EVENT_CLICKED:
	{
		/* Update button states */
		if (guider_ui.scrCopy_btnNext && lv_obj_is_valid(guider_ui.scrCopy_btnNext))
			lv_obj_clear_state(guider_ui.scrCopy_btnNext, LV_STATE_CHECKED);  // Sine
		if (guider_ui.scrCopy_imgColor && lv_obj_is_valid(guider_ui.scrCopy_imgColor))
			lv_obj_clear_state(guider_ui.scrCopy_imgColor, LV_STATE_CHECKED);  // Triangle
		if (guider_ui.scrCopy_sliderHue && lv_obj_is_valid(guider_ui.scrCopy_sliderHue))
			lv_obj_add_state(guider_ui.scrCopy_sliderHue, LV_STATE_CHECKED);  // Square

		/* Set wave type to square */
		current_wave_type = 2;

		/* Update waveform with current parameters */
		int32_t freq_val = lv_slider_get_value(guider_ui.scrCopy_sliderBright);
		uint32_t frequency = calc_frequency_from_slider(freq_val);
		uint16_t amplitude = get_amplitude_value();

		update_waveform_display(guider_ui.scrCopy_imgScanned, 2, frequency, amplitude);

		/* Send command to STM32 signal generator */
		float amp_volts = amplitude / 100.0f;
		stm32_siggen_set_all(WAVE_SQUARE, (float)frequency, amp_volts);
		break;
	}
	default:
		break;
	}
}

/* Sine wave button event handler (reusing btnNext variable) */
static void scrCopy_btnNext_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);

	/* Safety check - ensure screen objects are valid */
	if (!guider_ui.scrCopy_sliderBright || !lv_obj_is_valid(guider_ui.scrCopy_sliderBright)) return;
	if (!guider_ui.scrCopy_imgScanned || !lv_obj_is_valid(guider_ui.scrCopy_imgScanned)) return;

	switch (code) {
	case LV_EVENT_CLICKED:
	{
		/* Update button states */
		if (guider_ui.scrCopy_btnNext && lv_obj_is_valid(guider_ui.scrCopy_btnNext))
			lv_obj_add_state(guider_ui.scrCopy_btnNext, LV_STATE_CHECKED);  // Sine
		if (guider_ui.scrCopy_imgColor && lv_obj_is_valid(guider_ui.scrCopy_imgColor))
			lv_obj_clear_state(guider_ui.scrCopy_imgColor, LV_STATE_CHECKED);  // Triangle
		if (guider_ui.scrCopy_sliderHue && lv_obj_is_valid(guider_ui.scrCopy_sliderHue))
			lv_obj_clear_state(guider_ui.scrCopy_sliderHue, LV_STATE_CHECKED);  // Square

		/* Set wave type to sine */
		current_wave_type = 0;

		/* Update waveform with current parameters */
		int32_t freq_val = lv_slider_get_value(guider_ui.scrCopy_sliderBright);
		uint32_t frequency = calc_frequency_from_slider(freq_val);
		uint16_t amplitude = get_amplitude_value();

		update_waveform_display(guider_ui.scrCopy_imgScanned, 0, frequency, amplitude);

		/* Send command to STM32 signal generator */
		float amp_volts = amplitude / 100.0f;
		stm32_siggen_set_all(WAVE_SINE, (float)frequency, amp_volts);
		break;
	}
	default:
		break;
	}
}

