Jackcdut/Graduation-project-ESP32/BSP/GUIDER/generated/events_init.c
/* Triangle wave button event handler (reusing imgColor variable) */
static void scrCopy_imgColor_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);

	/* Safety check - ensure screen objects are valid */
	if (!guider_ui.scrCopy_sliderBright || !lv_obj_is_valid(guider_ui.scrCopy_sliderBright)) return;
	if (!guider_ui.scrCopy_imgScanned || !lv_obj_is_valid(guider_ui.scrCopy_imgScanned)) return;

	switch (code) {
	case LV_EVENT_CLICKED:
	{
		/* Update button states */
		if (guider_ui.scrCopy_btnNext && lv_obj_is_valid(guider_ui.scrCopy_btnNext))
			lv_obj_clear_state(guider_ui.scrCopy_btnNext, LV_STATE_CHECKED);  // Sine
		if (guider_ui.scrCopy_imgColor && lv_obj_is_valid(guider_ui.scrCopy_imgColor))
			lv_obj_add_state(guider_ui.scrCopy_imgColor, LV_STATE_CHECKED);  // Triangle
		if (guider_ui.scrCopy_sliderHue && lv_obj_is_valid(guider_ui.scrCopy_sliderHue))
			lv_obj_clear_state(guider_ui.scrCopy_sliderHue, LV_STATE_CHECKED);  // Square

		/* Set wave type to triangle */
		current_wave_type = 1;

		/* Update waveform with current parameters */
		int32_t freq_val = lv_slider_get_value(guider_ui.scrCopy_sliderBright);
		uint32_t frequency = calc_frequency_from_slider(freq_val);
		uint16_t amplitude = get_amplitude_value();

		update_waveform_display(guider_ui.scrCopy_imgScanned, 1, frequency, amplitude);

		/* Send command to STM32 signal generator */
		float amp_volts = amplitude / 100.0f;
		stm32_siggen_set_all(WAVE_TRIANGLE, (float)frequency, amp_volts);
		break;
	}
	default:
		break;
	}
}

static void scrCopy_btnBack_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);

	switch (code) {
	case LV_EVENT_CLICKED:
	{
		ui_load_scr_animation(&guider_ui, &guider_ui.scrHome, guider_ui.scrHome_del, &guider_ui.scrCopy_del, setup_scr_scrHome, LV_SCR_LOAD_ANIM_FADE_ON, 0, 0, false, true);
		break;
	}
	default:
		break;
	}
}

/* Apply button event handler - sends signal generator settings to STM32 */
static void scrCopy_btnApply_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);

	switch (code) {
	case LV_EVENT_CLICKED:
	{
		/* Get current wave type from button states */
		int wave_type = 0;  /* Default: sine */
		if (lv_obj_has_state(guider_ui.scrCopy_imgColor, LV_STATE_CHECKED)) {
			wave_type = 1;  /* Triangle */
		} else if (lv_obj_has_state(guider_ui.scrCopy_sliderHue, LV_STATE_CHECKED)) {
			wave_type = 2;  /* Square */
		}

		/* Get frequency from slider */
		int32_t freq_slider_val = lv_slider_get_value(guider_ui.scrCopy_sliderBright);
		uint32_t frequency;
		if (freq_slider_val <= 100) {
			frequency = freq_slider_val * 10;
		} else if (freq_slider_val <= 190) {
			frequency = 1000 + (freq_slider_val - 100) * 100;
		} else if (freq_slider_val <= 590) {
			frequency = 10000 + (freq_slider_val - 190) * 250;
		} else {
			frequency = 110000 + (freq_slider_val - 590) * 4610;
		}

		/* Get amplitude - need to find the amplitude slider */
		extern lv_obj_t* scrCopy_get_amplitude_slider(void);
		lv_obj_t *amp_slider = scrCopy_get_amplitude_slider();
		float amplitude = 1.5f;  /* Default */
		if (amp_slider && lv_obj_is_valid(amp_slider)) {
			uint16_t amp_val = lv_slider_get_value(amp_slider);
			amplitude = amp_val / 100.0f;  /* Convert to Vpp */
		}

		/* Send command to STM32 */
		esp_err_t ret = stm32_siggen_set_all((uint8_t)wave_type, (float)frequency, amplitude);
		
		/* Show toast notification */
		const char *wave_names[] = {"Sine", "Triangle", "Square"};
		char toast_msg[64];
		if (ret == ESP_OK) {
			snprintf(toast_msg, sizeof(toast_msg), LV_SYMBOL_OK " %s %.0fHz %.2fV", 
			         wave_names[wave_type], (float)frequency, amplitude);
			show_toast(toast_msg, true, 1500);
		} else {
			show_toast(LV_SYMBOL_CLOSE " Send Failed", false, 2000);
		}
		break;
	}
	default:
		break;
	}
}

void events_init_scrCopy(lv_ui *ui)
{
	lv_obj_add_event_cb(ui->scrCopy, scrCopy_event_handler, LV_EVENT_ALL, ui);
	lv_obj_add_event_cb(ui->scrCopy_sliderBright, scrCopy_sliderBright_event_handler, LV_EVENT_ALL, ui);
	lv_obj_add_event_cb(ui->scrCopy_sliderHue, scrCopy_sliderHue_event_handler, LV_EVENT_ALL, ui);
	lv_obj_add_event_cb(ui->scrCopy_btnNext, scrCopy_btnNext_event_handler, LV_EVENT_ALL, ui);
	lv_obj_add_event_cb(ui->scrCopy_imgColor, scrCopy_imgColor_event_handler, LV_EVENT_ALL, ui);
	lv_obj_add_event_cb(ui->scrCopy_btnBack, scrCopy_btnBack_event_handler, LV_EVENT_ALL, ui);
	lv_obj_add_event_cb(ui->scrCopy_btnApply, scrCopy_btnApply_event_handler, LV_EVENT_ALL, ui);
}

static void scrPrintMenu_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);

	switch (code) {
	case LV_EVENT_SCREEN_LOADED:
	{
		ui_scale_animation(guider_ui.scrPrintMenu_contBG, 0, 0, 800, 150, &lv_anim_path_ease_out, 0, 0, 0, 0, NULL, NULL, NULL);
		
		/* 切换STM32到万用表模式，开始上报测量数据 */
		stm32_set_mode(STM32_MODE_MULTIMETER);
		ESP_LOGI("DMM_UI", "Multimeter screen loaded, mode switched to MULTIMETER");
		break;
	}
	case LV_EVENT_SCREEN_UNLOADED:
	{
		/* 页面卸载时切换回空闲模式 */
		stm32_set_mode(STM32_MODE_IDLE);
		ESP_LOGI("DMM_UI", "Multimeter screen unloaded, mode switched to IDLE");
		break;
	}
	default:
		break;
	}
}
static void scrPrintMenu_btnBack_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);

	switch (code) {
	case LV_EVENT_CLICKED:
	{
		ui_load_scr_animation(&guider_ui, &guider_ui.scrHome, guider_ui.scrHome_del, &guider_ui.scrPrintMenu_del, setup_scr_scrHome, LV_SCR_LOAD_ANIM_FADE_ON, 0, 0, false, true);
		break;
	}
	default:
		break;
	}
}
void events_init_scrPrintMenu(lv_ui *ui)
{
	lv_obj_add_event_cb(ui->scrPrintMenu, scrPrintMenu_event_handler, LV_EVENT_ALL, ui);
	lv_obj_add_event_cb(ui->scrPrintMenu_btnBack, scrPrintMenu_btnBack_event_handler, LV_EVENT_ALL, ui);
}

/* Power Supply state variables */
// Settings (controlled by UI)
static float ps_voltage_set = 5.0f;       // Voltage setting (0-12V)
static float ps_current_set = 1.0f;       // Current limit setting (0-2A)
static bool ps_output_enabled = false;   // Output ON/OFF state

