Jackcdut/Graduation-project-ESP32/BSP/GUIDER/generated/events_init.c
// Actual measurements (updated by ESP32)
static float ps_voltage_actual = 5.0f;   // Actual measured voltage
static float ps_current_actual = 0.24f;  // Actual measured current
static float ps_power_actual = 1.1750f;  // Actual measured power
static bool ps_cc_mode = true;           // true = CC mode, false = CV mode

// Chart data
static int ps_chart_index = 0;

/* Helper function to set mode indicator style */
static void ps_set_mode_indicator_style(const char* mode_text, uint32_t bg_color, uint32_t grad_color, uint32_t border_color, uint32_t shadow_color)
{
	lv_label_set_text(guider_ui.scrPowerSupply_labelModeStatus, mode_text);
	lv_obj_set_style_bg_color(guider_ui.scrPowerSupply_labelModeStatus, lv_color_hex(bg_color), LV_PART_MAIN|LV_STATE_DEFAULT);
	lv_obj_set_style_bg_grad_color(guider_ui.scrPowerSupply_labelModeStatus, lv_color_hex(grad_color), LV_PART_MAIN|LV_STATE_DEFAULT);
	lv_obj_set_style_border_color(guider_ui.scrPowerSupply_labelModeStatus, lv_color_hex(border_color), LV_PART_MAIN|LV_STATE_DEFAULT);
	lv_obj_set_style_shadow_color(guider_ui.scrPowerSupply_labelModeStatus, lv_color_hex(shadow_color), LV_PART_MAIN|LV_STATE_DEFAULT);
}

/* Set CV mode style - blue theme */
static void ps_set_cv_mode_style(void)
{
	ps_set_mode_indicator_style("CV", 0x3498db, 0x2980b9, 0x5dade2, 0x2980b9);
}

/* Set CC mode style - orange theme */
static void ps_set_cc_mode_style(void)
{
	ps_set_mode_indicator_style("CC", 0xf39c12, 0xe67e22, 0xf5b041, 0xe67e22);
}

/* Set disabled mode style - gray theme */
static void ps_set_disabled_mode_style(void)
{
	ps_set_mode_indicator_style("--", 0x95a5a6, 0x7f8c8d, 0xbdc3c7, 0x7f8c8d);
}

static void scrPowerSupply_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);

	switch (code) {
	case LV_EVENT_SCREEN_LOADED:
	{
		ui_scale_animation(guider_ui.scrPowerSupply_contBG, 150, 0, 800, 70, &lv_anim_path_ease_out, 0, 0, 0, 0, NULL, NULL, NULL);
		
		/* 初始化电源模块并注册数据回调 */
		extern esp_err_t ps_global_init(void);
		ps_global_init();
		
		/* 切换STM32到电源模式，开始上报电源数据 */
		stm32_set_mode(STM32_MODE_POWER_SUPPLY);
		
		ESP_LOGI("POWER_UI", "Power supply screen loaded, mode switched to POWER");
		break;
	}
	case LV_EVENT_SCREEN_UNLOADED:
	{
		/* 页面卸载时切换回空闲模式 */
		stm32_set_mode(STM32_MODE_IDLE);
		ESP_LOGI("POWER_UI", "Power supply screen unloaded, mode switched to IDLE");
		break;
	}
	default:
		break;
	}
}

/* Mode switch handler (CC/CV) */
static void scrPowerSupply_labelModeStatus_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);

	switch (code) {
	case LV_EVENT_CLICKED:
	{
		// Toggle mode based on current state
		if (lv_obj_has_state(guider_ui.scrPowerSupply_labelModeStatus, LV_STATE_CHECKED)) {
			// Currently CC, switch to CV
			ps_cc_mode = false;
			ps_set_cv_mode_style();
			lv_obj_clear_state(guider_ui.scrPowerSupply_labelModeStatus, LV_STATE_CHECKED);
		} else {
			// Currently CV, switch to CC
			ps_cc_mode = true;
			ps_set_cc_mode_style();
			lv_obj_add_state(guider_ui.scrPowerSupply_labelModeStatus, LV_STATE_CHECKED);
		}
		// Force refresh
		lv_obj_invalidate(guider_ui.scrPowerSupply_labelModeStatus);

		// NOTE: ESP32 should monitor ps_get_mode() and adjust regulation mode accordingly
		break;
	}
	default:
		break;
	}
}

/* Power switch event handler */
static void scrPowerSupply_switchPower_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);

	switch (code) {
	case LV_EVENT_VALUE_CHANGED:
	{
		ps_output_enabled = lv_obj_has_state(guider_ui.scrPowerSupply_switchPower, LV_STATE_CHECKED);

		/* 发送命令到STM32 */
		stm32_power_enable(ps_output_enabled);

		if (!ps_output_enabled) {
			// Output disabled - reset displays to zero
			lv_label_set_text(guider_ui.scrPowerSupply_labelVoltageValue, "0.00");
			lv_label_set_text(guider_ui.scrPowerSupply_labelCurrentValue, "0.000");
			lv_label_set_text(guider_ui.scrPowerSupply_labelPowerValue, "0.000");

			// Show disabled mode
			ps_set_disabled_mode_style();

			// Update chart with zero
			lv_chart_set_next_value(guider_ui.scrPowerSupply_chartPower, guider_ui.scrPowerSupply_chartPowerSeries, 0);
		} else {
			// Output enabled - restore mode display
			if (ps_cc_mode) {
				ps_set_cc_mode_style();
			} else {
				ps_set_cv_mode_style();
			}
		}
		break;
	}
	default:
		break;
	}
}

/* Voltage slider event handler */
static void scrPowerSupply_sliderVoltage_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);

	switch (code) {
	case LV_EVENT_VALUE_CHANGED:
	{
		int32_t slider_val = lv_slider_get_value(guider_ui.scrPowerSupply_sliderVoltage);
		ps_voltage_set = slider_val / 100.0f;  // Convert to voltage (0-12.00V)

		char voltage_str[16];
		snprintf(voltage_str, sizeof(voltage_str), "%.2f V", ps_voltage_set);
		lv_label_set_text(guider_ui.scrPowerSupply_labelVoltageSet, voltage_str);

		/* 发送电压设置命令到STM32 */
		stm32_power_set_voltage(ps_voltage_set);
		break;
	}
	default:
		break;
	}
}

/* Current slider event handler */
static void scrPowerSupply_sliderCurrent_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);

	switch (code) {
	case LV_EVENT_VALUE_CHANGED:
	{
		int32_t slider_val = lv_slider_get_value(guider_ui.scrPowerSupply_sliderCurrent);
		ps_current_set = slider_val / 1000.0f;  // Convert to current (0-2.000A)

		char current_str[16];
		snprintf(current_str, sizeof(current_str), "%.3f A", ps_current_set);
		lv_label_set_text(guider_ui.scrPowerSupply_labelCurrentSet, current_str);

		/* 发送电流设置命令到STM32 */
		stm32_power_set_current(ps_current_set);
		break;
	}
	default:
		break;
	}
}

/* Back button event handler */
static void scrPowerSupply_btnBack_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);

	switch (code) {
	case LV_EVENT_CLICKED:
	{
		ui_load_scr_animation(&guider_ui, &guider_ui.scrHome, guider_ui.scrHome_del, &guider_ui.scrPowerSupply_del, setup_scr_scrHome, LV_SCR_LOAD_ANIM_FADE_ON, 0, 0, false, true);
		break;
	}
	default:
		break;
	}
}

void events_init_scrPowerSupply(lv_ui *ui)
{
	lv_obj_add_event_cb(ui->scrPowerSupply, scrPowerSupply_event_handler, LV_EVENT_ALL, ui);
	lv_obj_add_event_cb(ui->scrPowerSupply_switchPower, scrPowerSupply_switchPower_event_handler, LV_EVENT_ALL, ui);
	lv_obj_add_event_cb(ui->scrPowerSupply_labelModeStatus, scrPowerSupply_labelModeStatus_event_handler, LV_EVENT_ALL, ui);
	lv_obj_add_event_cb(ui->scrPowerSupply_sliderVoltage, scrPowerSupply_sliderVoltage_event_handler, LV_EVENT_ALL, ui);
	lv_obj_add_event_cb(ui->scrPowerSupply_sliderCurrent, scrPowerSupply_sliderCurrent_event_handler, LV_EVENT_ALL, ui);
	lv_obj_add_event_cb(ui->scrPowerSupply_btnBack, scrPowerSupply_btnBack_event_handler, LV_EVENT_ALL, ui);
}

void events_init(lv_ui *ui)
{

