Jackcdut/Graduation-project-ESP32/BSP/GUIDER/generated/events_init.c
}

/* ========================================
 * ESP32 Interface Functions
 * These functions should be called by ESP32 to update actual measurements
 * ========================================*/

/**
 * @brief Update actual voltage measurement (called by ESP32)
 * @param voltage_actual Measured voltage in volts (0-12V)
 */
void ps_update_voltage_actual(float voltage_actual)
{
	ps_voltage_actual = voltage_actual;
	char voltage_str[16];
	snprintf(voltage_str, sizeof(voltage_str), "%.2f", ps_voltage_actual);
	lv_label_set_text(guider_ui.scrPowerSupply_labelVoltageValue, voltage_str);
}

/**
 * @brief Update actual current measurement (called by ESP32)
 * @param current_actual Measured current in amps (0-2A)
 */
void ps_update_current_actual(float current_actual)
{
	ps_current_actual = current_actual;
	char current_str[16];
	snprintf(current_str, sizeof(current_str), "%.3f", ps_current_actual);
	lv_label_set_text(guider_ui.scrPowerSupply_labelCurrentValue, current_str);
}

/**
 * @brief Update actual power measurement (called by ESP32)
 * @param power_actual Measured power in watts
 */
void ps_update_power_actual(float power_actual)
{
	ps_power_actual = power_actual;
	char power_str[16];
	snprintf(power_str, sizeof(power_str), "%.3f", ps_power_actual);
	lv_label_set_text(guider_ui.scrPowerSupply_labelPowerValue, power_str);

	// Update chart with actual power (scaled by 10 for chart range 0-120, max 12W)
	lv_chart_set_next_value(guider_ui.scrPowerSupply_chartPower,
	                        guider_ui.scrPowerSupply_chartPowerSeries,
	                        (int)(ps_power_actual * 10));
}

/**
 * @brief Update operating mode display (NOT typically called - mode is set by user button)
 * @param is_cc_mode true for CC (Constant Current) mode, false for CV (Constant Voltage) mode
 * @note This function is provided for compatibility, but mode should be set by user via button
 */
void ps_update_mode(bool is_cc_mode)
{
	ps_cc_mode = is_cc_mode;
	if (is_cc_mode) {
		ps_set_cc_mode_style();
		lv_obj_add_state(guider_ui.scrPowerSupply_labelModeStatus, LV_STATE_CHECKED);
	} else {
		ps_set_cv_mode_style();
		lv_obj_clear_state(guider_ui.scrPowerSupply_labelModeStatus, LV_STATE_CHECKED);
	}
}

/**
 * @brief Update all measurements at once (called by ESP32)
 * @param voltage_actual Measured voltage in volts
 * @param current_actual Measured current in amps
 * @param power_actual Measured power in watts
 * @param is_cc_mode Current operating mode
 */
void ps_update_measurements(float voltage_actual, float current_actual, float power_actual, bool is_cc_mode)
{
	ps_update_voltage_actual(voltage_actual);
	ps_update_current_actual(current_actual);
	ps_update_power_actual(power_actual);
	ps_update_mode(is_cc_mode);
}

/**
 * @brief Get current voltage setting
 * @return Voltage setting in volts
 */
float ps_get_voltage_set(void)
{
	return ps_voltage_set;
}

/**
 * @brief Get current limit setting
 * @return Current limit in amps
 */
float ps_get_current_set(void)
{
	return ps_current_set;
}

/**
 * @brief Get output enable state
 * @return true if output is enabled, false otherwise
 */
bool ps_get_output_enabled(void)
{
	return ps_output_enabled;
}

/**
 * @brief Get current operating mode
 * @return true for CC mode, false for CV mode
 */
bool ps_get_mode(void)
{
	return ps_cc_mode;
}

/* ========================================
 * AI Chat Screen Event Handlers
 * ========================================*/

// 保存当前的键盘对象指针和textarea指针，用于事件处理
// Store current keyboard and textarea for event handling
static lv_obj_t * current_keyboard = NULL;
static lv_obj_t * current_textarea = NULL;

// 辅助函数 - 关闭键盘
// Helper function to close keyboard
static void close_keyboard(void)
{
	if (current_keyboard != NULL) {
		lv_obj_del(current_keyboard);
		current_keyboard = NULL;
		current_textarea = NULL;
	}
}

// 键盘事件处理 - 点击确认或取消按钮时关闭键盘
// Keyboard event handler - close on OK/Cancel button
static void keyboard_event_handler(lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);

	if (code == LV_EVENT_READY || code == LV_EVENT_CANCEL) {
		// 用户点击了 OK (√) 或 Cancel 按钮
		// User clicked OK (√) or Cancel button
		close_keyboard();
	}
}

// 屏幕点击事件处理 - 点击键盘和输入框外部时关闭键盘
// Screen event handler - close keyboard when clicking outside
static void screen_event_handler(lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);

	if (code == LV_EVENT_PRESSED) {  // 使用 PRESSED 事件更可靠
		lv_obj_t * target = lv_event_get_target(e);

		// 如果没有键盘，直接返回
		if (current_keyboard == NULL) {
			return;
		}

		// 检查点击目标是否是键盘或其子对象
		bool is_keyboard_or_child = false;
		lv_obj_t * parent = target;
		lv_obj_t * scr = lv_scr_act();

		while (parent != NULL && parent != scr) {
			if (parent == current_keyboard) {
				is_keyboard_or_child = true;
				break;
			}
			parent = lv_obj_get_parent(parent);
		}

		// 检查点击目标是否是textarea或其子对象
		bool is_textarea_or_child = false;
		parent = target;

		while (parent != NULL && parent != scr) {
			if (parent == current_textarea) {
				is_textarea_or_child = true;
				break;
			}
			parent = lv_obj_get_parent(parent);
		}

		// 如果点击的既不是键盘也不是textarea，则关闭键盘
		// If clicked outside keyboard and textarea, close keyboard
		if (!is_keyboard_or_child && !is_textarea_or_child) {
			close_keyboard();
		}
	}
}

/* ========================================
 * Settings Screen Event Handlers
 * ========================================*/

// Current selected menu (0=Brightness, 1=WiFi, 2=About)
static int current_settings_menu = 0;

// WiFi state management
static bool wifi_scanning = false;
static char wifi_ssid_buffer[64] = "";
static char wifi_password_buffer[64] = "";

// Track where to return from scrPrintInternet (0=PrintMenu, 1=Settings)
static int scrPrintInternet_return_target = 0;

/* WiFi status flags - safe cross-task communication */
typedef enum {
	WIFI_STATUS_IDLE = 0,
	WIFI_STATUS_CONNECTING,
	WIFI_STATUS_CONNECTED,
	WIFI_STATUS_FAILED
} wifi_status_flag_t;

static volatile wifi_status_flag_t s_wifi_status_pending = WIFI_STATUS_IDLE;
static char s_wifi_pending_ssid[64] = {0};
static lv_timer_t *s_wifi_status_poll_timer = NULL;
static uint32_t s_wifi_status_change_tick = 0;

/* Forward declaration of poll timer callback */
static void wifi_status_poll_timer_cb(lv_timer_t * timer);

/* Screen transition callbacks removed - staying on Settings screen */

