Jackcdut/Graduation-project-ESP32/BSP/GUIDER/generated/events_init.c
/* SNTP removed - using OneNet cloud time instead */

// Helper function to switch menu panels with animation
static void switch_settings_panel(lv_ui *ui, int menu_index)
{
	if (current_settings_menu == menu_index) return;

	// Update menu buttons state
	lv_obj_clear_state(ui->scrSettings_btnMenuBrightness, LV_STATE_CHECKED);
	lv_obj_clear_state(ui->scrSettings_btnMenuWifi, LV_STATE_CHECKED);
	lv_obj_clear_state(ui->scrSettings_btnMenuAbout, LV_STATE_CHECKED);
	lv_obj_clear_state(ui->scrSettings_btnMenuGallery, LV_STATE_CHECKED);
	if (ui->scrSettings_btnMenuCloud) {
		lv_obj_clear_state(ui->scrSettings_btnMenuCloud, LV_STATE_CHECKED);
	}

	// Fade out current panel
	lv_obj_t *current_panel = NULL;
	switch (current_settings_menu) {
		case 0: current_panel = ui->scrSettings_contBrightnessPanel; break;
		case 1: current_panel = ui->scrSettings_contWifiPanel; break;
		case 2: current_panel = ui->scrSettings_contAboutPanel; break;
		case 3: 
			/* SD Card Manager is full-screen overlay - destroy it */
			sdcard_manager_ui_destroy();
			current_panel = NULL;
			break;
		case 4:
			/* Cloud Manager - destroy UI */
			cloud_manager_ui_destroy();
			current_panel = ui->scrSettings_contCloudPanel;
			break;
	}

	if (current_panel) {
		lv_obj_add_flag(current_panel, LV_OBJ_FLAG_HIDDEN);
	}

	// Fade in new panel with animation
	lv_obj_t *new_panel = NULL;
	switch (menu_index) {
		case 0:
			new_panel = ui->scrSettings_contBrightnessPanel;
			lv_obj_add_state(ui->scrSettings_btnMenuBrightness, LV_STATE_CHECKED);
			break;
		case 1:
			new_panel = ui->scrSettings_contWifiPanel;
			lv_obj_add_state(ui->scrSettings_btnMenuWifi, LV_STATE_CHECKED);
			break;
		case 2:
			new_panel = ui->scrSettings_contAboutPanel;
			lv_obj_add_state(ui->scrSettings_btnMenuAbout, LV_STATE_CHECKED);
			break;
		case 3:
			/* SD Card Manager - create full-screen overlay UI */
			lv_obj_add_state(ui->scrSettings_btnMenuGallery, LV_STATE_CHECKED);
			/* First destroy existing UI if any */
			sdcard_manager_ui_destroy();
			/* Create full-screen SD Card Manager UI (overlays on screen) */
			sdcard_manager_ui_create(NULL);
			/* Don't set new_panel - the UI is a full-screen overlay */
			new_panel = NULL;
			break;
		case 4:
			/* Cloud Manager - create UI in panel */
			if (ui->scrSettings_btnMenuCloud) {
				lv_obj_add_state(ui->scrSettings_btnMenuCloud, LV_STATE_CHECKED);
			}
			/* First show the cloud panel */
			if (ui->scrSettings_contCloudPanel) {
				lv_obj_clear_flag(ui->scrSettings_contCloudPanel, LV_OBJ_FLAG_HIDDEN);
			}
			/* Create Cloud Manager UI inside the panel */
			cloud_manager_ui_create(ui->scrSettings_contCloudPanel);
			/* Don't set new_panel - we already showed it */
			new_panel = NULL;
			break;
	}

	if (new_panel) {
		lv_obj_clear_flag(new_panel, LV_OBJ_FLAG_HIDDEN);

		// Slide in animation
		lv_obj_set_x(new_panel, 50);
		lv_anim_t a;
		lv_anim_init(&a);
		lv_anim_set_var(&a, new_panel);
		lv_anim_set_values(&a, 50, 0);
		lv_anim_set_time(&a, 300);
		lv_anim_set_exec_cb(&a, (lv_anim_exec_xcb_t)lv_obj_set_x);
		lv_anim_set_path_cb(&a, lv_anim_path_ease_out);
		lv_anim_start(&a);
	}

	current_settings_menu = menu_index;
}

static void scrSettings_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);

	switch (code) {
	case LV_EVENT_SCREEN_LOADED:
	{
		// Initialize menu state - default to Brightness
		current_settings_menu = 0;
		lv_obj_add_state(guider_ui.scrSettings_btnMenuBrightness, LV_STATE_CHECKED);
		lv_obj_clear_flag(guider_ui.scrSettings_contBrightnessPanel, LV_OBJ_FLAG_HIDDEN);
		lv_obj_add_flag(guider_ui.scrSettings_contWifiPanel, LV_OBJ_FLAG_HIDDEN);
		lv_obj_add_flag(guider_ui.scrSettings_contAboutPanel, LV_OBJ_FLAG_HIDDEN);

		// Animate top bar and content panels on screen load
		ui_scale_animation(guider_ui.scrSettings_contBG, 0, 0, 800, 70, &lv_anim_path_ease_out, 0, 0, 0, 0, NULL, NULL, NULL);

		// Slide in left menu
		lv_obj_set_x(guider_ui.scrSettings_contLeft, -240);
		lv_anim_t a;
		lv_anim_init(&a);
		lv_anim_set_var(&a, guider_ui.scrSettings_contLeft);
		lv_anim_set_values(&a, -240, 20);
		lv_anim_set_time(&a, 400);
		lv_anim_set_delay(&a, 100);
		lv_anim_set_exec_cb(&a, (lv_anim_exec_xcb_t)lv_obj_set_x);
		lv_anim_set_path_cb(&a, lv_anim_path_ease_out);
		lv_anim_start(&a);

		// Slide in right content
		lv_obj_set_x(guider_ui.scrSettings_contRight, 800);
		lv_anim_t b;
		lv_anim_init(&b);
		lv_anim_set_var(&b, guider_ui.scrSettings_contRight);
		lv_anim_set_values(&b, 800, 260);
		lv_anim_set_time(&b, 400);
		lv_anim_set_delay(&b, 0);
		lv_anim_set_exec_cb(&b, (lv_anim_exec_xcb_t)lv_obj_set_x);
		lv_anim_set_path_cb(&b, lv_anim_path_ease_out);
		lv_anim_start(&b);

		// Reset to brightness panel
		current_settings_menu = 0;

		/* Start WiFi status polling timer (100ms interval) */
		if (s_wifi_status_poll_timer == NULL) {
			s_wifi_status_poll_timer = lv_timer_create(wifi_status_poll_timer_cb, 100, NULL);
		}
		break;
	}
	case LV_EVENT_SCREEN_UNLOADED:
	{
		/* Stop WiFi status polling timer when leaving Settings */
		if (s_wifi_status_poll_timer != NULL) {
			lv_timer_del(s_wifi_status_poll_timer);
			s_wifi_status_poll_timer = NULL;
		}
		break;
	}
	default:
		break;
	}
}

static void scrSettings_btnBack_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);

	switch (code) {
	case LV_EVENT_CLICKED:
	{
		ui_load_scr_animation(&guider_ui, &guider_ui.scrHome, guider_ui.scrHome_del, &guider_ui.scrSettings_del, setup_scr_scrHome, LV_SCR_LOAD_ANIM_FADE_ON, 0, 0, false, true);
		break;
	}
	default:
		break;
	}
}

/* Menu button event handlers */
static void scrSettings_btnMenuBrightness_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);
	lv_ui *ui = (lv_ui*)lv_event_get_user_data(e);

	switch (code) {
	case LV_EVENT_CLICKED:
	{
		switch_settings_panel(ui, 0);
		break;
	}
	default:
		break;
	}
}

static void scrSettings_btnMenuWifi_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);
	lv_ui *ui = (lv_ui*)lv_event_get_user_data(e);

	switch (code) {
	case LV_EVENT_CLICKED:
	{
		switch_settings_panel(ui, 1);
		break;
	}
	default:
		break;
	}
}

static void scrSettings_btnMenuAbout_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);
	lv_ui *ui = (lv_ui*)lv_event_get_user_data(e);

	switch (code) {
	case LV_EVENT_CLICKED:
	{
		switch_settings_panel(ui, 2);
		break;
	}
	default:
		break;
	}
}

static void scrSettings_btnMenuGallery_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);
	lv_ui *ui = (lv_ui*)lv_event_get_user_data(e);

	switch (code) {
	case LV_EVENT_CLICKED:
	{
		switch_settings_panel(ui, 3);
		break;
	}
	default:
		break;
	}
}

static void scrSettings_btnMenuCloud_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);
	lv_ui *ui = (lv_ui*)lv_event_get_user_data(e);

	switch (code) {
	case LV_EVENT_CLICKED:
	{
		switch_settings_panel(ui, 4);
		break;
	}
	default:
		break;
	}
}


/* Brightness slider event handler */
static void scrSettings_sliderBrightness_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);
	lv_ui *ui = (lv_ui*)lv_event_get_user_data(e);

	switch (code) {
	case LV_EVENT_VALUE_CHANGED:
	{
		int32_t brightness = lv_slider_get_value(ui->scrSettings_sliderBrightness);
		char brightness_str[16];
		snprintf(brightness_str, sizeof(brightness_str), "%d%%", (int)brightness);
		lv_label_set_text(ui->scrSettings_labelBrightnessValue, brightness_str);

		/* Call ESP32 BSP function to adjust actual screen brightness */
		bsp_display_brightness_set((int)brightness);
		ESP_LOGI("SETTINGS", "Brightness set to %d%%", (int)brightness);
		break;
	}
	default:
		break;
	}
}

