Jackcdut/Graduation-project-ESP32/BSP/GUIDER/generated/events_init.c
/* WiFi scan button event handler */
static void scrSettings_btnWifiScan_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);
	lv_ui *ui = (lv_ui*)lv_event_get_user_data(e);

	switch (code) {
	case LV_EVENT_CLICKED:
	{
		if (wifi_scanning) return;  // Already scanning

		wifi_scanning = true;

		// Show scanning animation
		lv_obj_clear_flag(ui->scrSettings_spinnerWifiScan, LV_OBJ_FLAG_HIDDEN);

		// Disable scan button during scan
		lv_obj_add_state(ui->scrSettings_btnWifiScan, LV_STATE_DISABLED);
		lv_label_set_text(ui->scrSettings_btnWifiScan_label, "Scanning...");

		// Clear current list
		lv_obj_clean(ui->scrSettings_listWifi);

		/* Start WiFi scan using wifi_manager */
		extern esp_err_t wifi_manager_scan_start(void (*)(uint16_t));
		extern esp_err_t wifi_manager_get_scan_results(wifi_ap_record_t *, uint16_t *);
		extern void wifi_scan_result_callback(const char *[], int [], int);

		// Start scan (callback will be triggered when done)
		esp_err_t scan_ret = wifi_manager_scan_start(NULL);

		if (scan_ret != ESP_OK) {
			// Scan failed to start - reset state and show error
			ESP_LOGE("WIFI_SCAN", "Failed to start scan: %s", esp_err_to_name(scan_ret));
			wifi_scanning = false;
			lv_obj_add_flag(ui->scrSettings_spinnerWifiScan, LV_OBJ_FLAG_HIDDEN);
			lv_obj_clear_state(ui->scrSettings_btnWifiScan, LV_STATE_DISABLED);
			lv_label_set_text(ui->scrSettings_btnWifiScan_label, LV_SYMBOL_REFRESH " Scan");

			// Show error message
			lv_obj_t * btn = lv_list_add_btn(ui->scrSettings_listWifi, LV_SYMBOL_WARNING, "Scan failed - WiFi not initialized");
			lv_obj_set_style_text_color(lv_obj_get_child(btn, 1), lv_color_hex(0xe74c3c), LV_PART_MAIN|LV_STATE_DEFAULT);
			break;
		}

		// Add scanning message
		lv_obj_t * btn = lv_list_add_btn(ui->scrSettings_listWifi, LV_SYMBOL_WIFI, "Scanning...");
		lv_obj_set_style_text_color(lv_obj_get_child(btn, 1), lv_color_hex(0x3498db), LV_PART_MAIN|LV_STATE_DEFAULT);

		// Create a REPEATING timer to check scan results (non-blocking polling)
		// Timer will check every 500ms until scan completes or times out
		// Maximum 20 checks = 10 seconds total timeout
		lv_timer_t *scan_check_timer = lv_timer_create(wifi_scan_check_timer_cb, 500, NULL);
		lv_timer_set_repeat_count(scan_check_timer, 20);  // Check up to 20 times (10 seconds max)

		break;
	}
	default:
		break;
	}
}

// WiFi dialog keyboard pointer
static lv_obj_t * wifi_keyboard = NULL;
static lv_obj_t * wifi_active_textarea = NULL;

// Helper function to close WiFi keyboard
static void close_wifi_keyboard(void)
{
	if (wifi_keyboard != NULL) {
		lv_obj_del(wifi_keyboard);
		wifi_keyboard = NULL;
		wifi_active_textarea = NULL;
	}
}

// WiFi keyboard event handler
static void wifi_keyboard_event_handler(lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);
	if (code == LV_EVENT_READY || code == LV_EVENT_CANCEL) {
		close_wifi_keyboard();
	}
}

// Helper function to show WiFi keyboard
static void show_wifi_keyboard(lv_ui *ui, lv_obj_t *textarea)
{
	if (wifi_keyboard == NULL) {
		wifi_keyboard = lv_keyboard_create(ui->scrSettings);
		lv_keyboard_set_textarea(wifi_keyboard, textarea);
		lv_keyboard_set_mode(wifi_keyboard, LV_KEYBOARD_MODE_TEXT_LOWER);
		lv_obj_set_size(wifi_keyboard, 750, 240);
		lv_obj_align(wifi_keyboard, LV_ALIGN_BOTTOM_MID, 0, -10);
		lv_obj_set_style_bg_color(wifi_keyboard, lv_color_hex(0xf0f0f0), LV_PART_MAIN);
		wifi_active_textarea = textarea;

		// Add keyboard event to close on OK/Cancel
		lv_obj_add_event_cb(wifi_keyboard, wifi_keyboard_event_handler, LV_EVENT_ALL, NULL);
	} else {
		lv_keyboard_set_textarea(wifi_keyboard, textarea);
		wifi_active_textarea = textarea;
	}
}

/* WiFi custom input button event handler */
static void scrSettings_btnWifiCustom_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);
	lv_ui *ui = (lv_ui*)lv_event_get_user_data(e);

	switch (code) {
	case LV_EVENT_CLICKED:
	{
		// Show WiFi connection dialog
		lv_obj_clear_flag(ui->scrSettings_contWifiDialog, LV_OBJ_FLAG_HIDDEN);

		// Clear previous inputs
		lv_textarea_set_text(ui->scrSettings_textareaSSID, "");
		lv_textarea_set_text(ui->scrSettings_textareaPassword, "");

		// Move dialog to front
		lv_obj_move_foreground(ui->scrSettings_contWifiDialog);

		break;
	}
	default:
		break;
	}
}

/* WiFi Disconnect button timer callback */
static void wifi_disconnect_timer_cb(lv_timer_t * t)
{
	lv_ui *ui = (lv_ui*)t->user_data;
	lv_obj_set_style_bg_color(ui->scrSettings_btnWifiDisconnect, lv_color_hex(0xe74c3c), LV_PART_MAIN|LV_STATE_DEFAULT);
	lv_label_set_text(ui->scrSettings_btnWifiDisconnect_label, LV_SYMBOL_CLOSE " Disconnect");
	lv_timer_del(t);
}

/* WiFi Disconnect button event handler */
static void scrSettings_btnWifiDisconnect_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);
	lv_ui *ui = (lv_ui*)lv_event_get_user_data(e);

	switch (code) {
	case LV_EVENT_CLICKED:
	{
		// Visual feedback - change button color temporarily
		lv_obj_set_style_bg_color(ui->scrSettings_btnWifiDisconnect, lv_color_hex(0xc0392b), LV_PART_MAIN|LV_STATE_DEFAULT);
		
		// Disconnect WiFi
		esp_wifi_disconnect();
		
		// Update button text to show action
		lv_label_set_text(ui->scrSettings_btnWifiDisconnect_label, "Disconnecting...");
		
		// Create a timer to restore button state after 1 second
		lv_timer_create(wifi_disconnect_timer_cb, 1000, ui);
		
		break;
	}
	default:
		break;
	}
}

/* WiFi SSID textarea event handler */
static void scrSettings_textareaSSID_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);
	lv_ui *ui = (lv_ui*)lv_event_get_user_data(e);

	switch (code) {
	case LV_EVENT_CLICKED:
	{
		show_wifi_keyboard(ui, ui->scrSettings_textareaSSID);
		break;
	}
	default:
		break;
	}
}

/* WiFi Password textarea event handler */
static void scrSettings_textareaPassword_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);
	lv_ui *ui = (lv_ui*)lv_event_get_user_data(e);

	switch (code) {
	case LV_EVENT_CLICKED:
	{
		show_wifi_keyboard(ui, ui->scrSettings_textareaPassword);
		break;
	}
	default:
		break;
	}
}

/* WiFi Connect button event handler */
static void scrSettings_btnWifiConnect_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);
	lv_ui *ui = (lv_ui*)lv_event_get_user_data(e);

	switch (code) {
	case LV_EVENT_CLICKED:
	{
		const char *ssid = lv_textarea_get_text(ui->scrSettings_textareaSSID);
		const char *password = lv_textarea_get_text(ui->scrSettings_textareaPassword);

		// Validate input
		if (strlen(ssid) == 0) {
			lv_label_set_text(ui->scrSettings_labelWifiStatus, "Error: SSID is empty");
			lv_obj_set_style_text_color(ui->scrSettings_labelWifiStatus, lv_color_hex(0xe74c3c), LV_PART_MAIN|LV_STATE_DEFAULT);
			return;
		}

