Jackcdut/Graduation-project-ESP32/BSP/GUIDER/generated/events_init.c
		// Close keyboard and dialog
		close_wifi_keyboard();
		lv_obj_add_flag(ui->scrSettings_contWifiDialog, LV_OBJ_FLAG_HIDDEN);

		// Update status
		char status_text[128];
		snprintf(status_text, sizeof(status_text), "Connecting to %s...", ssid);
		lv_label_set_text(ui->scrSettings_labelWifiStatus, status_text);
		lv_obj_set_style_text_color(ui->scrSettings_labelWifiStatus, lv_color_hex(0xf39c12), LV_PART_MAIN|LV_STATE_DEFAULT);

		/* Set connecting state flag */
		s_wifi_status_pending = WIFI_STATUS_CONNECTING;
		s_wifi_status_change_tick = lv_tick_get();

		/* Connect to WiFi using wifi_manager */
		extern esp_err_t wifi_manager_connect(const char *, const char *, void (*)(bool, const char *));
		extern void onenet_wifi_status_callback(bool, const char *);

		// Start WiFi connection with OneNet callback
		esp_err_t ret = wifi_manager_connect(ssid, strlen(password) > 0 ? password : NULL, onenet_wifi_status_callback);
		if (ret != ESP_OK) {
			lv_label_set_text(ui->scrSettings_labelWifiStatus, "Connection failed!");
			lv_obj_set_style_text_color(ui->scrSettings_labelWifiStatus, lv_color_hex(0xe74c3c), LV_PART_MAIN|LV_STATE_DEFAULT);
			s_wifi_status_pending = WIFI_STATUS_FAILED;
		}

		break;
	}
	default:
		break;
	}
}

/* WiFi Cancel button event handler */
static void scrSettings_btnWifiCancel_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);
	lv_ui *ui = (lv_ui*)lv_event_get_user_data(e);

	switch (code) {
	case LV_EVENT_CLICKED:
	{
		// Close keyboard and dialog
		close_wifi_keyboard();
		lv_obj_add_flag(ui->scrSettings_contWifiDialog, LV_OBJ_FLAG_HIDDEN);
		break;
	}
	default:
		break;
	}
}

static void scrSettings_switchUSB_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);
	lv_ui *ui = (lv_ui*)lv_event_get_user_data(e);

	switch (code) {
	case LV_EVENT_VALUE_CHANGED:
	{
		/* USB switch toggled */
		extern void gallery_usb_switch_changed(lv_ui *ui, bool enabled);
		bool enabled = lv_obj_has_state(ui->scrSettings_switchUSB, LV_STATE_CHECKED);
		gallery_usb_switch_changed(ui, enabled);
		break;
	}
	default:
		break;
	}
}



void events_init_scrSettings(lv_ui *ui)
{
	lv_obj_add_event_cb(ui->scrSettings, scrSettings_event_handler, LV_EVENT_ALL, ui);
	lv_obj_add_event_cb(ui->scrSettings_btnBack, scrSettings_btnBack_event_handler, LV_EVENT_ALL, ui);
	lv_obj_add_event_cb(ui->scrSettings_btnMenuBrightness, scrSettings_btnMenuBrightness_event_handler, LV_EVENT_ALL, ui);
	lv_obj_add_event_cb(ui->scrSettings_btnMenuWifi, scrSettings_btnMenuWifi_event_handler, LV_EVENT_ALL, ui);
	lv_obj_add_event_cb(ui->scrSettings_btnMenuAbout, scrSettings_btnMenuAbout_event_handler, LV_EVENT_ALL, ui);
	lv_obj_add_event_cb(ui->scrSettings_btnMenuGallery, scrSettings_btnMenuGallery_event_handler, LV_EVENT_ALL, ui);
	if (ui->scrSettings_btnMenuCloud) {
		lv_obj_add_event_cb(ui->scrSettings_btnMenuCloud, scrSettings_btnMenuCloud_event_handler, LV_EVENT_ALL, ui);
	}
	lv_obj_add_event_cb(ui->scrSettings_sliderBrightness, scrSettings_sliderBrightness_event_handler, LV_EVENT_ALL, ui);
	lv_obj_add_event_cb(ui->scrSettings_btnWifiScan, scrSettings_btnWifiScan_event_handler, LV_EVENT_ALL, ui);
	lv_obj_add_event_cb(ui->scrSettings_btnWifiCustom, scrSettings_btnWifiCustom_event_handler, LV_EVENT_ALL, ui);
	lv_obj_add_event_cb(ui->scrSettings_btnWifiDisconnect, scrSettings_btnWifiDisconnect_event_handler, LV_EVENT_ALL, ui);
	lv_obj_add_event_cb(ui->scrSettings_textareaSSID, scrSettings_textareaSSID_event_handler, LV_EVENT_ALL, ui);
	lv_obj_add_event_cb(ui->scrSettings_textareaPassword, scrSettings_textareaPassword_event_handler, LV_EVENT_ALL, ui);
	lv_obj_add_event_cb(ui->scrSettings_btnWifiConnect, scrSettings_btnWifiConnect_event_handler, LV_EVENT_ALL, ui);
	lv_obj_add_event_cb(ui->scrSettings_btnWifiCancel, scrSettings_btnWifiCancel_event_handler, LV_EVENT_ALL, ui);
	lv_obj_add_event_cb(ui->scrSettings_switchUSB, scrSettings_switchUSB_event_handler, LV_EVENT_ALL, ui);

	/* Initialize gallery module */
	extern esp_err_t gallery_init(lv_ui *ui);
	gallery_init(ui);

}

/* ========================================
 * Success/Finish Screen Event Handlers
 * (Reused for WiFi connection success)
 * ========================================*/

static void scrScanFini_btnNxet_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);

	switch (code) {
	case LV_EVENT_CLICKED:
	{
		/* === SAFE: Only set flag and start SNTP, let screen load event handle UI update === */

		/* 1. Update WiFi status FLAG (will be applied by restore_wifi_status_on_screen_load) */
		extern void set_wifi_connected_status(bool is_connected);
		set_wifi_connected_status(true);

		/* 2. SNTP will be initialized AFTER returning to home screen (via delayed timer) */
		/* This avoids CPU overload during screen transition */

		/* 3. Return to Home screen - screen load event will update WiFi icon + start delayed SNTP */
		ui_load_scr_animation(&guider_ui, &guider_ui.scrHome, guider_ui.scrHome_del, &guider_ui.scrScanFini_del, setup_scr_scrHome, LV_SCR_LOAD_ANIM_FADE_ON, 0, 0, false, true);
		break;
	}
	default:
		break;
	}
}

void events_init_scrScanFini(lv_ui *ui)
{
	lv_obj_add_event_cb(ui->scrScanFini_btnNxet, scrScanFini_btnNxet_event_handler, LV_EVENT_ALL, ui);
}

/* ========================================
 * ESP32 WiFi Interface Functions
 * These functions should be called by ESP32 after WiFi operations
 * ========================================*/

/* WiFi network list item click handler */
static void wifi_network_item_clicked(lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);

	if (code == LV_EVENT_CLICKED) {
		lv_obj_t *btn = lv_event_get_target(e);

		/* Get SSID from button user data */
		const char *ssid = (const char *)lv_obj_get_user_data(btn);
		if (ssid == NULL) return;

		/* Copy SSID to input field and show dialog */
		lv_textarea_set_text(guider_ui.scrSettings_textareaSSID, ssid);
		lv_textarea_set_text(guider_ui.scrSettings_textareaPassword, "");

		/* Show WiFi connection dialog */
		lv_obj_clear_flag(guider_ui.scrSettings_contWifiDialog, LV_OBJ_FLAG_HIDDEN);
		lv_obj_move_foreground(guider_ui.scrSettings_contWifiDialog);

