Jackcdut/Graduation-project-ESP32/BSP/GUIDER/generated/events_init.c
		/* Update status to show which network will be connected */
		char status_text[128];
		snprintf(status_text, sizeof(status_text), "Selected: %s", ssid);
		lv_label_set_text(guider_ui.scrSettings_labelWifiStatus, status_text);
		lv_obj_set_style_text_color(guider_ui.scrSettings_labelWifiStatus, lv_color_hex(0x3498db), LV_PART_MAIN|LV_STATE_DEFAULT);
	}
}

/**
 * @brief Update WiFi scan results (called by ESP32 after scan completes)
 * @param wifi_networks Array of WiFi network names
 * @param signal_strengths Array of signal strengths (RSSI)
 * @param count Number of networks found
 */
void wifi_scan_result_callback(const char *wifi_networks[], int signal_strengths[], int count)
{
	wifi_scanning = false;

	// Hide scanning animation
	lv_obj_add_flag(guider_ui.scrSettings_spinnerWifiScan, LV_OBJ_FLAG_HIDDEN);

	// Re-enable scan button
	lv_obj_clear_state(guider_ui.scrSettings_btnWifiScan, LV_STATE_DISABLED);
	lv_label_set_text(guider_ui.scrSettings_btnWifiScan_label, LV_SYMBOL_REFRESH " Scan");

	// Clear list
	lv_obj_clean(guider_ui.scrSettings_listWifi);

	if (count == 0) {
		lv_obj_t * btn = lv_list_add_btn(guider_ui.scrSettings_listWifi, LV_SYMBOL_WARNING, "No networks found");
		lv_obj_set_style_text_color(lv_obj_get_child(btn, 1), lv_color_hex(0xe74c3c), LV_PART_MAIN|LV_STATE_DEFAULT);
		lv_obj_set_style_text_font(lv_obj_get_child(btn, 1), &lv_font_ShanHaiZhongXiaYeWuYuW_16, LV_PART_MAIN|LV_STATE_DEFAULT);
	} else {
		// Static storage for SSID strings (needed because pointers must remain valid)
		static char stored_ssids[15][64];

		// Add WiFi networks to list
		for (int i = 0; i < count && i < 15; i++) {  // Limit to 15 networks
			char item_text[128];
			const char *signal_icon = LV_SYMBOL_WIFI;

			// Store SSID in static buffer
			strncpy(stored_ssids[i], wifi_networks[i], sizeof(stored_ssids[i]) - 1);
			stored_ssids[i][sizeof(stored_ssids[i]) - 1] = '\0';

			// Determine signal strength icon and color
			lv_color_t signal_color;
			if (signal_strengths[i] > -50) {
				signal_icon = LV_SYMBOL_WIFI;  // Strong
				signal_color = lv_color_hex(0x4caf50);  // Green
			} else if (signal_strengths[i] > -70) {
				signal_icon = LV_SYMBOL_WIFI;  // Medium
				signal_color = lv_color_hex(0xff9800);  // Orange
			} else {
				signal_icon = LV_SYMBOL_WIFI;  // Weak
				signal_color = lv_color_hex(0xf44336);  // Red
			}

			snprintf(item_text, sizeof(item_text), "%s (%d dBm)", wifi_networks[i], signal_strengths[i]);
			lv_obj_t * btn = lv_list_add_btn(guider_ui.scrSettings_listWifi, signal_icon, item_text);

			// Set font to support Chinese characters
			lv_obj_set_style_text_font(lv_obj_get_child(btn, 1), &lv_font_ShanHaiZhongXiaYeWuYuW_16, LV_PART_MAIN|LV_STATE_DEFAULT);

			// Color code the signal strength
			lv_obj_set_style_text_color(lv_obj_get_child(btn, 0), signal_color, LV_PART_MAIN|LV_STATE_DEFAULT);

			// Store SSID pointer in user data for later connection
			lv_obj_set_user_data(btn, (void*)stored_ssids[i]);

			// Add click event to open connection dialog
			lv_obj_add_event_cb(btn, wifi_network_item_clicked, LV_EVENT_CLICKED, NULL);
		}
	}
}

/* LVGL task polling timer - checks WiFi status flags and updates UI safely */
static void wifi_status_poll_timer_cb(lv_timer_t * timer)
{
	wifi_status_flag_t current_status = s_wifi_status_pending;

	/* No pending status change */
	if (current_status == WIFI_STATUS_IDLE || current_status == WIFI_STATUS_CONNECTING) {
		return;
	}

	/* Check if enough time has passed (debounce) - use FreeRTOS ticks */
	uint32_t current_tick = (uint32_t)xTaskGetTickCount();
	uint32_t elapsed_ticks = current_tick - s_wifi_status_change_tick;
	/* Convert ticks to ms: 1 tick = 1ms typically on ESP32 */
	if (elapsed_ticks < pdMS_TO_TICKS(300)) {
		return; /* Wait at least 300ms before processing */
	}

	/* === Process WiFi status change in LVGL task context (SAFE!) === */

	if (current_status == WIFI_STATUS_CONNECTED) {
		/* CONNECTION SUCCESSFUL */

		/* Update status label */
		if (guider_ui.scrSettings_labelWifiStatus != NULL && lv_obj_is_valid(guider_ui.scrSettings_labelWifiStatus)) {
			char status_text[128];
			snprintf(status_text, sizeof(status_text), "Connected: %s", s_wifi_pending_ssid);
			lv_label_set_text(guider_ui.scrSettings_labelWifiStatus, status_text);
			lv_obj_set_style_text_color(guider_ui.scrSettings_labelWifiStatus, lv_color_hex(0x27ae60), LV_PART_MAIN|LV_STATE_DEFAULT);
		}

		/* === DEFER HEAVY OPERATIONS UNTIL USER RETURNS TO HOME === */

		/* Clear pending flag */
		s_wifi_status_pending = WIFI_STATUS_IDLE;

		/* Stop polling timer */
		if (s_wifi_status_poll_timer != NULL) {
			lv_timer_del(s_wifi_status_poll_timer);
			s_wifi_status_poll_timer = NULL;
		}

		/* ONLY jump to success page - NO SNTP, NO icon update yet */
		/* These will be triggered when user clicks Continue button */
		if (lv_scr_act() == guider_ui.scrSettings) {
			ui_load_scr_animation(&guider_ui, &guider_ui.scrScanFini, guider_ui.scrScanFini_del, &guider_ui.scrSettings_del, setup_scr_scrScanFini, LV_SCR_LOAD_ANIM_NONE, 0, 0, false, true);
		}

	} else if (current_status == WIFI_STATUS_FAILED) {
		/* CONNECTION FAILED */

		/* Update status label */
		if (guider_ui.scrSettings_labelWifiStatus != NULL && lv_obj_is_valid(guider_ui.scrSettings_labelWifiStatus)) {
			lv_label_set_text(guider_ui.scrSettings_labelWifiStatus, "Connection Failed");
			lv_obj_set_style_text_color(guider_ui.scrSettings_labelWifiStatus, lv_color_hex(0xe74c3c), LV_PART_MAIN|LV_STATE_DEFAULT);
		}

		/* === DEFER HEAVY OPERATIONS UNTIL USER RETURNS TO HOME === */

		/* Clear pending flag */
		s_wifi_status_pending = WIFI_STATUS_IDLE;

		/* Stop polling timer */
		if (s_wifi_status_poll_timer != NULL) {
			lv_timer_del(s_wifi_status_poll_timer);
			s_wifi_status_poll_timer = NULL;
		}

		/* ONLY jump to error page - NO icon update yet */
		/* Icon will be updated when user clicks Back button */
		if (lv_scr_act() == guider_ui.scrSettings) {
			scrPrintInternet_return_target = 1;
			ui_load_scr_animation(&guider_ui, &guider_ui.scrPrintInternet, guider_ui.scrPrintInternet_del, &guider_ui.scrSettings_del, setup_scr_scrPrintInternet, LV_SCR_LOAD_ANIM_NONE, 0, 0, false, true);
		}
	}
}

/**
 * @brief Update WiFi connection status (called by ESP32 WiFi task)
 * @param connected true if connected, false if disconnected
 * @param ssid Connected WiFi SSID (NULL if not connected)
 *
 * IMPORTANT: This function is called from WiFi event callback (different task!)
 * It ONLY sets flags - actual UI updates happen in LVGL task via polling timer
 *
 * CRITICAL: Do NOT call ANY LVGL functions here (including lv_tick_get)!
 */
void wifi_status_update_callback(bool connected, const char *ssid)
{
	if (connected && ssid != NULL) {
		/* Save SSID and set connected flag */
		strncpy(s_wifi_pending_ssid, ssid, sizeof(s_wifi_pending_ssid) - 1);
		s_wifi_pending_ssid[sizeof(s_wifi_pending_ssid) - 1] = '\0';

		/* Use FreeRTOS tick instead of lv_tick_get() for thread safety */
		s_wifi_status_change_tick = (uint32_t)xTaskGetTickCount();
		s_wifi_status_pending = WIFI_STATUS_CONNECTED;

	} else {
		/* Set failed flag only if this was an actual connection attempt */
		if (ssid != NULL || s_wifi_status_pending == WIFI_STATUS_CONNECTING) {
			s_wifi_status_change_tick = (uint32_t)xTaskGetTickCount();
			s_wifi_status_pending = WIFI_STATUS_FAILED;
		}
	}

	/* Polling timer is already running in Settings screen */
}

/**
 * @brief Get current brightness setting
 * @return Brightness value (0-100)
 */
int settings_get_brightness(void)
{
	return lv_slider_get_value(guider_ui.scrSettings_sliderBrightness);
}

/* ========================================
 * Print Internet Screen Event Handlers
 * ========================================*/

static void scrPrintInternet_btnBack_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);

	switch (code) {
	case LV_EVENT_CLICKED:
	{
		/* === Update WiFi status FLAG to show disconnected state === */
		extern void set_wifi_connected_status(bool is_connected);
		set_wifi_connected_status(false);

		// Return to previous screen based on return target
		if (scrPrintInternet_return_target == 1) {
			// Return to Settings screen (WiFi icon not affected here)
			ui_load_scr_animation(&guider_ui, &guider_ui.scrSettings, guider_ui.scrSettings_del, &guider_ui.scrPrintInternet_del, setup_scr_scrSettings, LV_SCR_LOAD_ANIM_FADE_ON, 0, 0, false, true);
			scrPrintInternet_return_target = 0; // Reset
		} else {
			// Return to Print Menu (default) - if user goes to Home later, icon will be updated
			ui_load_scr_animation(&guider_ui, &guider_ui.scrPrintMenu, guider_ui.scrPrintMenu_del, &guider_ui.scrPrintInternet_del, setup_scr_scrPrintMenu, LV_SCR_LOAD_ANIM_FADE_ON, 0, 0, false, true);
		}
		break;
	}
	default:
		break;
	}
}

void events_init_scrPrintInternet(lv_ui *ui)
{
	lv_obj_add_event_cb(ui->scrPrintInternet_btnBack, scrPrintInternet_btnBack_event_handler, LV_EVENT_ALL, ui);
}

/* ========================================
 * Wireless Serial Screen Event Handlers
 * ========================================*/

// Serial configuration state
static uint32_t ws_baud_rate = 115200;
static uint8_t ws_stop_bits = 1;  // 0=1, 1=1.5, 2=2
static uint8_t ws_data_bits = 8;  // 5-8
static uint8_t ws_parity = 0;     // 0=None, 1=Odd, 2=Even
static bool ws_hex_send = false;
static bool ws_hex_receive = false;
static bool ws_send_newline = true;
static bool ws_connected = false;

