Jackcdut/Graduation-project-ESP32/BSP/GUIDER/generated/events_init.c
// Keyboard object for send textarea
static lv_obj_t *ws_keyboard = NULL;

static void scrWirelessSerial_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);

	switch (code) {
	case LV_EVENT_SCREEN_LOADED:
	{
		// Update IP display when screen loads
		wireless_serial_update_ip_on_screen_load();
		
		// Start TCP server automatically
		wireless_serial_start_server();
		break;
	}
	default:
		break;
	}
}

static void scrWirelessSerial_btnBack_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);

	switch (code) {
	case LV_EVENT_CLICKED:
	{
		ui_load_scr_animation(&guider_ui, &guider_ui.scrHome, guider_ui.scrHome_del, &guider_ui.scrWirelessSerial_del, setup_scr_scrHome, LV_SCR_LOAD_ANIM_FADE_ON, 0, 0, false, true);
		// No animation needed for new design
		break;
	}
	default:
		break;
	}
}

static void scrWirelessSerial_btnConnect_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);

	switch (code) {
	case LV_EVENT_CLICKED:
	{
		// Execute command from send textarea
		const char *cmd = lv_textarea_get_text(guider_ui.scrWirelessSerial_textareaSend);
		if (cmd != NULL && strlen(cmd) > 0) {
			// Simulate command execution - add to receive area
			char response[512];
			snprintf(response, sizeof(response), "%s\n\nOK\n", lv_textarea_get_text(guider_ui.scrWirelessSerial_textareaReceive));
			lv_textarea_set_text(guider_ui.scrWirelessSerial_textareaReceive, response);

			// ESP32 Integration Point: Send AT command via UART
			// extern void wireless_serial_send_command(const char *cmd);
			// wireless_serial_send_command(cmd);
		}
		break;
	}
	default:
		break;
	}
}

// BaudRate dropdown event handler
static void scrWirelessSerial_dropdownBaudRate_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);

	switch (code) {
	case LV_EVENT_VALUE_CHANGED:
	{
		uint16_t sel = lv_dropdown_get_selected(guider_ui.scrWirelessSerial_dropdownBaudRate);
		const uint32_t baud_rates[] = {115200, 57600, 38400, 19200, 9600, 4800, 2400, 1200};
		if (sel < sizeof(baud_rates) / sizeof(baud_rates[0])) {
			ws_baud_rate = baud_rates[sel];
			ESP_LOGI("WS_CONFIG", "BaudRate changed to: %u", ws_baud_rate);

			// ESP32 Integration Point: Update UART baud rate
			// extern void wireless_serial_set_baudrate(uint32_t baudrate);
			// wireless_serial_set_baudrate(ws_baud_rate);
		}
		break;
	}
	default:
		break;
	}
}

// StopBits dropdown event handler
static void scrWirelessSerial_dropdownStopBits_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);

	switch (code) {
	case LV_EVENT_VALUE_CHANGED:
	{
		ws_stop_bits = lv_dropdown_get_selected(guider_ui.scrWirelessSerial_dropdownStopBits);
		ESP_LOGI("WS_CONFIG", "StopBits changed to: %d", ws_stop_bits);

		// ESP32 Integration Point: Update UART stop bits
		// extern void wireless_serial_set_stopbits(uint8_t stopbits);
		// wireless_serial_set_stopbits(ws_stop_bits);
		break;
	}
	default:
		break;
	}
}

// Length (data bits) dropdown event handler
static void scrWirelessSerial_dropdownLength_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);

	switch (code) {
	case LV_EVENT_VALUE_CHANGED:
	{
		uint16_t sel = lv_dropdown_get_selected(guider_ui.scrWirelessSerial_dropdownLength);
		ws_data_bits = 8 - sel;  // 8, 7, 6, 5
		ESP_LOGI("WS_CONFIG", "Data bits changed to: %d", ws_data_bits);

		// ESP32 Integration Point: Update UART data bits
		// extern void wireless_serial_set_databits(uint8_t databits);
		// wireless_serial_set_databits(ws_data_bits);
		break;
	}
	default:
		break;
	}
}

// Parity dropdown event handler
static void scrWirelessSerial_dropdownParity_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);

	switch (code) {
	case LV_EVENT_VALUE_CHANGED:
	{
		ws_parity = lv_dropdown_get_selected(guider_ui.scrWirelessSerial_dropdownParity);
		ESP_LOGI("WS_CONFIG", "Parity changed to: %d", ws_parity);

		// ESP32 Integration Point: Update UART parity
		// extern void wireless_serial_set_parity(uint8_t parity);
		// wireless_serial_set_parity(ws_parity);
		break;
	}
	default:
		break;
	}
}

// Hex-Send checkbox event handler
static void scrWirelessSerial_checkboxHexSend_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);

	switch (code) {
	case LV_EVENT_VALUE_CHANGED:
	{
		ws_hex_send = lv_obj_has_state(guider_ui.scrWirelessSerial_checkboxHexSend, LV_STATE_CHECKED);
		ESP_LOGI("WS_CONFIG", "Hex-Send: %s", ws_hex_send ? "ON" : "OFF");
		break;
	}
	default:
		break;
	}
}

// Hex-Receive checkbox event handler
static void scrWirelessSerial_checkboxHexReceive_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);

	switch (code) {
	case LV_EVENT_VALUE_CHANGED:
	{
		ws_hex_receive = lv_obj_has_state(guider_ui.scrWirelessSerial_checkboxHexReceive, LV_STATE_CHECKED);
		ESP_LOGI("WS_CONFIG", "Hex-Receive: %s", ws_hex_receive ? "ON" : "OFF");
		break;
	}
	default:
		break;
	}
}

// Send-NewLine checkbox event handler
static void scrWirelessSerial_checkboxSendNewLine_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);

	switch (code) {
	case LV_EVENT_VALUE_CHANGED:
	{
		ws_send_newline = lv_obj_has_state(guider_ui.scrWirelessSerial_checkboxSendNewLine, LV_STATE_CHECKED);
		ESP_LOGI("WS_CONFIG", "Send-NewLine: %s", ws_send_newline ? "ON" : "OFF");
		break;
	}
	default:
		break;
	}
}

// Send button event handler (btnClear repurposed)
static void scrWirelessSerial_btnClear_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);

	switch (code) {
	case LV_EVENT_CLICKED:
	{
		// Get text from send textarea
		const char *text = lv_textarea_get_text(guider_ui.scrWirelessSerial_textareaSend);
		if (text != NULL && strlen(text) > 0) {
			// Prepare data to send
			char send_buffer[512];
			size_t send_len;

			// Always send as ASCII (HEX conversion not implemented)
			send_len = snprintf(send_buffer, sizeof(send_buffer), "%s%s",
			                    text, ws_send_newline ? "\r\n" : "");
			
