Jackcdut/Graduation-project-ESP32/BSP/GUIDER/generated/events_init.c
			if (ws_hex_send) {
				ESP_LOGI("WS_SEND", "Sending (HEX mode): %s", text);
			} else {
				ESP_LOGI("WS_SEND", "Sending (ASCII mode): %s", text);
			}

			// ESP32 Integration Point: Send data via WiFi
			extern void wireless_serial_send_data(const char *data, size_t len);
			wireless_serial_send_data(send_buffer, send_len);

			// Optionally clear send textarea after sending
			// lv_textarea_set_text(guider_ui.scrWirelessSerial_textareaSend, "");
		}
		break;
	}
	default:
		break;
	}
}

// Clear receive button event handler
static void scrWirelessSerial_btnClearReceive_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);

	switch (code) {
	case LV_EVENT_CLICKED:
	{
		// Clear receive textarea
		lv_textarea_set_text(guider_ui.scrWirelessSerial_textareaReceive, "");
		ESP_LOGI("WS_UI", "Receive buffer cleared");
		break;
	}
	default:
		break;
	}
}

// Send textarea event handler - show/hide keyboard
static void scrWirelessSerial_textareaSend_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);

	switch (code) {
	case LV_EVENT_FOCUSED:
	{
		// Create keyboard if it doesn't exist
		if (ws_keyboard == NULL) {
			ws_keyboard = lv_keyboard_create(guider_ui.scrWirelessSerial);
			lv_obj_set_size(ws_keyboard, 800, 240);
			lv_obj_align(ws_keyboard, LV_ALIGN_BOTTOM_MID, 0, 0);
			lv_keyboard_set_textarea(ws_keyboard, guider_ui.scrWirelessSerial_textareaSend);
		}
		// Show keyboard
		lv_obj_clear_flag(ws_keyboard, LV_OBJ_FLAG_HIDDEN);
		break;
	}
	case LV_EVENT_DEFOCUSED:
	{
		// Hide keyboard when textarea loses focus
		if (ws_keyboard != NULL) {
			lv_obj_add_flag(ws_keyboard, LV_OBJ_FLAG_HIDDEN);
		}
		break;
	}
	case LV_EVENT_READY:
	case LV_EVENT_CANCEL:
	{
		// Hide keyboard when user presses OK or Cancel on keyboard
		if (ws_keyboard != NULL) {
			lv_obj_add_flag(ws_keyboard, LV_OBJ_FLAG_HIDDEN);
		}
		break;
	}
	default:
		break;
	}
}

// AT command type dropdown event handler
static void scrWirelessSerial_dropdownATType_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);

	switch (code) {
	case LV_EVENT_VALUE_CHANGED:
	{
		uint16_t sel = lv_dropdown_get_selected(guider_ui.scrWirelessSerial_dropdownATType);

		// Update receive textarea with selected AT command set
		const char *at_text = NULL;
		switch (sel) {
		case 0:  // Basic AT Commands
			at_text = "=== Basic AT Commands ===\n"
				"AT - Test AT startup\n"
				"AT+RST - Restart module\n"
				"AT+GMR - View version info\n"
				"AT+CMD - Query supported commands\n"
				"AT+GSLP - Enter Deep-sleep mode\n"
				"ATE - Enable/Disable AT echo\n"
				"AT+RESTORE - Factory reset\n"
				"AT+UART_CUR - Set UART config (temp)\n"
				"AT+UART_DEF - Set UART config (save)\n"
				"AT+SLEEP - Set sleep mode\n"
				"AT+SYSRAM - Query heap usage\n"
				"AT+SYSMSG - Query/Set system messages\n"
				"AT+SYSFLASH - Read/Write flash\n"
				"AT+RFPOWER - Query/Set RF TX power\n"
				"AT+SYSSTORE - Set parameter storage\n";
			break;
		case 1:  // Wi-Fi AT Commands
			at_text = "=== Wi-Fi AT Commands ===\n"
				"AT+CWINIT - Init/Deinit Wi-Fi driver\n"
				"AT+CWMODE - Set Wi-Fi mode (STA/AP/STA+AP)\n"
				"AT+CWJAP - Connect to AP\n"
				"AT+CWLAP - Scan available APs\n"
				"AT+CWQAP - Disconnect from AP\n"
				"AT+CWSAP - Configure SoftAP\n"
				"AT+CWLIF - Query connected stations\n"
				"AT+CWDHCP - Enable/Disable DHCP\n"
				"AT+CIPSTA - Set Station IP address\n"
				"AT+CIPAP - Set SoftAP IP address\n"
				"AT+CIPSTAMAC - Set Station MAC\n"
				"AT+CIPAPMAC - Set SoftAP MAC\n"
				"AT+CWHOSTNAME - Set hostname\n"
				"AT+CWCOUNTRY - Set country code\n"
				"AT+CWSTARTSMART - Start SmartConfig\n"
				"AT+CWSTOPSMART - Stop SmartConfig\n"
				"AT+WPS - Set WPS function\n";
			break;
		case 2:  // TCP/IP AT Commands
			at_text = "=== TCP/IP AT Commands ===\n"
				"AT+CIPV6 - Enable/Disable IPv6\n"
				"AT+CIPSTATE - Query TCP/UDP/SSL info\n"
				"AT+CIPDOMAIN - DNS resolution\n"
				"AT+CIPSTART - Establish TCP/UDP/SSL\n"
				"AT+CIPSEND - Send data\n"
				"AT+CIPCLOSE - Close connection\n"
				"AT+CIFSR - Query local IP and MAC\n"
				"AT+CIPMUX - Enable/Disable multi-conn\n"
				"AT+CIPSERVER - Create/Close TCP server\n"
				"AT+CIPMODE - Query/Set transfer mode\n"
				"AT+CIPSTO - Set TCP server timeout\n"
				"AT+CIPSNTPCFG - Set SNTP config\n"
				"AT+CIPSNTPTIME - Query SNTP time\n"
				"AT+CIUPDATE - Upgrade firmware via Wi-Fi\n"
				"AT+CIPSSLCCONF - Set SSL client config\n"
				"AT+PING - Ping remote host\n"
				"AT+CIPDNS - Query/Set DNS server\n";
			break;
		case 3:  // MQTT AT Commands
			at_text = "=== MQTT AT Commands ===\n"
				"AT+MQTTUSERCFG - Set MQTT user config\n"
				"AT+MQTTLONGCLIENTID - Set client ID\n"
				"AT+MQTTLONGUSERNAME - Set username\n"
				"AT+MQTTLONGPASSWORD - Set password\n"
				"AT+MQTTCONNCFG - Set connection config\n"
				"AT+MQTTALPN - Set ALPN\n"
				"AT+MQTTSNI - Set SNI\n"
				"AT+MQTTCONN - Connect to MQTT broker\n"
				"AT+MQTTPUB - Publish MQTT message\n"
				"AT+MQTTPUBRAW - Publish long message\n"
				"AT+MQTTSUB - Subscribe to topic\n"
				"AT+MQTTUNSUB - Unsubscribe from topic\n"
				"AT+MQTTCLEAN - Disconnect MQTT\n";
			break;
		case 4:  // HTTP AT Commands
			at_text = "=== HTTP AT Commands ===\n"
				"AT+HTTPCLIENT - Send HTTP request\n"
				"AT+HTTPGETSIZE - Get HTTP resource size\n"
				"AT+HTTPCGET - Get HTTP resource\n"
				"AT+HTTPCPOST - Post HTTP data\n"
				"AT+HTTPCPUT - Put HTTP data\n"
				"AT+HTTPURLCFG - Set/Get long HTTP URL\n"
				"AT+HTTPCHEAD - Set/Query HTTP header\n"
				"AT+HTTPCFG - Set HTTP client config\n";
			break;
		case 5:  // User AT Commands
			at_text = "=== User AT Commands ===\n"
				"AT+USERRAM - Operate user free RAM\n"
				"AT+USEROTA - Upgrade firmware by URL\n"
				"AT+USERWKMCUCFG - Set wake MCU config\n"
				"AT+USERMCUSLEEP - MCU sleep indication\n"
				"AT+USERDOCS - Query user doc link\n";
			break;
		default:
			at_text = "Unknown AT command type";
			break;
		}

		if (at_text != NULL) {
			lv_textarea_set_text(guider_ui.scrWirelessSerial_textareaReceive, at_text);
			ESP_LOGI("WS_UI", "AT command type changed to: %d", sel);
		}
		break;
	}
	default:
		break;
	}
}


void events_init_scrWirelessSerial(lv_ui *ui)
{
	lv_obj_add_event_cb(ui->scrWirelessSerial, scrWirelessSerial_event_handler, LV_EVENT_ALL, ui);
	lv_obj_add_event_cb(ui->scrWirelessSerial_btnBack, scrWirelessSerial_btnBack_event_handler, LV_EVENT_ALL, ui);
	// lv_obj_add_event_cb(ui->scrWirelessSerial_btnConnect, scrWirelessSerial_btnConnect_event_handler, LV_EVENT_ALL, ui);  // Button removed
	lv_obj_add_event_cb(ui->scrWirelessSerial_dropdownBaudRate, scrWirelessSerial_dropdownBaudRate_event_handler, LV_EVENT_ALL, ui);
	lv_obj_add_event_cb(ui->scrWirelessSerial_dropdownStopBits, scrWirelessSerial_dropdownStopBits_event_handler, LV_EVENT_ALL, ui);
	lv_obj_add_event_cb(ui->scrWirelessSerial_dropdownLength, scrWirelessSerial_dropdownLength_event_handler, LV_EVENT_ALL, ui);
	lv_obj_add_event_cb(ui->scrWirelessSerial_dropdownParity, scrWirelessSerial_dropdownParity_event_handler, LV_EVENT_ALL, ui);
	lv_obj_add_event_cb(ui->scrWirelessSerial_checkboxHexSend, scrWirelessSerial_checkboxHexSend_event_handler, LV_EVENT_ALL, ui);
	lv_obj_add_event_cb(ui->scrWirelessSerial_checkboxHexReceive, scrWirelessSerial_checkboxHexReceive_event_handler, LV_EVENT_ALL, ui);
	lv_obj_add_event_cb(ui->scrWirelessSerial_checkboxSendNewLine, scrWirelessSerial_checkboxSendNewLine_event_handler, LV_EVENT_ALL, ui);
	lv_obj_add_event_cb(ui->scrWirelessSerial_btnClear, scrWirelessSerial_btnClear_event_handler, LV_EVENT_ALL, ui);
	lv_obj_add_event_cb(ui->scrWirelessSerial_btnClearReceive, scrWirelessSerial_btnClearReceive_event_handler, LV_EVENT_ALL, ui);
	lv_obj_add_event_cb(ui->scrWirelessSerial_textareaSend, scrWirelessSerial_textareaSend_event_handler, LV_EVENT_ALL, ui);
	lv_obj_add_event_cb(ui->scrWirelessSerial_dropdownATType, scrWirelessSerial_dropdownATType_event_handler, LV_EVENT_ALL, ui);
}

/* ========================================
 * Wireless Serial Interface Functions (for ESP32 integration)
 * ========================================*/

/**
 * @brief Update received data in the receive textarea
 * @param data Received data string
 */
void wireless_serial_update_receive_data(const char *data)
{
	if (data == NULL) return;

	// Get current text
	const char *current_text = lv_textarea_get_text(guider_ui.scrWirelessSerial_textareaReceive);

	// Append new data
	char buffer[2048];
	if (ws_hex_receive) {
		// TODO: Convert bytes to hex string
		snprintf(buffer, sizeof(buffer), "%s%s", current_text, data);
	} else {
		snprintf(buffer, sizeof(buffer), "%s%s", current_text, data);
	}

	lv_textarea_set_text(guider_ui.scrWirelessSerial_textareaReceive, buffer);

	// Auto-scroll to bottom
	lv_textarea_set_cursor_pos(guider_ui.scrWirelessSerial_textareaReceive, LV_TEXTAREA_CURSOR_LAST);
}

/**
 * @brief Get current serial configuration
 */
void wireless_serial_get_config(uint32_t *baudrate, uint8_t *databits, uint8_t *stopbits, uint8_t *parity)
{
	if (baudrate) *baudrate = ws_baud_rate;
	if (databits) *databits = ws_data_bits;
	if (stopbits) *stopbits = ws_stop_bits;
	if (parity) *parity = ws_parity;
}

/* ========================================
 * Oscilloscope Screen Event Handlers
 * ========================================*/

// Oscilloscope state variables
static bool osc_running = true;
static bool osc_fft_enabled = false;
static bool osc_grid_enabled = true;  // Grid display enabled by default
static bool osc_export_enabled = false;

// FFT display parameters - 基于1MSPS采样率，奈奎斯特频率为500kHz
static int osc_fft_freq_range_index = 4;  // 默认500kHz（全范围）
static const float osc_fft_freq_ranges[] = {10000.0f, 50000.0f, 100000.0f, 250000.0f, 500000.0f};
static const char *osc_fft_freq_range_labels[] = {"10kHz", "50kHz", "100kHz", "250kHz", "500kHz"};
#define FFT_FREQ_RANGE_COUNT 5

static int osc_fft_amp_range_index = 2;  // 默认-60dB
static const float osc_fft_amp_ranges[] = {20.0f, 40.0f, 60.0f, 80.0f};
static const char *osc_fft_amp_range_labels[] = {"-20dB", "-40dB", "-60dB", "-80dB"};
#define FFT_AMP_RANGE_COUNT 4;

