Jackcdut/Graduation-project-ESP32/BSP/GUIDER/generated/events_init.c
// FFT实际参数（由FFT计算时更新，供游标测量使用）
static float osc_fft_actual_sample_rate = 1000000.0f;  // 实际采样率 (Hz) - 默认1MSPS
static float osc_fft_freq_resolution = 976.56f;        // 频率分辨率 (Hz/bin) - 1M/1024
static float osc_fft_nyquist_freq = 500000.0f;         // 奈奎斯特频率 (Hz) - 500kHz

// Cursor measurement mode
typedef enum {
	OSC_CURSOR_OFF = 0,      // 游标关闭
	OSC_CURSOR_HORIZONTAL,   // 横轴游标（时间/频率）
	OSC_CURSOR_VERTICAL,     // 纵轴游标（电压/幅值）
} osc_cursor_mode_t;

static osc_cursor_mode_t osc_cursor_mode = OSC_CURSOR_OFF;
static lv_obj_t *osc_cursor_line = NULL;        // 游标线对象
static lv_obj_t *osc_cursor_label = NULL;       // 游标值标签
static int osc_cursor_position = 360;           // 游标位置（像素）
static lv_timer_t *osc_waveform_timer = NULL;
static int osc_waveform_phase = 0;
static int osc_time_scale_index = 14;  // Start at 1ms (index 14, matching UI default "1ms")
static int osc_volt_scale_index = 7;   // Start at 2V (index 7)
static float osc_x_offset = 0.0;  // X axis offset - horizontal offset of trigger point from screen center (in seconds)
static float osc_y_offset = 0.0;  // Y axis offset - vertical offset of channel zero point from screen center (in volts)
static float osc_x_offset_base = 0.0;  // X offset base value when drag starts
static float osc_y_offset_base = 0.0;  // Y offset base value when drag starts
static bool osc_x_offset_active = false;  // X offset control active
static bool osc_y_offset_active = false;  // Y offset control active
static lv_coord_t osc_last_touch_y = 0;  // Last touch Y position for offset control

// High-performance drawing context (replaces chart widget)
static osc_draw_ctx_t *osc_draw_ctx = NULL;
static bool osc_use_hw_accel = false;  // 禁用硬件加速，Chart 模式性能更好

// Grid and display constants (matching setup_scr_scrOscilloscope.c)
// WAVEFORM_WIDTH = GRID_SIZE * GRID_COLS + 4 = 43 * 16 + 4 = 692
// Chart point count = WAVEFORM_WIDTH - 4 = 688
#define OSC_GRID_SIZE           43
#define OSC_GRID_COLS           16
#define OSC_GRID_ROWS           9
#define OSC_WAVEFORM_WIDTH      (OSC_GRID_SIZE * OSC_GRID_COLS + 4)  // 692
#define OSC_GRID_WIDTH          1024  // 统一使用1024点，与FFT一致，提升频率分辨率
#define OSC_GRID_HEIGHT         (OSC_GRID_SIZE * OSC_GRID_ROWS + 4 - 6)  // 385

// 波形显示区域实际像素尺寸（用于游标计算）
#define OSC_WAVEFORM_PIXEL_WIDTH   688   // 波形区域宽度（像素）
#define OSC_WAVEFORM_PIXEL_HEIGHT  381   // 波形区域高度（像素）

// Chart Y range constants
#define OSC_CHART_Y_MIN         0
#define OSC_CHART_Y_MAX         1000
#define OSC_CHART_Y_CENTER      500
#define OSC_CHART_Y_RANGE       1000

// Frozen waveform data for STOP mode - 完整采集的波形数据
static float osc_frozen_voltage_data[OSC_GRID_WIDTH];  // Store actual voltage values when frozen
static bool osc_frozen_data_valid = false;
static int osc_frozen_time_scale_index = 1;  // Time scale when frozen
static int osc_frozen_volt_scale_index = 7;  // Voltage scale when frozen
static float osc_frozen_x_offset_at_stop = 0.0f;  // X offset when stopped (trigger position)

// Trigger settings
static float osc_trigger_voltage = 2.54f;  // Trigger voltage level in volts
static int osc_trigger_mode = 0;  // 0=RISE, 1=FALL, 2=EDGE
static lv_obj_t *osc_trigger_line = NULL;  // Trigger level indicator line
static lv_obj_t *osc_trigger_marker = NULL;  // Trigger marker label
static bool osc_trigger_active = false;  // Trigger voltage control active

// Y offset baseline indicator
static lv_obj_t *osc_y_baseline = NULL;  // Y offset baseline (horizontal line)
static lv_obj_t *osc_y_baseline_marker = NULL;  // Y offset marker label

// Waveform preview mask objects (for showing visible data window)
static lv_obj_t *osc_preview_mask_left = NULL;   // Left mask (hidden data)
static lv_obj_t *osc_preview_mask_right = NULL;  // Right mask (hidden data)
static lv_obj_t *osc_preview_trigger_line = NULL;  // Trigger position indicator

// Time scale values in seconds per division (s/div)
// Larger value = slower sweep = fewer cycles visible
static const float time_scale_values[] = {
	10e-9,   // 10ns/div
	50e-9,   // 50ns/div
	100e-9,  // 100ns/div
	200e-9,  // 200ns/div
	500e-9,  // 500ns/div
	1e-6,    // 1us/div
	2e-6,    // 2us/div
	5e-6,    // 5us/div
	10e-6,   // 10us/div
	20e-6,   // 20us/div
	50e-6,   // 50us/div
	100e-6,  // 100us/div
	200e-6,  // 200us/div
	500e-6,  // 500us/div
	1e-3,    // 1ms/div
	2e-3,    // 2ms/div
	5e-3,    // 5ms/div
	10e-3,   // 10ms/div
	20e-3,   // 20ms/div
	50e-3,   // 50ms/div
	100e-3,  // 100ms/div
	200e-3,  // 200ms/div
	500e-3,  // 500ms/div
	1.0      // 1s/div
};
static const char *time_scale_labels[] = {
	"10ns", "50ns", "100ns", "200ns", "500ns",
	"1us", "2us", "5us", "10us", "20us", "50us",
	"100us", "200us", "500us",
	"1ms", "2ms", "5ms", "10ms", "20ms", "50ms",
	"100ms", "200ms", "500ms", "1s"
};
#define TIME_SCALE_COUNT (sizeof(time_scale_values) / sizeof(time_scale_values[0]))

// Voltage scale values in volts per division (V/div)
static const float volt_scale_values[] = {
	0.01,   // 10mV/div
	0.02,   // 20mV/div
	0.05,   // 50mV/div
	0.1,    // 100mV/div
	0.2,    // 200mV/div
	0.5,    // 500mV/div
	1.0,    // 1V/div
	2.0,    // 2V/div
	5.0,    // 5V/div
	10.0    // 10V/div
};
static const char *volt_scale_labels[] = {
	"10mV", "20mV", "50mV", "100mV", "200mV", "500mV", "1V", "2V", "5V", "10V"
};
#define VOLT_SCALE_COUNT (sizeof(volt_scale_values) / sizeof(volt_scale_values[0]))

// Helper function to format time offset with appropriate unit based on time scale
static void format_time_offset(char *buffer, size_t size, float time_seconds, int time_scale_index)
{
	// Time scale values: 1us, 10us, 20us, 50us, 100us, 200us, 500us, 1ms, 10ms, 100ms, 1s
	// Use unit based on time scale
	if (time_scale_index <= 6) {
		// us range (1us to 500us)
		snprintf(buffer, size, "%.1fus", time_seconds * 1e6);
	} else if (time_scale_index <= 9) {
		// ms range (1ms to 100ms)
		snprintf(buffer, size, "%.1fms", time_seconds * 1e3);
	} else {
		// s range (1s)
		snprintf(buffer, size, "%.2fs", time_seconds);
	}
}

// Helper function to format voltage offset with appropriate unit based on voltage scale
static void format_voltage_offset(char *buffer, size_t size, float voltage_volts, int volt_scale_index)
{
	// Voltage scale values: 10mV, 20mV, 50mV, 100mV, 200mV, 500mV, 1V, 2V, 5V, 12V
	// Use unit based on voltage scale
	if (volt_scale_index <= 5) {
		// mV range (10mV to 500mV)
		snprintf(buffer, size, "%.0fmV", voltage_volts * 1000);
	} else {
		// V range (1V to 12V)
		snprintf(buffer, size, "%.2fV", voltage_volts);
	}
}

// Helper function to update waveform preview mask based on X offset
// 真实示波器行为：
// - 蓝色遮罩表示不在当前显示窗口的数据（隐藏数据）
// - 横轴偏移时，遮罩位置相应变化
// - 停止模式下，只能查看已采集的波形数据
static void update_preview_mask(void)
{
	if (!osc_frozen_data_valid || osc_running) {
		// 运行模式或没有冻结数据：不显示遮罩（或显示默认遮罩）
		if (osc_preview_mask_left != NULL) {
			lv_obj_add_flag(osc_preview_mask_left, LV_OBJ_FLAG_HIDDEN);
		}
		if (osc_preview_mask_right != NULL) {
			lv_obj_add_flag(osc_preview_mask_right, LV_OBJ_FLAG_HIDDEN);
		}
		return;
	}

	// 停止模式：根据X偏移更新遮罩位置
	if (osc_preview_mask_left == NULL || osc_preview_mask_right == NULL) {
		return;  // 遮罩对象未创建
	}

	// 获取预览区域的宽度
	lv_obj_t *preview_container = guider_ui.scrOscilloscope_sliderWavePos;
	if (preview_container == NULL) return;
	
	lv_coord_t preview_w = lv_obj_get_width(preview_container);
	lv_coord_t preview_h = lv_obj_get_height(preview_container) - 4;

	// 计算X偏移对应的预览区域位置
	// X偏移范围：-max_offset 到 +max_offset
	// 预览区域：0 到 preview_w
	float time_per_div = time_scale_values[osc_time_scale_index];
	float max_offset = time_per_div * (float)OSC_GRID_COLS;  // 一个屏幕宽度
	
	// 相对偏移（相对于停止时的触发位置）
	float relative_x_offset = osc_x_offset - osc_frozen_x_offset_at_stop;
	
	// 归一化偏移：-1.0（完全向左）到 +1.0（完全向右）
	float normalized_offset = relative_x_offset / max_offset;
	// 限制范围
	if (normalized_offset < -1.0f) normalized_offset = -1.0f;
	if (normalized_offset > 1.0f) normalized_offset = 1.0f;
	
