Jackcdut/Graduation-project-ESP32/BSP/GUIDER/generated/events_init.c
	// 计算可见窗口在预览区域中的位置
	// 中心位置：preview_w / 2
	// 偏移量：normalized_offset * preview_w / 2
	float visible_center = (float)preview_w / 2.0f - normalized_offset * (float)preview_w / 2.0f;
	
	// 可见窗口宽度（固定为预览区域的中间部分，例如40%）
	float visible_width = (float)preview_w * 0.4f;
	float visible_left = visible_center - visible_width / 2.0f;
	float visible_right = visible_center + visible_width / 2.0f;
	
	// 更新左侧遮罩
	if (visible_left > 0) {
		lv_obj_clear_flag(osc_preview_mask_left, LV_OBJ_FLAG_HIDDEN);
		lv_obj_set_pos(osc_preview_mask_left, 0, 0);
		lv_obj_set_size(osc_preview_mask_left, (lv_coord_t)visible_left, preview_h);
	} else {
		lv_obj_add_flag(osc_preview_mask_left, LV_OBJ_FLAG_HIDDEN);
	}
	
	// 更新右侧遮罩
	if (visible_right < preview_w) {
		lv_obj_clear_flag(osc_preview_mask_right, LV_OBJ_FLAG_HIDDEN);
		lv_obj_set_pos(osc_preview_mask_right, (lv_coord_t)visible_right, 0);
		lv_obj_set_size(osc_preview_mask_right, preview_w - (lv_coord_t)visible_right, preview_h);
	} else {
		lv_obj_add_flag(osc_preview_mask_right, LV_OBJ_FLAG_HIDDEN);
	}
	
	// 更新触发位置指示器
	if (osc_preview_trigger_line != NULL) {
		// 触发位置在预览区域的中心（停止时的位置）
		float trigger_pos = (float)preview_w / 2.0f - normalized_offset * (float)preview_w / 2.0f;
		lv_obj_set_x(osc_preview_trigger_line, (lv_coord_t)trigger_pos);
	}
}

// Waveform update timer callback - Generate dynamic waveform data
// Grid: 43x43 pixels per division, 16 columns x 9 rows
// Time scale logic (Real Oscilloscope Behavior):
// - Larger time/div = MORE compressed waveform = MORE cycles visible in same screen width
// - Smaller time/div = MORE expanded waveform = FEWER cycles visible (zoomed in)
// - Horizontal offset allows viewing different parts of the waveform
// Example: 1kHz signal (period=1ms)
//   - At 1ms/div with 16 divisions: total_time = 16ms, shows 16 cycles (compressed)
//   - At 100us/div with 16 divisions: total_time = 1.6ms, shows 1.6 cycles (expanded)
//   - At 10us/div with 16 divisions: total_time = 160us, shows 0.16 cycles (highly zoomed)
static void osc_waveform_update_cb(lv_timer_t *timer)
{
	// Debug: Log timer callback execution (减少频率)
	static uint32_t timer_call_count = 0;
	timer_call_count++;
	if (timer_call_count <= 5 || timer_call_count % 1000 == 0) {
		ESP_LOGI("OSC_TIMER", "🔄 Timer callback #%lu executed", timer_call_count);
	}
	
	// Use hardware-accelerated drawing if available
	if (osc_use_hw_accel && osc_draw_ctx != NULL) {
		// Clear canvas
		osc_draw_clear(osc_draw_ctx);
		
		// Draw grid if enabled
		if (osc_grid_enabled) {
			osc_draw_grid(osc_draw_ctx);
		}
		
		// Get real ADC data from oscilloscope core
		float display_buffer[OSC_DISPLAY_WIDTH];
		uint32_t display_count = 0;
		
		// Update oscilloscope core (check for new ADC data)
		if (g_osc_ctx != NULL) {
			osc_update(g_osc_ctx);
			esp_err_t ret = osc_get_display_data(g_osc_ctx, display_buffer, &display_count);
			
			// Debug: Log data status every 500 frames (减少日志输出)
			static uint32_t frame_counter = 0;
			frame_counter++;
			if (frame_counter % 500 == 0) {
				ESP_LOGI("OSC_UI", "Frame %lu: ret=%s, count=%lu, running=%d", 
				         frame_counter, esp_err_to_name(ret), display_count,
				         osc_get_state(g_osc_ctx) == OSC_STATE_RUNNING);
			}
		}
		
		// Prepare waveform parameters for drawing
		float volts_per_div = volt_scale_values[osc_volt_scale_index];
		
		// Calculate sample rate for FFT analysis
		float time_per_div = time_scale_values[osc_time_scale_index];
		float total_time = time_per_div * (float)OSC_GRID_COLS;
		float sample_rate = (display_count > 0 && total_time > 0) ? 
		                     (float)display_count / total_time : 0.0f;
		
		// Draw waveform or FFT
		if (osc_fft_enabled) {
			osc_fft_result_t fft_result;
			osc_draw_fft(osc_draw_ctx, display_buffer, display_count, sample_rate, &fft_result);
		} else {
			osc_draw_waveform(osc_draw_ctx, display_buffer, display_count, volts_per_div, osc_y_offset);
		}
		
		// Update display
		osc_draw_update(osc_draw_ctx);
		
		// Update measurements from real ADC data
		if (g_osc_ctx != NULL) {
			char buf[64];
			
			if (osc_fft_enabled) {
				// FFT mode - show frequency domain measurements from FFT analysis
				const osc_fft_result_t *fft_result = osc_draw_get_fft_result(osc_draw_ctx);
				
				if (fft_result != NULL && fft_result->valid) {
					// Fundamental frequency
					if (guider_ui.scrOscilloscope_labelFreqTitle != NULL) {
						if (fft_result->fundamental_freq < 0.1f) {
							snprintf(buf, sizeof(buf), "Fund: DC");
						} else if (fft_result->fundamental_freq >= 1e6f) {
							snprintf(buf, sizeof(buf), "Fund: %.2fMHz", fft_result->fundamental_freq / 1e6f);
						} else if (fft_result->fundamental_freq >= 1e3f) {
							snprintf(buf, sizeof(buf), "Fund: %.2fkHz", fft_result->fundamental_freq / 1e3f);
						} else {
							snprintf(buf, sizeof(buf), "Fund: %.1fHz", fft_result->fundamental_freq);
						}
						lv_label_set_text(guider_ui.scrOscilloscope_labelFreqTitle, buf);
					}
					
					// H1 (Fundamental amplitude)
					if (guider_ui.scrOscilloscope_labelVmaxTitle != NULL) {
						if (fft_result->fundamental_freq < 0.1f) {
							snprintf(buf, sizeof(buf), "DC: %.3fV", fft_result->dc_offset);
						} else {
							snprintf(buf, sizeof(buf), "H1: %.3fV", fft_result->fundamental_amp);
						}
						lv_label_set_text(guider_ui.scrOscilloscope_labelVmaxTitle, buf);
					}
					
					// H3 (3rd harmonic amplitude)
					if (guider_ui.scrOscilloscope_labelVminTitle != NULL) {
						if (fft_result->fundamental_freq < 0.1f) {
							snprintf(buf, sizeof(buf), "H3: ---");
						} else {
							snprintf(buf, sizeof(buf), "H3: %.4fV", fft_result->h3_amp);
						}
						lv_label_set_text(guider_ui.scrOscilloscope_labelVminTitle, buf);
					}
					
					// THD (Total Harmonic Distortion)
					if (guider_ui.scrOscilloscope_labelVppTitle != NULL) {
						if (fft_result->fundamental_freq < 0.1f) {
							snprintf(buf, sizeof(buf), "THD: 0.00%%");
						} else {
							snprintf(buf, sizeof(buf), "THD: %.2f%%", fft_result->thd);
						}
						lv_label_set_text(guider_ui.scrOscilloscope_labelVppTitle, buf);
					}
					
