Jackcdut/Graduation-project-ESP32/BSP/GUIDER/generated/events_init.c
					// H2 (2nd harmonic amplitude)
					if (guider_ui.scrOscilloscope_labelVrmsTitle != NULL) {
						if (fft_result->fundamental_freq < 0.1f) {
							snprintf(buf, sizeof(buf), "H2: ---");
						} else {
							snprintf(buf, sizeof(buf), "H2: %.4fV", fft_result->h2_amp);
						}
						lv_label_set_text(guider_ui.scrOscilloscope_labelVrmsTitle, buf);
					}
				} else {
					// No valid FFT results - show waiting message
					if (guider_ui.scrOscilloscope_labelFreqTitle != NULL) {
						lv_label_set_text(guider_ui.scrOscilloscope_labelFreqTitle, "Fund: ---");
					}
					if (guider_ui.scrOscilloscope_labelVmaxTitle != NULL) {
						lv_label_set_text(guider_ui.scrOscilloscope_labelVmaxTitle, "H1: ---");
					}
					if (guider_ui.scrOscilloscope_labelVminTitle != NULL) {
						lv_label_set_text(guider_ui.scrOscilloscope_labelVminTitle, "H3: ---");
					}
					if (guider_ui.scrOscilloscope_labelVppTitle != NULL) {
						lv_label_set_text(guider_ui.scrOscilloscope_labelVppTitle, "THD: ---");
					}
					if (guider_ui.scrOscilloscope_labelVrmsTitle != NULL) {
						lv_label_set_text(guider_ui.scrOscilloscope_labelVrmsTitle, "H2: ---");
					}
				}
			} else {
				// Time domain mode - show normal measurements
				osc_measurement_t meas;
				if (osc_get_measurements(g_osc_ctx, &meas) == ESP_OK) {
					// Frequency
					if (guider_ui.scrOscilloscope_labelFreqTitle != NULL) {
						if (meas.freq >= 1e6f) {
							snprintf(buf, sizeof(buf), "Freq: %.2fMHz", meas.freq / 1e6f);
						} else if (meas.freq >= 1e3f) {
							snprintf(buf, sizeof(buf), "Freq: %.2fkHz", meas.freq / 1e3f);
						} else {
							snprintf(buf, sizeof(buf), "Freq: %.1fHz", meas.freq);
						}
						lv_label_set_text(guider_ui.scrOscilloscope_labelFreqTitle, buf);
					}
					
					// Vmax
					if (guider_ui.scrOscilloscope_labelVmaxTitle != NULL) {
						snprintf(buf, sizeof(buf), "Vmax: %.2fV", meas.vmax);
						lv_label_set_text(guider_ui.scrOscilloscope_labelVmaxTitle, buf);
					}
					
					// Vmin
					if (guider_ui.scrOscilloscope_labelVminTitle != NULL) {
						snprintf(buf, sizeof(buf), "Vmin: %.2fV", meas.vmin);
						lv_label_set_text(guider_ui.scrOscilloscope_labelVminTitle, buf);
					}
					
					// Vpp
					if (guider_ui.scrOscilloscope_labelVppTitle != NULL) {
						snprintf(buf, sizeof(buf), "Vp-p: %.2fV", meas.vpp);
						lv_label_set_text(guider_ui.scrOscilloscope_labelVppTitle, buf);
					}
					
					// Vrms
					if (guider_ui.scrOscilloscope_labelVrmsTitle != NULL) {
						snprintf(buf, sizeof(buf), "Vrms: %.2fV", meas.vrms);
						lv_label_set_text(guider_ui.scrOscilloscope_labelVrmsTitle, buf);
					}
				} else {
					// No valid measurements - show waiting message
					if (guider_ui.scrOscilloscope_labelFreqTitle != NULL) {
						lv_label_set_text(guider_ui.scrOscilloscope_labelFreqTitle, "Freq: ---");
					}
					if (guider_ui.scrOscilloscope_labelVmaxTitle != NULL) {
						lv_label_set_text(guider_ui.scrOscilloscope_labelVmaxTitle, "Vmax: ---");
					}
					if (guider_ui.scrOscilloscope_labelVminTitle != NULL) {
						lv_label_set_text(guider_ui.scrOscilloscope_labelVminTitle, "Vmin: ---");
					}
					if (guider_ui.scrOscilloscope_labelVppTitle != NULL) {
						lv_label_set_text(guider_ui.scrOscilloscope_labelVppTitle, "Vp-p: ---");
					}
					if (guider_ui.scrOscilloscope_labelVrmsTitle != NULL) {
						lv_label_set_text(guider_ui.scrOscilloscope_labelVrmsTitle, "Vrms: ---");
					}
				}
			}
		}
		
		return;
	}
	
	// Fallback to original chart-based rendering
	lv_chart_series_t *ser = lv_chart_get_series_next(guider_ui.scrOscilloscope_chartWaveform, NULL);
	if (ser == NULL) return;

	// 动态获取图表的实际点数，防止越界访问
	uint16_t chart_point_count = lv_chart_get_point_count(guider_ui.scrOscilloscope_chartWaveform);
	
	// Chart display parameters - 43x43 pixel grid, 16x9 divisions
	// 使用实际的图表点数，而不是硬编码的值
	const int num_points = (int)chart_point_count;
	const float chart_center = 500.0f;      // Y center (0V reference) for 0-1000 range
	const float chart_range = 1000.0f;      // Full Y range (0-1000)
	const float display_divisions = (float)OSC_GRID_ROWS;  // 9 vertical divisions

	// If not running (STOP mode), display frozen data with current scale settings and offsets
	// 真实示波器行为：
	// 1. 停止时冻结整个波形窗口（记录触发点位置）
	// 2. 横轴偏移时，只显示已采集的波形数据
	// 3. 超出原始窗口的部分不显示（显示为空白或零）
	if (!osc_running && osc_frozen_data_valid) {
		// Get current voltage scale
		float volts_per_div = volt_scale_values[osc_volt_scale_index];
		// Calculate units per volt: chart has 9 divisions, each division = chart_range/9 units
		float units_per_division = chart_range / display_divisions;
		float units_per_volt = units_per_division / volts_per_div;

		// Get current time scale
		float time_per_div = time_scale_values[osc_time_scale_index];
		float frozen_time_per_div = time_scale_values[osc_frozen_time_scale_index];
		// Time scale ratio for zoom effect
		float time_scale_ratio = frozen_time_per_div / time_per_div;

		// Calculate X offset in pixels based on horizontal offset
		// X offset represents the shift from the frozen trigger position
		float pixels_per_div = (float)num_points / (float)OSC_GRID_COLS;
		float pixels_per_second = pixels_per_div / time_per_div;
		// Total offset = current offset - frozen offset (relative to stop position)
		float relative_x_offset = osc_x_offset - osc_frozen_x_offset_at_stop;
		int x_offset_pixels = (int)(relative_x_offset * pixels_per_second);

		// Redraw frozen waveform with current scale and offsets
		// 注意：osc_frozen_voltage_data 数组大小是 OSC_GRID_WIDTH (1024)
		const int frozen_data_size = OSC_GRID_WIDTH;
		
		for(int i = 0; i < num_points; i++) {
			// Calculate source position in frozen data
			// Apply time scale ratio and horizontal offset
			float source_pos = ((float)i - (float)num_points / 2.0f) * time_scale_ratio + (float)num_points / 2.0f - x_offset_pixels;
			int source_index = (int)source_pos;

			float voltage;
			// 真实示波器行为：超出原始采集窗口的数据不显示
			// 同时确保不会越界访问 osc_frozen_voltage_data 数组
			if (source_index < 0 || source_index >= frozen_data_size) {
				// 超出范围，显示为零（或者可以显示为空白）
				voltage = 0.0f;
			} else {
				// Linear interpolation for smooth scaling
				float frac = source_pos - (float)source_index;
				if (source_index + 1 < frozen_data_size && frac > 0.0f) {
					voltage = osc_frozen_voltage_data[source_index] * (1.0f - frac) +
					          osc_frozen_voltage_data[source_index + 1] * frac;
				} else {
					voltage = osc_frozen_voltage_data[source_index];
				}
			}

			// Apply Y offset (vertical position of channel zero point)
			voltage += osc_y_offset;
			// IMPORTANT: LVGL chart Y-axis: 0=bottom, 1000=top (inverted!)
			float y_float = chart_center + (voltage * units_per_volt);

			int val = (int)(y_float + 0.5f);  // Round to nearest integer
			if (val < 0) val = 0;
			if (val > (int)chart_range) val = (int)chart_range;
			ser->y_points[i] = val;
		}

