Jackcdut/Graduation-project-ESP32/BSP/GUIDER/generated/events_init.c
		lv_chart_refresh(guider_ui.scrOscilloscope_chartWaveform);
		
		// 更新波形预览区域的遮罩
		update_preview_mask();
		
		return;
	}

	// Chart fallback 模式下，无论运行还是停止都需要绘制
	// 运行模式：绘制实时 ADC 数据
	// 停止模式：绘制冻结的数据（已在上面处理）

	// Get current voltage scale (volts per division)
	float volts_per_div = volt_scale_values[osc_volt_scale_index];
	float units_per_division = chart_range / display_divisions;
	float units_per_volt = units_per_division / volts_per_div;

	// Time scale logic - Real oscilloscope behavior with scrolling
	// The time scale (s/div) determines how much time is represented per horizontal division
	// Total time visible on screen = time_per_div * number_of_horizontal_divisions
	float time_per_div = time_scale_values[osc_time_scale_index];
	float total_time_on_screen = time_per_div * (float)OSC_GRID_COLS;  // 16 horizontal divisions

	// Simulated signal: 1kHz sine wave (period = 1ms = 0.001s)
	const float signal_frequency = 1000.0f;  // 1kHz
	const float signal_period = 1.0f / signal_frequency;  // 0.001s = 1ms

	// Calculate how many complete cycles fit on screen at current time scale
	// cycles_on_screen = total_time_on_screen / signal_period
	// Example: At 100us/div: total_time = 1.6ms, cycles = 1.6ms / 1ms = 1.6 cycles
	// Example: At 1ms/div: total_time = 16ms, cycles = 16ms / 1ms = 16 cycles
	// Example: At 10ms/div: total_time = 160ms, cycles = 160ms / 1ms = 160 cycles
	// Example: At 100ms/div: total_time = 1.6s, cycles = 1600 cycles (极度压缩！)
	// Example: At 1s/div: total_time = 16s, cycles = 16000 cycles (屏幕只显示一小部分)
	float cycles_on_screen = total_time_on_screen / signal_period;
	
	// 真实示波器行为：不限制周期数
	// - 小时基：显示完整波形（如1-10个周期）
	// - 大时基：波形被极度压缩，屏幕只显示完整波形的一小部分
	// - 通过X-Pos偏移可以左右平移查看不同段落
	// 只设置最小值防止除零错误
	if (cycles_on_screen < 0.1f) cycles_on_screen = 0.1f;
	// 移除上限！允许任意多的周期数，真实反映时基设置

	// Angular frequency for waveform generation
	// omega = 2*PI * cycles / num_points
	// This gives us 'cycles' complete sine waves across 'num_points' samples
	float omega = 2.0f * M_PI * cycles_on_screen / (float)num_points;

	// Variables for measurement calculation
	float min_voltage = 0.0f, max_voltage = 0.0f;
	float sum_squares = 0;
	int zero_crossings = 0;
	int last_sign = 0;
	bool first_sample = true;

	// Signal amplitude constant (used in both time domain and FFT)
	const float signal_amplitude = 1.5f;  // ±1.5V peak (3V peak-to-peak)

	// FFT display points (used in FFT mode)
	const int fft_display_points = 1024;  // Number of bars in FFT spectrum

	if (osc_fft_enabled) {
		// FFT mode - show frequency spectrum using REAL ADC data
		
		// 重要：FFT模式下停止时，不更新数据，保持最后的FFT显示
		// 这样可以避免在停止时访问无效数据导致崩溃
		if (!osc_running) {
			// FFT模式下停止：保持当前显示，不做任何更新
			// 只刷新图表以保持显示
			lv_chart_refresh(guider_ui.scrOscilloscope_chartWaveform);
			return;
		}
		
		// Change waveform color to purple for FFT mode
		lv_chart_set_series_color(guider_ui.scrOscilloscope_chartWaveform, ser, lv_color_hex(0xE040FB));  // Purple
		
		// Get real ADC data from oscilloscope core
		float display_buffer[OSC_DISPLAY_WIDTH];
		uint32_t display_count = 0;
		
		// Get actual sampling rate from oscilloscope core (default 1MSPS)
		float sampling_rate = 1000000.0f;  // Default 1MSPS for 500kHz FFT
		if (g_osc_ctx != NULL) {
			uint32_t actual_rate = osc_get_sample_rate_hz(g_osc_ctx);
			if (actual_rate > 0) {
				sampling_rate = (float)actual_rate;
			}
		}
		
		// Calculate frequency parameters for display
		float freq_resolution = sampling_rate / 1024.0f;  // FFT bin resolution (Hz per bin)
		float nyquist_freq = sampling_rate / 2.0f;  // Maximum displayable frequency (Nyquist)
		float signal_frequency = 0.0f;  // Will be calculated from FFT peak
		
		// 更新全局FFT参数（供游标测量使用）
		osc_fft_actual_sample_rate = sampling_rate;
		osc_fft_freq_resolution = freq_resolution;
		osc_fft_nyquist_freq = nyquist_freq;
		
		// 谐波分析变量（在外部定义，以便在显示时使用）
		float fundamental_magnitude = 0.0f;  // 基波（1次谐波）
		float harmonic_3_magnitude = 0.0f;  // 3次谐波
		float thd = 0.0f;  // 总谐波失真
		
		if (g_osc_ctx != NULL) {
			osc_update(g_osc_ctx);
			esp_err_t ret = osc_get_display_data(g_osc_ctx, display_buffer, &display_count);
			
			if (ret == ESP_OK && display_count > 0) {
				// We have real ADC data - perform FFT using ESP-DSP hardware acceleration
				const int fft_size = 1024;  // Use 1024 points for FFT (power of 2)
				
				// ESP-DSP requires aligned buffers
				__attribute__((aligned(16))) static float fft_input_real[1024];
				__attribute__((aligned(16))) static float fft_input_imag[1024];
				__attribute__((aligned(16))) static float fft_output[1024];
				static float fft_magnitude[512];  // Only need N/2 for real signal
				
				// Sample or interpolate voltage data to FFT size
				for (int i = 0; i < fft_size; i++) {
					if (display_count >= (uint32_t)fft_size) {
						// Downsample
						uint32_t src_idx = (i * display_count) / fft_size;
						if (src_idx >= display_count) src_idx = display_count - 1;
						fft_input_real[i] = display_buffer[src_idx];
					} else {
						// Upsample with interpolation
						float src_pos = (float)i * display_count / fft_size;
						uint32_t src_idx = (uint32_t)src_pos;
						if (src_idx >= display_count - 1) {
							fft_input_real[i] = display_buffer[display_count - 1];
						} else {
							float frac = src_pos - src_idx;
							fft_input_real[i] = display_buffer[src_idx] * (1.0f - frac) + 
							                    display_buffer[src_idx + 1] * frac;
						}
					}
					fft_input_imag[i] = 0.0f;  // Real signal, imaginary part is zero
				}
				
				// Apply Hanning window to reduce spectral leakage
				for (int i = 0; i < fft_size; i++) {
					float window = 0.5f * (1.0f - cosf(2.0f * M_PI * i / (fft_size - 1)));
					fft_input_real[i] *= window;
				}
				
				// Perform hardware-accelerated FFT using ESP-DSP
				// dsps_fft2r_fc32 performs real FFT (faster than complex FFT)
				esp_err_t fft_ret = dsps_fft2r_init_fc32(NULL, fft_size);
				if (fft_ret == ESP_OK) {
					// Copy to interleaved format (real, imag, real, imag, ...)
					for (int i = 0; i < fft_size; i++) {
						fft_output[i * 2] = fft_input_real[i];
						fft_output[i * 2 + 1] = fft_input_imag[i];
					}
					
