Jackcdut/Graduation-project-ESP32/BSP/GUIDER/generated/events_init.c
					// Perform FFT (hardware accelerated on ESP32-P4)
					dsps_fft2r_fc32(fft_output, fft_size);
					
					// Bit reverse for correct output order
					dsps_bit_rev_fc32(fft_output, fft_size);
					
					// Convert to magnitude
					for (int i = 0; i < fft_size / 2; i++) {
						float real = fft_output[i * 2];
						float imag = fft_output[i * 2 + 1];
						fft_magnitude[i] = sqrtf(real * real + imag * imag) / fft_size;
					}
				} else {
					// Fallback: simple DFT if hardware FFT fails
					ESP_LOGW("OSC_FFT", "Hardware FFT init failed, using software fallback");
					for (int k = 0; k < fft_size / 2; k += 4) {  // Calculate every 4th bin for speed
						float real_sum = 0.0f;
						float imag_sum = 0.0f;
						for (int t = 0; t < fft_size; t++) {
							float angle = -2.0f * M_PI * k * t / fft_size;
							real_sum += fft_input_real[t] * cosf(angle);
							imag_sum += fft_input_real[t] * sinf(angle);
						}
						fft_magnitude[k] = sqrtf(real_sum * real_sum + imag_sum * imag_sum) / fft_size;
					}
					// Interpolate skipped bins
					for (int k = 1; k < fft_size / 2; k++) {
						if (k % 4 != 0) {
							int k0 = (k / 4) * 4;
							int k1 = k0 + 4;
							if (k1 >= fft_size / 2) k1 = fft_size / 2 - 1;
							float frac = (float)(k - k0) / 4.0f;
							fft_magnitude[k] = fft_magnitude[k0] * (1.0f - frac) + fft_magnitude[k1] * frac;
						}
					}
				}
				
				// Find maximum magnitude for normalization and peak frequency
				// 首先检查DC分量（bin 0）
				float dc_magnitude = fft_magnitude[0];
				
				// 找AC分量的最大值（从bin 2开始，跳过bin 1的低频噪声）
				float max_ac_magnitude = 0.0f;
				int peak_bin = 0;
				for (int i = 2; i < fft_size / 2; i++) {
					if (fft_magnitude[i] > max_ac_magnitude) {
						max_ac_magnitude = fft_magnitude[i];
						peak_bin = i;
					}
				}
				
				// 也检查bin 1
				if (fft_magnitude[1] > max_ac_magnitude) {
					max_ac_magnitude = fft_magnitude[1];
					peak_bin = 1;
				}
				
				// 判断是否为DC信号：
				// 1. DC分量是AC峰值的5倍以上
				// 2. 或者AC峰值太小（噪声级别）
				// 3. 或者峰值在bin 1（接近DC的低频）且DC分量较大
				float max_magnitude;
				bool is_dc_signal = false;
				
				if (dc_magnitude > max_ac_magnitude * 5.0f) {
					is_dc_signal = true;
				} else if (max_ac_magnitude < 0.005f) {
					is_dc_signal = true;
				} else if (peak_bin == 1 && dc_magnitude > max_ac_magnitude * 2.0f) {
					is_dc_signal = true;
				}
				
				if (is_dc_signal) {
					// DC信号
					signal_frequency = 0.0f;
					max_magnitude = (dc_magnitude > 0.001f) ? dc_magnitude : 0.001f;
					peak_bin = 0;
				} else {
					// AC信号
					signal_frequency = peak_bin * freq_resolution;
					max_magnitude = max_ac_magnitude;
				}
				
				if (max_magnitude < 0.001f) max_magnitude = 0.001f;  // Avoid division by zero
				
				// 计算谐波幅值和THD
				fundamental_magnitude = fft_magnitude[peak_bin];  // 基波（1次谐波）
				
				// 计算3次谐波幅值
				int harmonic_3_bin = peak_bin * 3;
				if (harmonic_3_bin < fft_size / 2) {
					// 在3次谐波频率附近搜索峰值（±2个bin）
					float max_h3 = 0.0f;
					for (int i = harmonic_3_bin - 2; i <= harmonic_3_bin + 2; i++) {
						if (i > 0 && i < fft_size / 2) {
							if (fft_magnitude[i] > max_h3) {
								max_h3 = fft_magnitude[i];
							}
						}
					}
					harmonic_3_magnitude = max_h3;
				}
				
				// 计算THD（总谐波失真）
				// THD = sqrt(sum(harmonics^2)) / fundamental
				// 考虑2-10次谐波
				float harmonics_sum_sq = 0.0f;
				for (int h = 2; h <= 10; h++) {
					int h_bin = peak_bin * h;
					if (h_bin < fft_size / 2) {
						// 在谐波频率附近搜索峰值
						float max_h = 0.0f;
						for (int i = h_bin - 2; i <= h_bin + 2; i++) {
							if (i > 0 && i < fft_size / 2) {
								if (fft_magnitude[i] > max_h) {
									max_h = fft_magnitude[i];
								}
							}
						}
						harmonics_sum_sq += max_h * max_h;
					}
				}
				
				if (fundamental_magnitude > 0.001f) {
					thd = sqrtf(harmonics_sum_sq) / fundamental_magnitude * 100.0f;  // 转换为百分比
				}
				
				// Get FFT display parameters
				float max_freq = osc_fft_freq_ranges[osc_fft_freq_range_index];  // Maximum frequency to display
				float amp_range = osc_fft_amp_ranges[osc_fft_amp_range_index];   // Amplitude range in dB
				
				// Convert FFT magnitude to chart coordinates (BAR CHART style)
				// IMPORTANT: Chart Y-axis: 0=bottom, 1000=top
				// Each point represents a vertical bar from bottom to magnitude
				for (int i = 0; i < fft_display_points; i++) {
					// Calculate frequency for this display point
					float freq = (float)i * max_freq / (float)fft_display_points;
					
					// Find corresponding FFT bin
					int fft_bin = (int)(freq / freq_resolution);
					if (fft_bin >= fft_size / 2) fft_bin = fft_size / 2 - 1;
					if (fft_bin < 0) fft_bin = 0;
					
					// Get magnitude and convert to dB
					float magnitude = fft_magnitude[fft_bin];
					float normalized = magnitude / max_magnitude;
					float db = 20.0f * log10f(normalized + 0.001f);  // dB relative to peak
					
					// Map dB range to chart height
					// 0dB (peak) -> y=chart_range (top)
					// -amp_range dB (floor) -> y=0 (bottom)
					float db_normalized = (db + amp_range) / amp_range;  // 0.0 to 1.0
					if (db_normalized < 0.0f) db_normalized = 0.0f;
					if (db_normalized > 1.0f) db_normalized = 1.0f;
					
					// Bar height: from 0 (bottom) to calculated height
					int val = (int)(db_normalized * chart_range);
					
					if (val < 0) val = 0;
					if (val > (int)chart_range) val = (int)chart_range;
					
					ser->y_points[i] = val;
				}
			} else {
				// No ADC data - draw empty spectrum at bottom
				for (int i = 0; i < fft_display_points; i++) {
					ser->y_points[i] = 0;  // Bottom of chart
				}
			}
		} else {
			// No oscilloscope core - draw empty spectrum
			for (int i = 0; i < fft_display_points; i++) {
				ser->y_points[i] = 0;
			}
		}
		
		// Update FFT measurement displays
		char buf[64];
		
		// Peak frequency (fundamental) - 保持不变，显示信号频率
		if (guider_ui.scrOscilloscope_labelFreqTitle != NULL) {
			if (signal_frequency >= 1e6f) {
				snprintf(buf, sizeof(buf), "Freq: %.2fMHz", signal_frequency / 1e6f);
			} else if (signal_frequency >= 1e3f) {
				snprintf(buf, sizeof(buf), "Freq: %.2fkHz", signal_frequency / 1e3f);
			} else {
				snprintf(buf, sizeof(buf), "Freq: %.1fHz", signal_frequency);
			}
			lv_label_set_text(guider_ui.scrOscilloscope_labelFreqTitle, buf);
		}
		
		// Span改为显示1次谐波幅值（基波）
		if (guider_ui.scrOscilloscope_labelVmaxTitle != NULL) {
			snprintf(buf, sizeof(buf), "H1: %.3fV", fundamental_magnitude);
			lv_label_set_text(guider_ui.scrOscilloscope_labelVmaxTitle, buf);
		}
		
		// Range改为显示3次谐波幅值
		if (guider_ui.scrOscilloscope_labelVminTitle != NULL) {
			snprintf(buf, sizeof(buf), "H3: %.3fV", harmonic_3_magnitude);
			lv_label_set_text(guider_ui.scrOscilloscope_labelVminTitle, buf);
		}
		
		// Res改为显示THD（总谐波失真）
		if (guider_ui.scrOscilloscope_labelVppTitle != NULL) {
			snprintf(buf, sizeof(buf), "THD: %.2f%%", thd);
			lv_label_set_text(guider_ui.scrOscilloscope_labelVppTitle, buf);
		}
		
		// FFT size - 1024点FFT
		if (guider_ui.scrOscilloscope_labelVrmsTitle != NULL) {
			snprintf(buf, sizeof(buf), "FFT: 1024pt");
			lv_label_set_text(guider_ui.scrOscilloscope_labelVrmsTitle, buf);
		}
		
	} else {
		// Time domain mode - restore yellow color for waveform
		lv_chart_set_series_color(guider_ui.scrOscilloscope_chartWaveform, ser, lv_color_hex(0xFFFF00));  // Yellow
		
		// 只在运行模式下获取新的 ADC 数据
		if (!osc_running) {
			// STOP 模式：不更新数据，使用已冻结的数据（在上面已处理）
			return;
		}
		
