Jackcdut/Graduation-project-ESP32/BSP/GUIDER/generated/events_init.c
		// 运行模式：获取真实 ADC 数据
		float display_buffer[OSC_DISPLAY_WIDTH];
		uint32_t display_count = 0;
		
		// Update oscilloscope core (check for new ADC data)
		if (g_osc_ctx != NULL) {
			osc_update(g_osc_ctx);
			esp_err_t ret = osc_get_display_data(g_osc_ctx, display_buffer, &display_count);
			
			// Debug: Log data status every 500 frames
			static uint32_t frame_counter = 0;
			frame_counter++;
			if (frame_counter % 500 == 0) {
				ESP_LOGI("OSC_CHART", "Frame %lu: ret=%s, count=%lu", 
				         frame_counter, esp_err_to_name(ret), display_count);
			}
		}
		
		// Get current voltage scale
		float volts_per_div = volt_scale_values[osc_volt_scale_index];
		float units_per_division = chart_range / display_divisions;
		float units_per_volt = units_per_division / volts_per_div;
		
		// Draw waveform from real ADC data or flat line if no data
		if (display_count > 0) {
			// Use real ADC data
			// 移除频繁的日志打印
			// ESP_LOGI("OSC_CHART", "Drawing REAL ADC data: %lu points", display_count);
			
			// Initialize with zero (will be updated with first sample)
			float min_voltage = 0.0f;
			float max_voltage = 0.0f;
			float sum_squares = 0.0f;
			bool first_sample = true;
			
			for(int i = 0; i < num_points; i++) {
				float voltage;
				
				// Sample from voltage buffer (with interpolation if needed)
				if (display_count >= (uint32_t)num_points) {
					// Downsample: pick every Nth sample
					uint32_t src_idx = (i * display_count) / num_points;
					if (src_idx >= display_count) src_idx = display_count - 1;
					voltage = display_buffer[src_idx];
				} else {
					// Upsample: interpolate between samples
					float src_pos = (float)i * display_count / num_points;
					uint32_t src_idx = (uint32_t)src_pos;
					if (src_idx >= display_count - 1) {
						voltage = display_buffer[display_count - 1];
					} else {
						float frac = src_pos - src_idx;
						voltage = display_buffer[src_idx] * (1.0f - frac) + 
						         display_buffer[src_idx + 1] * frac;
					}
				}
				
				// Store voltage data for potential freezing (without Y offset)
				if (i < OSC_GRID_WIDTH) {
					osc_frozen_voltage_data[i] = voltage;
				}
				
				// Initialize min/max with first sample
				if (first_sample) {
					min_voltage = voltage;
					max_voltage = voltage;
					first_sample = false;
				}
				
				// Track min/max voltage for measurements
				if (voltage < min_voltage) min_voltage = voltage;
				if (voltage > max_voltage) max_voltage = voltage;
				sum_squares += voltage * voltage;
				
				// Apply Y offset
				voltage += osc_y_offset;
				
				// Convert voltage to chart Y coordinate
				// IMPORTANT: LVGL chart Y-axis: 0=bottom, 1000=top (inverted from canvas!)
				// Positive voltage -> above center (larger Y in chart coordinates)
				// Negative voltage -> below center (smaller Y in chart coordinates)
				float y_float = chart_center + (voltage * units_per_volt);
				
				// Clamp to valid chart range
				int val = (int)(y_float + 0.5f);
				if (val < 0) val = 0;
				if (val > (int)chart_range) val = (int)chart_range;
				ser->y_points[i] = val;
			}
			
			// Mark frozen data as valid
			osc_frozen_data_valid = true;
			osc_frozen_time_scale_index = osc_time_scale_index;
			osc_frozen_volt_scale_index = osc_volt_scale_index;
			
			// Update measurement displays from real data
			char buf[64];
			float vmax = max_voltage;
			float vmin = min_voltage;
			float vpp = vmax - vmin;
			float vrms = sqrtf(sum_squares / (float)num_points);
			
			// Sanity check: oscilloscope range is -50V to +50V
			// Note: In testing mode with ESP32 ADC, actual values will be 0-3.3V
			const float MAX_VOLTAGE = 55.0f;   // +50V + 5V margin
			const float MIN_VOLTAGE = -55.0f;  // -50V - 5V margin
			bool measurements_valid = (vmax <= MAX_VOLTAGE && vmin >= MIN_VOLTAGE);
			
			if (!measurements_valid) {
				ESP_LOGW("OSC_CHART", "Measurements out of range: Vmax=%.2fV, Vmin=%.2fV - showing ---", vmax, vmin);
			}
			
			// Get frequency from oscilloscope core
			float freq_hz = 0.0f;
			osc_measurement_t meas;
			if (g_osc_ctx != NULL && osc_get_measurements(g_osc_ctx, &meas) == ESP_OK) {
				freq_hz = meas.freq;
			}
			
			if (guider_ui.scrOscilloscope_labelFreqTitle != NULL) {
				if (freq_hz >= 1e6f) {
					snprintf(buf, sizeof(buf), "Freq: %.2fMHz", freq_hz / 1e6f);
				} else if (freq_hz >= 1e3f) {
					snprintf(buf, sizeof(buf), "Freq: %.2fkHz", freq_hz / 1e3f);
				} else {
					snprintf(buf, sizeof(buf), "Freq: %.1fHz", freq_hz);
				}
				lv_label_set_text(guider_ui.scrOscilloscope_labelFreqTitle, buf);
			}
			
			if (guider_ui.scrOscilloscope_labelVmaxTitle != NULL) {
				if (measurements_valid) {
					snprintf(buf, sizeof(buf), "Vmax: %.2fV", vmax);
				} else {
					snprintf(buf, sizeof(buf), "Vmax: ---");
				}
				lv_label_set_text(guider_ui.scrOscilloscope_labelVmaxTitle, buf);
			}
			
			if (guider_ui.scrOscilloscope_labelVminTitle != NULL) {
				if (measurements_valid) {
					snprintf(buf, sizeof(buf), "Vmin: %.2fV", vmin);
				} else {
					snprintf(buf, sizeof(buf), "Vmin: ---");
				}
				lv_label_set_text(guider_ui.scrOscilloscope_labelVminTitle, buf);
			}
			
			if (guider_ui.scrOscilloscope_labelVppTitle != NULL) {
				if (measurements_valid) {
					snprintf(buf, sizeof(buf), "Vp-p: %.2fV", vpp);
				} else {
					snprintf(buf, sizeof(buf), "Vp-p: ---");
				}
				lv_label_set_text(guider_ui.scrOscilloscope_labelVppTitle, buf);
			}
			
			if (guider_ui.scrOscilloscope_labelVrmsTitle != NULL) {
				if (measurements_valid) {
					snprintf(buf, sizeof(buf), "Vrms: %.2fV", vrms);
				} else {
					snprintf(buf, sizeof(buf), "Vrms: ---");
				}
				lv_label_set_text(guider_ui.scrOscilloscope_labelVrmsTitle, buf);
			}
		} else {
			// No ADC data available - draw flat line at center
			ESP_LOGW("OSC_CHART", "NO ADC data - drawing flat line");
			
			for(int i = 0; i < num_points; i++) {
				ser->y_points[i] = (int)chart_center;
			}
		}
	}

	lv_chart_refresh(guider_ui.scrOscilloscope_chartWaveform);
}

// Screen load event handler
static void scrOscilloscope_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);

	switch (code) {
	case LV_EVENT_SCREEN_LOADED:
	{
		// Initialize oscilloscope (real ADC sampling)
		esp_err_t ret = osc_global_init();
		if (ret != ESP_OK) {
			ESP_LOGE("OSC", "Failed to initialize oscilloscope: %s", esp_err_to_name(ret));
		}
		
		/* 切换STM32到示波器模式，开始上报波形数据 */
		stm32_set_mode(STM32_MODE_OSCILLOSCOPE);
		ESP_LOGI("OSC_UI", "Oscilloscope screen loaded, mode switched to OSCILLOSCOPE");
		
		// Initialize oscilloscope state
		osc_running = true;
		osc_fft_enabled = false;
		osc_grid_enabled = true;
		osc_export_enabled = false;
		osc_waveform_phase = 0;
		osc_x_offset = 0.0f;
		osc_y_offset = 0.0f;
		osc_x_offset_active = false;
		osc_y_offset_active = false;
		osc_trigger_voltage = 0.5f;
		osc_trigger_mode = 0;
		osc_trigger_active = false;
		osc_frozen_data_valid = false;

		// Initialize oscilloscope export module
		ret = osc_export_init();
		if (ret != ESP_OK) {
			ESP_LOGE("OSC", "Failed to initialize export module: %s", esp_err_to_name(ret));
		}
		
