Jackcdut/Graduation-project-ESP32/BSP/GUIDER/generated/events_init.c
		// Start ADC sampling
		osc_start(g_osc_ctx);

		// 同步初始时基和电压档位到核心层
		if (g_osc_ctx != NULL) {
			osc_set_time_per_div(g_osc_ctx, time_scale_values[osc_time_scale_index]);
			osc_set_volts_per_div(g_osc_ctx, volt_scale_values[osc_volt_scale_index]);
		}

		// Initialize offset displays
		lv_label_set_text(guider_ui.scrOscilloscope_labelXOffsetValue, "0us");
		lv_label_set_text(guider_ui.scrOscilloscope_labelYOffsetValue, "0V");

		// Initialize cursor/survey display (游标功能初始为关闭)
		lv_label_set_text(guider_ui.scrOscilloscope_labelTriggerValue, "OFF");

		// Initialize waveform preview mask references
		osc_preview_mask_left = guider_ui.scrOscilloscope_sliderWaveMask;
		osc_preview_mask_right = guider_ui.scrOscilloscope_sliderWaveMaskRight;
		osc_preview_trigger_line = guider_ui.scrOscilloscope_sliderWaveTrigger;
		
		// 初始状态：运行模式，隐藏遮罩
		if (osc_preview_mask_left != NULL) {
			lv_obj_add_flag(osc_preview_mask_left, LV_OBJ_FLAG_HIDDEN);
		}
		if (osc_preview_mask_right != NULL) {
			lv_obj_add_flag(osc_preview_mask_right, LV_OBJ_FLAG_HIDDEN);
		}

		// 触发电压线已移除 - 不再需要

		// Start waveform update timer (10ms = 100Hz refresh rate for smooth animation)
		if (osc_waveform_timer == NULL) {
			osc_waveform_timer = lv_timer_create(osc_waveform_update_cb, 10, NULL);
			if (osc_waveform_timer != NULL) {
				ESP_LOGI("OSC_TIMER", "✅ Waveform update timer created successfully (10ms period)");
			} else {
				ESP_LOGE("OSC_TIMER", "❌ Failed to create waveform update timer!");
			}
		} else {
			ESP_LOGI("OSC_TIMER", "⚠️ Timer already exists, reusing");
		}
		
		// Initialize hardware-accelerated drawing context
		if (osc_draw_ctx == NULL && osc_use_hw_accel) {
			// Canvas position: inside waveform container at (2, 2)
			osc_draw_ctx = osc_draw_init(guider_ui.scrOscilloscope_contWaveform, 2, 2);
			if (osc_draw_ctx != NULL) {
				ESP_LOGI("OSC", "Hardware-accelerated drawing initialized (FPS monitoring enabled)");
				// Hide the original chart widget (keep it for fallback)
				if (guider_ui.scrOscilloscope_chartWaveform != NULL) {
					lv_obj_add_flag(guider_ui.scrOscilloscope_chartWaveform, LV_OBJ_FLAG_HIDDEN);
				}
			} else {
				ESP_LOGW("OSC", "Failed to initialize hardware acceleration, falling back to chart");
				osc_use_hw_accel = false;
				// Make sure chart is visible
				if (guider_ui.scrOscilloscope_chartWaveform != NULL) {
					lv_obj_clear_flag(guider_ui.scrOscilloscope_chartWaveform, LV_OBJ_FLAG_HIDDEN);
				}
			}
		}
		break;
	}
	case LV_EVENT_SCREEN_UNLOADED:
	{
		/* 页面卸载时切换回空闲模式 */
		stm32_set_mode(STM32_MODE_IDLE);
		ESP_LOGI("OSC_UI", "Oscilloscope screen unloaded, mode switched to IDLE");
		
		// Stop and delete timer when leaving screen
		if (osc_waveform_timer != NULL) {
			lv_timer_del(osc_waveform_timer);
			osc_waveform_timer = NULL;
		}

		// Clean up trigger line objects
		if (osc_trigger_line != NULL) {
			lv_obj_del(osc_trigger_line);
			osc_trigger_line = NULL;
		}
		if (osc_trigger_marker != NULL) {
			lv_obj_del(osc_trigger_marker);
			osc_trigger_marker = NULL;
		}

		// Clean up Y baseline objects
		if (osc_y_baseline != NULL) {
			lv_obj_del(osc_y_baseline);
			osc_y_baseline = NULL;
		}
		if (osc_y_baseline_marker != NULL) {
			lv_obj_del(osc_y_baseline_marker);
			osc_y_baseline_marker = NULL;
		}
		
		// Clear waveform preview mask references (objects are deleted by LVGL)
		osc_preview_mask_left = NULL;
		osc_preview_mask_right = NULL;
		osc_preview_trigger_line = NULL;

		// Deinitialize export module
		osc_export_deinit();
		
		// Deinitialize hardware-accelerated drawing context
		if (osc_draw_ctx != NULL) {
			osc_draw_deinit(osc_draw_ctx);
			osc_draw_ctx = NULL;
			ESP_LOGI("OSC", "Hardware-accelerated drawing deinitialized");
		}
		
		// Show the original chart widget again (if it was hidden)
		if (guider_ui.scrOscilloscope_chartWaveform != NULL) {
			lv_obj_clear_flag(guider_ui.scrOscilloscope_chartWaveform, LV_OBJ_FLAG_HIDDEN);
		}
		
		// Deinitialize oscilloscope (stop ADC sampling)
		osc_global_deinit();

		break;
	}
	default:
		break;
	}
}

// Back button event handler
static void scrOscilloscope_btnBack_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);

	switch (code) {
	case LV_EVENT_CLICKED:
	{
		ui_load_scr_animation(&guider_ui, &guider_ui.scrHome, guider_ui.scrHome_del, &guider_ui.scrOscilloscope_del, setup_scr_scrHome, LV_SCR_LOAD_ANIM_FADE_ON, 0, 0, false, true);
		break;
	}
	default:
		break;
	}
}

// Start/Stop button event handler
static void scrOscilloscope_btnStartStop_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);

	switch (code) {
	case LV_EVENT_CLICKED:
	{
		osc_running = !osc_running;
		if (osc_running) {
			// 恢复运行 - 启动ADC采样
			lv_label_set_text(guider_ui.scrOscilloscope_btnStartStop_label, "RUN");
			lv_obj_set_style_bg_color(guider_ui.scrOscilloscope_btnStartStop, lv_color_hex(0x00FF00), LV_PART_MAIN|LV_STATE_DEFAULT);
			// 清除冻结数据标记，重新开始采集
			osc_frozen_data_valid = false;
			// 启动真实ADC采样
			osc_start(g_osc_ctx);
			// 恢复定时器（如果之前被暂停）
			if (osc_waveform_timer != NULL) {
				lv_timer_resume(osc_waveform_timer);
			}
		} else {
			// 停止运行 - 停止ADC采样，冻结波形
			lv_label_set_text(guider_ui.scrOscilloscope_btnStartStop_label, "STOP");
			lv_obj_set_style_bg_color(guider_ui.scrOscilloscope_btnStartStop, lv_color_hex(0xFF0000), LV_PART_MAIN|LV_STATE_DEFAULT);
			// 记录停止时的触发位置（当前X偏移）
			osc_frozen_x_offset_at_stop = osc_x_offset;
			// 停止真实ADC采样
			osc_stop(g_osc_ctx);
			// 在FFT模式下，暂停定时器以防止访问无效数据
			if (osc_fft_enabled && osc_waveform_timer != NULL) {
				lv_timer_pause(osc_waveform_timer);
			}
			// 冻结数据已在波形更新回调中保存
		}
		break;
	}
	default:
		break;
	}
}

// GRID button event handler - Toggle grid display
static void scrOscilloscope_btnPanZoom_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);

	switch (code) {
	case LV_EVENT_CLICKED:
	{
		osc_grid_enabled = !osc_grid_enabled;
		if (osc_grid_enabled) {
			// Grid ON - show grid lines (18 horizontal divisions, 10 vertical divisions, 40x40 pixels each)
			lv_obj_set_style_bg_color(guider_ui.scrOscilloscope_btnPanZoom, lv_color_hex(0x0080FF), LV_PART_MAIN|LV_STATE_DEFAULT);  // Bright blue
			lv_chart_set_div_line_count(guider_ui.scrOscilloscope_chartWaveform, 10, 18);  // (hdiv=10 horizontal lines, vdiv=18 vertical lines)
		} else {
			// Grid OFF - hide grid lines
			lv_obj_set_style_bg_color(guider_ui.scrOscilloscope_btnPanZoom, lv_color_hex(0x404040), LV_PART_MAIN|LV_STATE_DEFAULT);  // Dark gray
			lv_chart_set_div_line_count(guider_ui.scrOscilloscope_chartWaveform, 0, 0);  // Hide grid
		}
		lv_chart_refresh(guider_ui.scrOscilloscope_chartWaveform);
		break;
	}
	default:
		break;
	}
}

// FFT button event handler
static void scrOscilloscope_btnFFT_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);

	switch (code) {
	case LV_EVENT_CLICKED:
	{
		osc_fft_enabled = !osc_fft_enabled;
		if (osc_fft_enabled) {
			// Safety check - ensure UI objects are valid
			if (!guider_ui.scrOscilloscope_btnFFT || !lv_obj_is_valid(guider_ui.scrOscilloscope_btnFFT)) return;
			if (!guider_ui.scrOscilloscope_chartWaveform || !lv_obj_is_valid(guider_ui.scrOscilloscope_chartWaveform)) return;
			
			// 暂停定时器，防止在切换过程中访问图表
			if (osc_waveform_timer != NULL) {
				lv_timer_pause(osc_waveform_timer);
			}
			
