Jackcdut/Graduation-project-ESP32/BSP/GUIDER/generated/events_init.c
			lv_obj_set_style_bg_color(guider_ui.scrOscilloscope_btnFFT, lv_color_hex(0xFFFF00), LV_PART_MAIN|LV_STATE_DEFAULT);  // Bright yellow when active

			// 获取当前series并清除数据
			lv_chart_series_t *ser = lv_chart_get_series_next(guider_ui.scrOscilloscope_chartWaveform, NULL);
			
			// 先设置点数，再切换类型（顺序很重要）
			lv_chart_set_point_count(guider_ui.scrOscilloscope_chartWaveform, 1024);
			
			// 切换到柱状图模式
			lv_chart_set_type(guider_ui.scrOscilloscope_chartWaveform, LV_CHART_TYPE_BAR);
			
			// 初始化所有数据点为0，防止显示垃圾数据
			if (ser != NULL) {
				for (int i = 0; i < 1024; i++) {
					ser->y_points[i] = 0;
				}
			}
			
			// 设置柱状图样式
			lv_obj_set_style_pad_column(guider_ui.scrOscilloscope_chartWaveform, 0, LV_PART_ITEMS);  // 柱子间距0px，更密集
			
			// 刷新图表
			lv_chart_refresh(guider_ui.scrOscilloscope_chartWaveform);
			
			// FFT mode - update labels to show frequency domain information
			// 横轴：频率范围 (Frequency Span)
			// 纵轴：幅度范围 (Amplitude Range in dB)
			
			// Update title labels for FFT mode
			if (guider_ui.scrOscilloscope_labelTimeScaleTitle && lv_obj_is_valid(guider_ui.scrOscilloscope_labelTimeScaleTitle))
				lv_label_set_text(guider_ui.scrOscilloscope_labelTimeScaleTitle, "Span");
			if (guider_ui.scrOscilloscope_labelVoltScaleTitle && lv_obj_is_valid(guider_ui.scrOscilloscope_labelVoltScaleTitle))
				lv_label_set_text(guider_ui.scrOscilloscope_labelVoltScaleTitle, "dB");
			
			// Update time scale label to show frequency span
			if (guider_ui.scrOscilloscope_labelTimeScaleValue && lv_obj_is_valid(guider_ui.scrOscilloscope_labelTimeScaleValue))
				lv_label_set_text(guider_ui.scrOscilloscope_labelTimeScaleValue, osc_fft_freq_range_labels[osc_fft_freq_range_index]);
			
			// Update voltage scale label to show amplitude range
			if (guider_ui.scrOscilloscope_labelVoltScaleValue && lv_obj_is_valid(guider_ui.scrOscilloscope_labelVoltScaleValue))
				lv_label_set_text(guider_ui.scrOscilloscope_labelVoltScaleValue, osc_fft_amp_range_labels[osc_fft_amp_range_index]);
			
			// Update measurement labels for FFT
			if (guider_ui.scrOscilloscope_labelFreqTitle && lv_obj_is_valid(guider_ui.scrOscilloscope_labelFreqTitle))
				lv_label_set_text(guider_ui.scrOscilloscope_labelFreqTitle, "Fund: ---");
			if (guider_ui.scrOscilloscope_labelVmaxTitle && lv_obj_is_valid(guider_ui.scrOscilloscope_labelVmaxTitle))
				lv_label_set_text(guider_ui.scrOscilloscope_labelVmaxTitle, "H1: ---");
			if (guider_ui.scrOscilloscope_labelVminTitle && lv_obj_is_valid(guider_ui.scrOscilloscope_labelVminTitle))
				lv_label_set_text(guider_ui.scrOscilloscope_labelVminTitle, "H3: ---");
			if (guider_ui.scrOscilloscope_labelVppTitle && lv_obj_is_valid(guider_ui.scrOscilloscope_labelVppTitle))
				lv_label_set_text(guider_ui.scrOscilloscope_labelVppTitle, "THD: ---");
			if (guider_ui.scrOscilloscope_labelVrmsTitle && lv_obj_is_valid(guider_ui.scrOscilloscope_labelVrmsTitle))
				lv_label_set_text(guider_ui.scrOscilloscope_labelVrmsTitle, "H2: ---");

			// 恢复定时器
			if (osc_waveform_timer != NULL) {
				lv_timer_resume(osc_waveform_timer);
				lv_timer_ready(osc_waveform_timer);
			}
		} else {
			// Safety check - ensure UI objects are valid
			if (!guider_ui.scrOscilloscope_btnFFT || !lv_obj_is_valid(guider_ui.scrOscilloscope_btnFFT)) return;
			if (!guider_ui.scrOscilloscope_chartWaveform || !lv_obj_is_valid(guider_ui.scrOscilloscope_chartWaveform)) return;
			
			// 暂停定时器，防止在切换过程中访问图表
			if (osc_waveform_timer != NULL) {
				lv_timer_pause(osc_waveform_timer);
			}
			
			lv_obj_set_style_bg_color(guider_ui.scrOscilloscope_btnFFT, lv_color_hex(0xA0A000), LV_PART_MAIN|LV_STATE_DEFAULT);  // Dark yellow when inactive

			// 获取当前series
			lv_chart_series_t *ser = lv_chart_get_series_next(guider_ui.scrOscilloscope_chartWaveform, NULL);
			
			// 先设置点数，再切换类型（顺序很重要）
			lv_chart_set_point_count(guider_ui.scrOscilloscope_chartWaveform, OSC_GRID_WIDTH);
			
			// 恢复线图模式
			lv_chart_set_type(guider_ui.scrOscilloscope_chartWaveform, LV_CHART_TYPE_LINE);
			
			// 初始化所有数据点为中心值，防止显示垃圾数据
			if (ser != NULL) {
				for (int i = 0; i < OSC_GRID_WIDTH; i++) {
					ser->y_points[i] = 500;  // 中心值
				}
			}
			
			// 刷新图表
			lv_chart_refresh(guider_ui.scrOscilloscope_chartWaveform);
			
			// Restore time domain title labels
			if (guider_ui.scrOscilloscope_labelTimeScaleTitle && lv_obj_is_valid(guider_ui.scrOscilloscope_labelTimeScaleTitle))
				lv_label_set_text(guider_ui.scrOscilloscope_labelTimeScaleTitle, "Time");
			if (guider_ui.scrOscilloscope_labelVoltScaleTitle && lv_obj_is_valid(guider_ui.scrOscilloscope_labelVoltScaleTitle))
				lv_label_set_text(guider_ui.scrOscilloscope_labelVoltScaleTitle, "Volt");
			
			// Restore time domain labels
			// Update time scale label back to time
			if (guider_ui.scrOscilloscope_labelTimeScaleValue && lv_obj_is_valid(guider_ui.scrOscilloscope_labelTimeScaleValue)) {
				const char *time_str = osc_get_time_scale_str((osc_time_scale_t)osc_time_scale_index);
				lv_label_set_text(guider_ui.scrOscilloscope_labelTimeScaleValue, time_str);
			}
			
			// Update voltage scale label back to voltage
			if (guider_ui.scrOscilloscope_labelVoltScaleValue && lv_obj_is_valid(guider_ui.scrOscilloscope_labelVoltScaleValue)) {
				const char *volt_str = osc_get_volt_scale_str((osc_volt_scale_t)osc_volt_scale_index);
				lv_label_set_text(guider_ui.scrOscilloscope_labelVoltScaleValue, volt_str);
			}
			
			// Restore normal measurement displays
			if (guider_ui.scrOscilloscope_labelFreqTitle && lv_obj_is_valid(guider_ui.scrOscilloscope_labelFreqTitle))
				lv_label_set_text(guider_ui.scrOscilloscope_labelFreqTitle, "Freq: ---");
			if (guider_ui.scrOscilloscope_labelVmaxTitle && lv_obj_is_valid(guider_ui.scrOscilloscope_labelVmaxTitle))
				lv_label_set_text(guider_ui.scrOscilloscope_labelVmaxTitle, "Vmax: ---");
			if (guider_ui.scrOscilloscope_labelVminTitle && lv_obj_is_valid(guider_ui.scrOscilloscope_labelVminTitle))
				lv_label_set_text(guider_ui.scrOscilloscope_labelVminTitle, "Vmin: ---");
			if (guider_ui.scrOscilloscope_labelVppTitle && lv_obj_is_valid(guider_ui.scrOscilloscope_labelVppTitle))
				lv_label_set_text(guider_ui.scrOscilloscope_labelVppTitle, "Vp-p: ---");
			if (guider_ui.scrOscilloscope_labelVrmsTitle && lv_obj_is_valid(guider_ui.scrOscilloscope_labelVrmsTitle))
				lv_label_set_text(guider_ui.scrOscilloscope_labelVrmsTitle, "Vrms: ---");

