Jackcdut/Graduation-project-ESP32/BSP/GUIDER/generated/events_init.c
			// 恢复定时器
			if (osc_waveform_timer != NULL) {
				lv_timer_resume(osc_waveform_timer);
				lv_timer_ready(osc_waveform_timer);
			}
		}
		break;
	}
	default:
		break;
	}
}

// Export button event handler - Export waveform data via USB MSC
static void scrOscilloscope_btnExport_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);

	switch (code) {
	case LV_EVENT_LONG_PRESSED:
	{
		/* Long press to cycle through export formats */
		if (!osc_export_enabled) {
			osc_export_format_t current_format = osc_export_get_format();
			osc_export_format_t new_format = (current_format + 1) % 3;
			osc_export_set_format(new_format);

			/* Show format on button */
			const char *format_names[] = {"TXT", "CSV", "BOTH"};
			static char format_text[16];
			snprintf(format_text, sizeof(format_text), "FMT:%s", format_names[new_format]);
			lv_label_set_text(guider_ui.scrOscilloscope_btnExport_label, format_text);

			ESP_LOGI("OSC", "Export format changed to: %s", format_names[new_format]);

			/* Note: Button text will be restored when clicked or when screen is refreshed */
		}
		break;
	}
	case LV_EVENT_CLICKED:
	{
		/* First restore button text if it was showing format */
		const char *current_text = lv_label_get_text(guider_ui.scrOscilloscope_btnExport_label);
		if (current_text != NULL && strncmp(current_text, "FMT:", 4) == 0) {
			lv_label_set_text(guider_ui.scrOscilloscope_btnExport_label, "EXPORT");
			lv_obj_set_style_bg_color(guider_ui.scrOscilloscope_btnExport, lv_color_hex(0xA05000), LV_PART_MAIN|LV_STATE_DEFAULT);
			return;  /* Don't toggle export on format display click */
		}

		osc_export_enabled = !osc_export_enabled;
		if (osc_export_enabled) {
			/* Show preparing status */
			lv_obj_set_style_bg_color(guider_ui.scrOscilloscope_btnExport, lv_color_hex(0xFFFF00), LV_PART_MAIN|LV_STATE_DEFAULT);
			lv_label_set_text(guider_ui.scrOscilloscope_btnExport_label, "PREPARING");
			lv_refr_now(NULL);

			/* Prepare waveform data for export - use static to avoid stack overflow */
			static osc_waveform_data_t waveform_data;
			memset(&waveform_data, 0, sizeof(waveform_data));

			/* Get current waveform data from chart */
			lv_chart_series_t *ser = lv_chart_get_series_next(guider_ui.scrOscilloscope_chartWaveform, NULL);
			if (ser != NULL) {
				/* Get current settings first (needed for voltage conversion) */
				const float time_scale_values[] = {1e-6, 10e-6, 20e-6, 50e-6, 100e-6, 200e-6, 500e-6, 1e-3, 10e-3, 100e-3, 1.0};
				const float volt_scale_values[] = {0.01, 0.02, 0.05, 0.1, 0.2, 0.5, 1.0, 2.0, 5.0, 12.0};

				waveform_data.time_scale = time_scale_values[osc_time_scale_index];
				waveform_data.volt_scale = volt_scale_values[osc_volt_scale_index];

				/* Convert chart Y coordinates back to actual voltage values
				 * Chart Y range: 0-100, center at 50 (0V reference)
				 * Conversion: voltage = (y - center) / pixels_per_volt
				 * where pixels_per_volt = pixels_per_division / volts_per_div
				 */
				const float chart_center = 50.0f;
				const float pixels_per_division = 10.0f;
				float volts_per_div = volt_scale_values[osc_volt_scale_index];
				float pixels_per_volt = pixels_per_division / volts_per_div;

				waveform_data.num_points = (1000 < OSC_MAX_DATA_POINTS) ? 1000 : OSC_MAX_DATA_POINTS;
				for (int i = 0; i < waveform_data.num_points; i++) {
					// Convert chart Y coordinate back to actual voltage
					float y_coord = (float)ser->y_points[i];
					waveform_data.data[i] = (y_coord - chart_center) / pixels_per_volt;
				}

				/* Get measurement values from labels */
				const char *freq_text = lv_label_get_text(guider_ui.scrOscilloscope_labelFreqTitle);
				const char *vmax_text = lv_label_get_text(guider_ui.scrOscilloscope_labelVmaxTitle);
				const char *vmin_text = lv_label_get_text(guider_ui.scrOscilloscope_labelVminTitle);
				const char *vpp_text = lv_label_get_text(guider_ui.scrOscilloscope_labelVppTitle);
				const char *vrms_text = lv_label_get_text(guider_ui.scrOscilloscope_labelVrmsTitle);

				/* Parse values (simple parsing, skip label part) */
				sscanf(freq_text, "Freq:%f", &waveform_data.frequency);
				sscanf(vmax_text, "Vmax:%f", &waveform_data.vmax);
				sscanf(vmin_text, "Vmin:%f", &waveform_data.vmin);
				sscanf(vpp_text, "Vp-p:%f", &waveform_data.vpp);
				sscanf(vrms_text, "Vrms:%f", &waveform_data.vrms);

				waveform_data.is_fft = osc_fft_enabled;

				/* Get real timestamp from RTC */
				osc_export_get_timestamp(waveform_data.timestamp, sizeof(waveform_data.timestamp));

				/* Store waveform data */
				lv_label_set_text(guider_ui.scrOscilloscope_btnExport_label, "SAVING");
				lv_refr_now(NULL);
				osc_export_store_waveform(&waveform_data);

				/* If FFT is enabled, store FFT data with proper frequency spectrum */
				if (osc_fft_enabled) {
					static osc_waveform_data_t fft_data;
					memset(&fft_data, 0, sizeof(osc_waveform_data_t));
					fft_data.is_fft = true;
					
					/* FFT display points constant */
					const int fft_display_points = 256;  // Number of bars in FFT spectrum
					
					/* Get FFT-specific measurements from labels */
					const char *freq_text = lv_label_get_text(guider_ui.scrOscilloscope_labelFreqTitle);
					const char *h1_text = lv_label_get_text(guider_ui.scrOscilloscope_labelVmaxTitle);
					const char *h3_text = lv_label_get_text(guider_ui.scrOscilloscope_labelVminTitle);
					const char *thd_text = lv_label_get_text(guider_ui.scrOscilloscope_labelVppTitle);
					
					/* Parse FFT measurements */
					float fundamental_freq = 0.0f, h1_mag = 0.0f, h3_mag = 0.0f, thd_val = 0.0f;
					if (freq_text) sscanf(freq_text, "Freq: %f", &fundamental_freq);
					if (h1_text) sscanf(h1_text, "H1: %f", &h1_mag);
					if (h3_text) sscanf(h3_text, "H3: %f", &h3_mag);
					if (thd_text) sscanf(thd_text, "THD: %f", &thd_val);
					
					/* Store FFT parameters */
					fft_data.frequency = fundamental_freq;
					fft_data.vmax = h1_mag;  // Reuse vmax for H1 (fundamental)
					fft_data.vmin = h3_mag;  // Reuse vmin for H3
					fft_data.vpp = thd_val;  // Reuse vpp for THD
					fft_data.vrms = 1024.0f;  // FFT size
					
