Jackcdut/Graduation-project-ESP32/BSP/GUIDER/generated/events_init.c
					/* Get FFT frequency and amplitude ranges */
					const float fft_freq_ranges[] = {1e3, 5e3, 10e3, 25e3, 50e3};  // Hz
					const float fft_amp_ranges[] = {20, 40, 60, 80, 100};  // dB
					fft_data.time_scale = fft_freq_ranges[osc_fft_freq_range_index];  // Max frequency
					fft_data.volt_scale = fft_amp_ranges[osc_fft_amp_range_index];    // Amplitude range
					
					/* Copy FFT spectrum data from chart (frequency domain) */
					fft_data.num_points = (fft_display_points < OSC_MAX_DATA_POINTS) ? fft_display_points : OSC_MAX_DATA_POINTS;
					for (int i = 0; i < fft_data.num_points; i++) {
						/* Convert chart Y coordinate to dB magnitude
						 * Chart Y: 0=bottom (min dB), 100=top (0 dB)
						 * dB = (y / 100) * amp_range - amp_range
						 */
						float y_coord = (float)ser->y_points[i];
						float normalized = y_coord / 100.0f;  // 0.0 to 1.0
						fft_data.data[i] = (normalized * fft_data.volt_scale) - fft_data.volt_scale;  // dB value
					}
					
					/* Get timestamp */
					osc_export_get_timestamp(fft_data.timestamp, sizeof(fft_data.timestamp));
					
					/* Store FFT data */
					osc_export_store_fft(&fft_data);
				}

				/* Save directly to SD card */
				lv_label_set_text(guider_ui.scrOscilloscope_btnExport_label, "SAVING...");
				lv_refr_now(NULL);

				esp_err_t ret = osc_export_save_to_sd();
				if (ret != ESP_OK) {
					ESP_LOGE("OSC", "Failed to save to SD card: %s", esp_err_to_name(ret));
					lv_obj_set_style_bg_color(guider_ui.scrOscilloscope_btnExport, lv_color_hex(0xFF0000), LV_PART_MAIN|LV_STATE_DEFAULT);
					lv_label_set_text(guider_ui.scrOscilloscope_btnExport_label, "FAILED");
				} else {
					/* Show success */
					char status_text[32];
					uint32_t export_num = osc_export_get_counter();
					snprintf(status_text, sizeof(status_text), "SAVED #%u", (unsigned int)export_num);
					lv_obj_set_style_bg_color(guider_ui.scrOscilloscope_btnExport, lv_color_hex(0x00FF00), LV_PART_MAIN|LV_STATE_DEFAULT);
					lv_label_set_text(guider_ui.scrOscilloscope_btnExport_label, status_text);
					ESP_LOGI("OSC", "Oscilloscope data #%u saved to SD card", (unsigned int)export_num);
				}
				
				/* Reset button after delay */
				vTaskDelay(pdMS_TO_TICKS(2000));
				lv_obj_set_style_bg_color(guider_ui.scrOscilloscope_btnExport, lv_color_hex(0xA05000), LV_PART_MAIN|LV_STATE_DEFAULT);
				lv_label_set_text(guider_ui.scrOscilloscope_btnExport_label, "EXPORT");
				osc_export_enabled = false;
			}
		} else {
			/* Just reset button state */
			lv_obj_set_style_bg_color(guider_ui.scrOscilloscope_btnExport, lv_color_hex(0xA05000), LV_PART_MAIN|LV_STATE_DEFAULT);
			lv_label_set_text(guider_ui.scrOscilloscope_btnExport_label, "EXPORT");
			ESP_LOGI("OSC", "Export cancelled");
		}
		break;
	}
	default:
		break;
	}
}

// Time scale button event handler
// 真实示波器行为：
// - 时间参数增大 → 波形被压缩 → 屏幕上显示更多周期
// - 时间参数减小 → 波形被拉伸 → 屏幕上显示更少周期（放大效果）
// - 配合X-Pos偏移可以查看波形的不同部分
// 例如：1kHz信号（周期1ms）
//   - 1ms/div × 16格 = 16ms总时间 → 显示16个周期（压缩）
//   - 100us/div × 16格 = 1.6ms总时间 → 显示1.6个周期（正常）
//   - 10us/div × 16格 = 160us总时间 → 显示0.16个周期（放大）
static void scrOscilloscope_contTimeScale_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);

	switch (code) {
	case LV_EVENT_CLICKED:
	{
		// In FFT mode, adjust frequency range instead of time scale
		if (osc_fft_enabled) {
			// Cycle through frequency ranges
			osc_fft_freq_range_index = (osc_fft_freq_range_index + 1) % FFT_FREQ_RANGE_COUNT;
			lv_label_set_text(guider_ui.scrOscilloscope_labelTimeScaleValue, osc_fft_freq_range_labels[osc_fft_freq_range_index]);
			return;
		}
		
		// Cycle through all time scales (use global time_scale_labels array)
		osc_time_scale_index = (osc_time_scale_index + 1) % TIME_SCALE_COUNT;
		lv_label_set_text(guider_ui.scrOscilloscope_labelTimeScaleValue, time_scale_labels[osc_time_scale_index]);

		// 同步时基到核心层
		if (g_osc_ctx != NULL) {
			osc_set_time_per_div(g_osc_ctx, time_scale_values[osc_time_scale_index]);
		}

		// Update X offset display with new unit
		char offset_str[32];
		format_time_offset(offset_str, sizeof(offset_str), osc_x_offset, osc_time_scale_index);
		lv_label_set_text(guider_ui.scrOscilloscope_labelXOffsetValue, offset_str);

		// In STOP mode, trigger a redraw with new scale
		if (!osc_running && osc_frozen_data_valid) {
			// Force timer callback to redraw frozen waveform
			osc_waveform_update_cb(NULL);
		}

		break;
	}
	default:
		break;
	}
}

// Voltage scale button event handler
static void scrOscilloscope_contVoltScale_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);

	switch (code) {
	case LV_EVENT_CLICKED:
	{
		// In FFT mode, adjust amplitude range instead of voltage scale
		if (osc_fft_enabled) {
			// Cycle through amplitude ranges
			osc_fft_amp_range_index = (osc_fft_amp_range_index + 1) % FFT_AMP_RANGE_COUNT;
			lv_label_set_text(guider_ui.scrOscilloscope_labelVoltScaleValue, osc_fft_amp_range_labels[osc_fft_amp_range_index]);
			return;
		}
		
		// Cycle through voltage scales: 10mV, 20mV, 50mV, 100mV, 200mV, 500mV, 1V, 2V, 5V, 10V
		osc_volt_scale_index = (osc_volt_scale_index + 1) % VOLT_SCALE_COUNT;
		lv_label_set_text(guider_ui.scrOscilloscope_labelVoltScaleValue, volt_scale_labels[osc_volt_scale_index]);

		// 同步电压档位到核心层
		if (g_osc_ctx != NULL) {
			osc_set_volts_per_div(g_osc_ctx, volt_scale_values[osc_volt_scale_index]);
		}

		// Update Y offset display with new unit
		char offset_str[32];
		format_voltage_offset(offset_str, sizeof(offset_str), osc_y_offset, osc_volt_scale_index);
		lv_label_set_text(guider_ui.scrOscilloscope_labelYOffsetValue, offset_str);

		// Update Y baseline marker if visible
		if (osc_y_baseline_marker != NULL && !lv_obj_has_flag(osc_y_baseline_marker, LV_OBJ_FLAG_HIDDEN)) {
			lv_label_set_text(osc_y_baseline_marker, offset_str);
		}

		// In STOP mode, trigger a redraw with new scale
		if (!osc_running && osc_frozen_data_valid) {
			// Force timer callback to redraw frozen waveform
			osc_waveform_update_cb(NULL);
		}

		break;
	}
	default:
		break;
	}
}

// Coupling button event handler
static void scrOscilloscope_contCoupling_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);

	switch (code) {
	case LV_EVENT_CLICKED:
	{
		// Toggle between DC and AC coupling
		const char *current = lv_label_get_text(guider_ui.scrOscilloscope_labelCouplingValue);
		uint8_t new_coupling;
		if (strcmp(current, "DC") == 0) {
			lv_label_set_text(guider_ui.scrOscilloscope_labelCouplingValue, "AC");
			new_coupling = 1;  // AC coupling
		} else {
			lv_label_set_text(guider_ui.scrOscilloscope_labelCouplingValue, "DC");
			new_coupling = 0;  // DC coupling
		}
		// Send coupling command to STM32
		stm32_osc_set_coupling(new_coupling);
		break;
	}
	default:
		break;
	}
}

// Trigger mode button event handler
static void scrOscilloscope_contTriggerMode_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);

	switch (code) {
	case LV_EVENT_CLICKED:
	{
		// Cycle through trigger modes: RISE, FALL, EDGE
		const char *trigger_modes[] = {"RISE", "FALL", "EDGE"};
		osc_trigger_mode = (osc_trigger_mode + 1) % 3;
		lv_label_set_text(guider_ui.scrOscilloscope_labelTriggerModeValue, trigger_modes[osc_trigger_mode]);
		break;
	}
	default:
		break;
	}
}

// Trigger voltage button event handler
// Cursor measurement button event handler (刻度线查询功能)
// 只处理点击事件切换模式，禁止旋转操作
static void scrOscilloscope_contTrigger_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);
	lv_obj_t *target = lv_event_get_target(e);

	switch (code) {
	case LV_EVENT_CLICKED:
	{
		// 循环切换游标模式：关闭 → 横轴 → 纵轴 → 关闭
		osc_cursor_mode = (osc_cursor_mode + 1) % 3;
		
