Jackcdut/Graduation-project-ESP32/BSP/GUIDER/generated/events_init.c
		// 关闭X/Y偏移模式（互斥）
		if (osc_cursor_mode != OSC_CURSOR_OFF) {
			osc_x_offset_active = false;
			osc_y_offset_active = false;
			
			// 恢复X-Pos按钮样式
			lv_obj_set_style_border_color(guider_ui.scrOscilloscope_contXOffset, lv_color_hex(0xFF00FF), LV_PART_MAIN|LV_STATE_DEFAULT);
			lv_obj_set_style_border_width(guider_ui.scrOscilloscope_contXOffset, 2, LV_PART_MAIN|LV_STATE_DEFAULT);
			lv_obj_set_style_bg_color(guider_ui.scrOscilloscope_contXOffset, lv_color_hex(0x000000), LV_PART_MAIN|LV_STATE_DEFAULT);
			if (guider_ui.scrOscilloscope_labelXOffsetTitle != NULL) {
				lv_obj_set_style_text_color(guider_ui.scrOscilloscope_labelXOffsetTitle, lv_color_hex(0xFFFFFF), LV_PART_MAIN|LV_STATE_DEFAULT);
			}
			if (guider_ui.scrOscilloscope_labelXOffsetValue != NULL) {
				lv_obj_set_style_text_color(guider_ui.scrOscilloscope_labelXOffsetValue, lv_color_hex(0xFFFFFF), LV_PART_MAIN|LV_STATE_DEFAULT);
			}
			
			// 恢复Y-Pos按钮样式
			lv_obj_set_style_border_color(guider_ui.scrOscilloscope_contYOffset, lv_color_hex(0x00FF00), LV_PART_MAIN|LV_STATE_DEFAULT);
			lv_obj_set_style_border_width(guider_ui.scrOscilloscope_contYOffset, 2, LV_PART_MAIN|LV_STATE_DEFAULT);
			lv_obj_set_style_bg_color(guider_ui.scrOscilloscope_contYOffset, lv_color_hex(0x000000), LV_PART_MAIN|LV_STATE_DEFAULT);
			if (guider_ui.scrOscilloscope_labelYOffsetTitle != NULL) {
				lv_obj_set_style_text_color(guider_ui.scrOscilloscope_labelYOffsetTitle, lv_color_hex(0xFFFFFF), LV_PART_MAIN|LV_STATE_DEFAULT);
			}
			if (guider_ui.scrOscilloscope_labelYOffsetValue != NULL) {
				lv_obj_set_style_text_color(guider_ui.scrOscilloscope_labelYOffsetValue, lv_color_hex(0xFFFFFF), LV_PART_MAIN|LV_STATE_DEFAULT);
			}
			
			// 隐藏Y基线
			if (osc_y_baseline != NULL) {
				lv_obj_add_flag(osc_y_baseline, LV_OBJ_FLAG_HIDDEN);
			}
			if (osc_y_baseline_marker != NULL) {
				lv_obj_add_flag(osc_y_baseline_marker, LV_OBJ_FLAG_HIDDEN);
			}
		}
		
		// 删除旧的游标对象
		if (osc_cursor_line != NULL) {
			lv_obj_del(osc_cursor_line);
			osc_cursor_line = NULL;
		}
		if (osc_cursor_label != NULL) {
			lv_obj_del(osc_cursor_label);
			osc_cursor_label = NULL;
		}
		
		// 根据模式创建新的游标
		if (osc_cursor_mode == OSC_CURSOR_OFF) {
			// 关闭游标 - 恢复正常边框和背景
			lv_obj_set_style_border_color(target, lv_color_hex(0xFF00FF), LV_PART_MAIN|LV_STATE_DEFAULT);
			lv_obj_set_style_border_width(target, 2, LV_PART_MAIN|LV_STATE_DEFAULT);
			// 恢复原始背景色（黑色）
			lv_obj_set_style_bg_color(target, lv_color_hex(0x000000), LV_PART_MAIN|LV_STATE_DEFAULT);
			lv_obj_set_style_bg_opa(target, LV_OPA_COVER, LV_PART_MAIN|LV_STATE_DEFAULT);
			
			// 恢复文字颜色为白色
			if (guider_ui.scrOscilloscope_labelTriggerTitle != NULL) {
				lv_obj_set_style_text_color(guider_ui.scrOscilloscope_labelTriggerTitle, lv_color_hex(0xFFFFFF), LV_PART_MAIN|LV_STATE_DEFAULT);
			}
			if (guider_ui.scrOscilloscope_labelTriggerValue != NULL) {
				lv_obj_set_style_text_color(guider_ui.scrOscilloscope_labelTriggerValue, lv_color_hex(0xFFFFFF), LV_PART_MAIN|LV_STATE_DEFAULT);
				lv_label_set_text(guider_ui.scrOscilloscope_labelTriggerValue, "OFF");
			}
		} else if (osc_cursor_mode == OSC_CURSOR_HORIZONTAL) {
			// 横轴游标（时间/频率）- 青色边框，白色背景
			lv_obj_set_style_border_color(target, lv_color_hex(0x00FFFF), LV_PART_MAIN|LV_STATE_DEFAULT);  // 青色边框
			lv_obj_set_style_border_width(target, 3, LV_PART_MAIN|LV_STATE_DEFAULT);
			// 整个背景填充白色
			lv_obj_set_style_bg_color(target, lv_color_hex(0xFFFFFF), LV_PART_MAIN|LV_STATE_DEFAULT);
			lv_obj_set_style_bg_opa(target, LV_OPA_COVER, LV_PART_MAIN|LV_STATE_DEFAULT);
			
			// 文字改为黑色（在白色背景上显示）
			if (guider_ui.scrOscilloscope_labelTriggerTitle != NULL) {
				lv_obj_set_style_text_color(guider_ui.scrOscilloscope_labelTriggerTitle, lv_color_hex(0x000000), LV_PART_MAIN|LV_STATE_DEFAULT);
			}
			if (guider_ui.scrOscilloscope_labelTriggerValue != NULL) {
				lv_obj_set_style_text_color(guider_ui.scrOscilloscope_labelTriggerValue, lv_color_hex(0x000000), LV_PART_MAIN|LV_STATE_DEFAULT);
			}
			
			// 创建垂直游标线（虚线样式）
			osc_cursor_line = lv_line_create(guider_ui.scrOscilloscope_contWaveform);
			static lv_point_t line_points_h[2];
			osc_cursor_position = OSC_WAVEFORM_PIXEL_WIDTH / 2;  // 中心位置
			line_points_h[0].x = osc_cursor_position;
			line_points_h[0].y = 0;
			line_points_h[1].x = osc_cursor_position;
			line_points_h[1].y = OSC_WAVEFORM_PIXEL_HEIGHT;
			lv_line_set_points(osc_cursor_line, line_points_h, 2);
			
			// 专业示波器风格：亮青色虚线，带发光效果
			lv_obj_set_style_line_color(osc_cursor_line, lv_color_hex(0x00FFFF), LV_PART_MAIN|LV_STATE_DEFAULT);
			lv_obj_set_style_line_width(osc_cursor_line, 2, LV_PART_MAIN|LV_STATE_DEFAULT);
			lv_obj_set_style_line_dash_width(osc_cursor_line, 8, LV_PART_MAIN|LV_STATE_DEFAULT);
			lv_obj_set_style_line_dash_gap(osc_cursor_line, 4, LV_PART_MAIN|LV_STATE_DEFAULT);
			lv_obj_set_style_shadow_width(osc_cursor_line, 6, LV_PART_MAIN|LV_STATE_DEFAULT);
			lv_obj_set_style_shadow_color(osc_cursor_line, lv_color_hex(0x00FFFF), LV_PART_MAIN|LV_STATE_DEFAULT);
			lv_obj_set_style_shadow_opa(osc_cursor_line, LV_OPA_50, LV_PART_MAIN|LV_STATE_DEFAULT);
			lv_obj_set_style_shadow_spread(osc_cursor_line, 2, LV_PART_MAIN|LV_STATE_DEFAULT);
			
			// 创建专业标签（带边框和圆角）
			osc_cursor_label = lv_label_create(guider_ui.scrOscilloscope_contWaveform);
			// 根据当前模式显示初始文本
			if (osc_fft_enabled) {
				lv_label_set_text(osc_cursor_label, "0.0Hz");
			} else {
				lv_label_set_text(osc_cursor_label, "0.0ms");
			}
			lv_obj_set_pos(osc_cursor_label, osc_cursor_position + 8, 8);
			lv_obj_set_style_text_color(osc_cursor_label, lv_color_hex(0x00FFFF), LV_PART_MAIN|LV_STATE_DEFAULT);
			lv_obj_set_style_text_font(osc_cursor_label, &lv_font_montserrat_14, LV_PART_MAIN|LV_STATE_DEFAULT);
			lv_obj_set_style_bg_color(osc_cursor_label, lv_color_hex(0x001a1a), LV_PART_MAIN|LV_STATE_DEFAULT);
			lv_obj_set_style_bg_opa(osc_cursor_label, LV_OPA_90, LV_PART_MAIN|LV_STATE_DEFAULT);
			lv_obj_set_style_border_color(osc_cursor_label, lv_color_hex(0x00FFFF), LV_PART_MAIN|LV_STATE_DEFAULT);
			lv_obj_set_style_border_width(osc_cursor_label, 1, LV_PART_MAIN|LV_STATE_DEFAULT);
			lv_obj_set_style_border_opa(osc_cursor_label, LV_OPA_60, LV_PART_MAIN|LV_STATE_DEFAULT);
			lv_obj_set_style_radius(osc_cursor_label, 4, LV_PART_MAIN|LV_STATE_DEFAULT);
			lv_obj_set_style_pad_all(osc_cursor_label, 4, LV_PART_MAIN|LV_STATE_DEFAULT);
			lv_obj_set_style_shadow_width(osc_cursor_label, 4, LV_PART_MAIN|LV_STATE_DEFAULT);
			lv_obj_set_style_shadow_color(osc_cursor_label, lv_color_hex(0x00FFFF), LV_PART_MAIN|LV_STATE_DEFAULT);
			lv_obj_set_style_shadow_opa(osc_cursor_label, LV_OPA_30, LV_PART_MAIN|LV_STATE_DEFAULT);
			
			// 更新按钮标签
			if (guider_ui.scrOscilloscope_labelTriggerValue != NULL) {
				lv_label_set_text(guider_ui.scrOscilloscope_labelTriggerValue, "H-CUR");
			}
		} else if (osc_cursor_mode == OSC_CURSOR_VERTICAL) {
			// 纵轴游标（电压/幅值）- 黄色边框，白色背景
			lv_obj_set_style_border_color(target, lv_color_hex(0xFFFF00), LV_PART_MAIN|LV_STATE_DEFAULT);  // 黄色边框
			lv_obj_set_style_border_width(target, 3, LV_PART_MAIN|LV_STATE_DEFAULT);
			// 整个背景填充白色
			lv_obj_set_style_bg_color(target, lv_color_hex(0xFFFFFF), LV_PART_MAIN|LV_STATE_DEFAULT);
			lv_obj_set_style_bg_opa(target, LV_OPA_COVER, LV_PART_MAIN|LV_STATE_DEFAULT);
			
