Jackcdut/Graduation-project-ESP32/BSP/GUIDER/generated/events_init.c
// Y-Pos (Y offset) button event handler
static void scrOscilloscope_contYOffset_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);
	lv_obj_t *target = lv_event_get_target(e);

	switch (code) {
	case LV_EVENT_CLICKED:
	{
		// Toggle Y offset control active state
		osc_y_offset_active = !osc_y_offset_active;

		if (osc_y_offset_active) {
			// 关闭游标模式和X偏移（互斥）
			osc_cursor_mode = OSC_CURSOR_OFF;
			osc_x_offset_active = false;
			
			// 删除游标对象
			if (osc_cursor_line != NULL) {
				lv_obj_del(osc_cursor_line);
				osc_cursor_line = NULL;
			}
			if (osc_cursor_label != NULL) {
				lv_obj_del(osc_cursor_label);
				osc_cursor_label = NULL;
			}
			
			// 恢复Survey按钮样式
			lv_obj_set_style_border_color(guider_ui.scrOscilloscope_contTrigger, lv_color_hex(0xFF00FF), LV_PART_MAIN|LV_STATE_DEFAULT);
			lv_obj_set_style_border_width(guider_ui.scrOscilloscope_contTrigger, 2, LV_PART_MAIN|LV_STATE_DEFAULT);
			lv_obj_set_style_bg_color(guider_ui.scrOscilloscope_contTrigger, lv_color_hex(0x000000), LV_PART_MAIN|LV_STATE_DEFAULT);
			if (guider_ui.scrOscilloscope_labelTriggerTitle != NULL) {
				lv_obj_set_style_text_color(guider_ui.scrOscilloscope_labelTriggerTitle, lv_color_hex(0xFFFFFF), LV_PART_MAIN|LV_STATE_DEFAULT);
			}
			if (guider_ui.scrOscilloscope_labelTriggerValue != NULL) {
				lv_obj_set_style_text_color(guider_ui.scrOscilloscope_labelTriggerValue, lv_color_hex(0xFFFFFF), LV_PART_MAIN|LV_STATE_DEFAULT);
				lv_label_set_text(guider_ui.scrOscilloscope_labelTriggerValue, "OFF");
			}
			
			// 恢复X-Pos按钮样式
			lv_obj_set_style_border_color(guider_ui.scrOscilloscope_contXOffset, lv_color_hex(0xFF00FF), LV_PART_MAIN|LV_STATE_DEFAULT);
			lv_obj_set_style_border_width(guider_ui.scrOscilloscope_contXOffset, 2, LV_PART_MAIN|LV_STATE_DEFAULT);
			lv_obj_set_style_bg_color(guider_ui.scrOscilloscope_contXOffset, lv_color_hex(0x000000), LV_PART_MAIN|LV_STATE_DEFAULT);
			if (guider_ui.scrOscilloscope_labelXOffsetTitle != NULL) {
				lv_obj_set_style_text_color(guider_ui.scrOscilloscope_labelXOffsetTitle, lv_color_hex(0xFFFFFF), LV_PART_MAIN|LV_STATE_DEFAULT);
			}
			if (guider_ui.scrOscilloscope_labelXOffsetValue != NULL) {
				lv_obj_set_style_text_color(guider_ui.scrOscilloscope_labelXOffsetValue, lv_color_hex(0xFFFFFF), LV_PART_MAIN|LV_STATE_DEFAULT);
			}
			
			// 恢复X-Pos按钮样式
			lv_obj_set_style_border_color(guider_ui.scrOscilloscope_contXOffset, lv_color_hex(0xFF00FF), LV_PART_MAIN|LV_STATE_DEFAULT);
			lv_obj_set_style_border_width(guider_ui.scrOscilloscope_contXOffset, 2, LV_PART_MAIN|LV_STATE_DEFAULT);
			lv_obj_set_style_bg_color(guider_ui.scrOscilloscope_contXOffset, lv_color_hex(0x000000), LV_PART_MAIN|LV_STATE_DEFAULT);
			// 恢复X-Pos文字颜色
			if (guider_ui.scrOscilloscope_labelXOffsetTitle != NULL) {
				lv_obj_set_style_text_color(guider_ui.scrOscilloscope_labelXOffsetTitle, lv_color_hex(0xFFFFFF), LV_PART_MAIN|LV_STATE_DEFAULT);
			}
			if (guider_ui.scrOscilloscope_labelXOffsetValue != NULL) {
				lv_obj_set_style_text_color(guider_ui.scrOscilloscope_labelXOffsetValue, lv_color_hex(0xFFFFFF), LV_PART_MAIN|LV_STATE_DEFAULT);
			}

			// 激活Y-Pos：白色背景+黑色文字
			lv_obj_set_style_border_color(target, lv_color_hex(0x00FF00), LV_PART_MAIN|LV_STATE_DEFAULT);  // 绿色边框
			lv_obj_set_style_border_width(target, 3, LV_PART_MAIN|LV_STATE_DEFAULT);
			lv_obj_set_style_bg_color(target, lv_color_hex(0xFFFFFF), LV_PART_MAIN|LV_STATE_DEFAULT);  // 白色背景
			lv_obj_set_style_bg_opa(target, LV_OPA_COVER, LV_PART_MAIN|LV_STATE_DEFAULT);
			// 文字改为黑色
			if (guider_ui.scrOscilloscope_labelYOffsetTitle != NULL) {
				lv_obj_set_style_text_color(guider_ui.scrOscilloscope_labelYOffsetTitle, lv_color_hex(0x000000), LV_PART_MAIN|LV_STATE_DEFAULT);
			}
			if (guider_ui.scrOscilloscope_labelYOffsetValue != NULL) {
				lv_obj_set_style_text_color(guider_ui.scrOscilloscope_labelYOffsetValue, lv_color_hex(0x000000), LV_PART_MAIN|LV_STATE_DEFAULT);
			}

			// Create Y baseline indicator (horizontal line at center)
			if (osc_y_baseline == NULL) {
				osc_y_baseline = lv_line_create(guider_ui.scrOscilloscope_contWaveform);
				static lv_point_t y_baseline_points[2];
				y_baseline_points[0].x = 0;
				y_baseline_points[0].y = 200;  // Center Y position
				y_baseline_points[1].x = 720;
				y_baseline_points[1].y = 200;
				lv_line_set_points(osc_y_baseline, y_baseline_points, 2);
				lv_obj_set_style_line_color(osc_y_baseline, lv_color_hex(0x00FF00), LV_PART_MAIN|LV_STATE_DEFAULT);  // Green
				lv_obj_set_style_line_width(osc_y_baseline, 2, LV_PART_MAIN|LV_STATE_DEFAULT);
				lv_obj_set_style_line_dash_width(osc_y_baseline, 5, LV_PART_MAIN|LV_STATE_DEFAULT);
				lv_obj_set_style_line_dash_gap(osc_y_baseline, 5, LV_PART_MAIN|LV_STATE_DEFAULT);
			} else {
				lv_obj_clear_flag(osc_y_baseline, LV_OBJ_FLAG_HIDDEN);
			}

			// Create Y baseline marker
			if (osc_y_baseline_marker == NULL) {
				osc_y_baseline_marker = lv_label_create(guider_ui.scrOscilloscope_contWaveform);
				lv_label_set_text(osc_y_baseline_marker, "0V");
				lv_obj_set_pos(osc_y_baseline_marker, 5, 200 - 10);
				lv_obj_set_style_text_color(osc_y_baseline_marker, lv_color_hex(0x00FF00), LV_PART_MAIN|LV_STATE_DEFAULT);
				lv_obj_set_style_text_font(osc_y_baseline_marker, &lv_font_montserrat_12, LV_PART_MAIN|LV_STATE_DEFAULT);
			} else {
				lv_obj_clear_flag(osc_y_baseline_marker, LV_OBJ_FLAG_HIDDEN);
			}
		} else {
			// 恢复正常样式：黑色背景+白色文字
			lv_obj_set_style_border_color(target, lv_color_hex(0x00FF00), LV_PART_MAIN|LV_STATE_DEFAULT);
			lv_obj_set_style_border_width(target, 2, LV_PART_MAIN|LV_STATE_DEFAULT);
			lv_obj_set_style_bg_color(target, lv_color_hex(0x000000), LV_PART_MAIN|LV_STATE_DEFAULT);
			lv_obj_set_style_bg_opa(target, LV_OPA_COVER, LV_PART_MAIN|LV_STATE_DEFAULT);
			// 文字改为白色
			if (guider_ui.scrOscilloscope_labelYOffsetTitle != NULL) {
				lv_obj_set_style_text_color(guider_ui.scrOscilloscope_labelYOffsetTitle, lv_color_hex(0xFFFFFF), LV_PART_MAIN|LV_STATE_DEFAULT);
			}
			if (guider_ui.scrOscilloscope_labelYOffsetValue != NULL) {
				lv_obj_set_style_text_color(guider_ui.scrOscilloscope_labelYOffsetValue, lv_color_hex(0xFFFFFF), LV_PART_MAIN|LV_STATE_DEFAULT);
			}

			// Hide Y baseline
			if (osc_y_baseline != NULL) {
				lv_obj_add_flag(osc_y_baseline, LV_OBJ_FLAG_HIDDEN);
			}
			if (osc_y_baseline_marker != NULL) {
				lv_obj_add_flag(osc_y_baseline_marker, LV_OBJ_FLAG_HIDDEN);
			}
		}
		break;
	}
	default:
		break;
	}
}

// AUTO button event handler - Improved professional auto-adjust algorithm
static void scrOscilloscope_btnAuto_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);

	switch (code) {
	case LV_EVENT_CLICKED:
	{
		// Visual feedback - show "AUTO" is running
		lv_obj_set_style_bg_color(guider_ui.scrOscilloscope_btnAuto, lv_color_hex(0xFFFF00), LV_PART_MAIN|LV_STATE_DEFAULT);
		lv_label_set_text(guider_ui.scrOscilloscope_btnAuto_label, "WAIT");
		lv_refr_now(NULL);

