Jackcdut/Graduation-project-ESP32/BSP/GUIDER/generated/events_init.c
		// Analyze current waveform to determine optimal settings
		lv_chart_series_t *ser = lv_chart_get_series_next(guider_ui.scrOscilloscope_chartWaveform, NULL);
		if (ser != NULL) {
			// Chart display parameters
			const float chart_center = 500.0f;  // Y center in chart units (0-1000 range)
			const float units_per_division = 100.0f;  // 100 chart units = 1 division
			const int num_points = OSC_GRID_WIDTH;  // 1024 data points
			const float volt_scale_values[] = {0.01, 0.02, 0.05, 0.1, 0.2, 0.5, 1.0, 2.0, 5.0, 12.0};
			const char *volt_scales[] = {"10mV", "20mV", "50mV", "100mV", "200mV", "500mV", "1V", "2V", "5V", "12V"};
			const char *time_scales[] = {"1us", "10us", "20us", "50us", "100us", "200us", "500us", "1ms", "10ms", "100ms", "1s"};

			// Step 1: 分析波形的电压范围
			float min_voltage = 0.0f, max_voltage = 0.0f;
			float current_volts_per_div = volt_scale_values[osc_volt_scale_index];
			float current_units_per_volt = units_per_division / current_volts_per_div;
			bool first_point = true;

			for(int i = 0; i < num_points; i++) {
				float voltage = ((float)ser->y_points[i] - chart_center) / current_units_per_volt;
				
				if (first_point) {
					min_voltage = voltage;
					max_voltage = voltage;
					first_point = false;
				}
				
				if (voltage < min_voltage) min_voltage = voltage;
				if (voltage > max_voltage) max_voltage = voltage;
			}

			// Step 2: 计算信号的峰峰值和中心
			float vpp = max_voltage - min_voltage;
			float signal_center = (max_voltage + min_voltage) / 2.0f;

			// Step 3: 选择合适的电压档位
			// 目标：信号占据屏幕的60-80%（6-8个division）
			// 改进：使用更激进的策略，让信号更充分地显示
			int best_volt_idx = 6;  // Default to 1V
			
			if (vpp > 0.001f) {  // 有效信号
				// 计算需要的V/div：让峰峰值占据6-7个division
				float target_volts_per_div = vpp / 6.5f;
				
				// 找到最接近的标准档位（稍大一点）
				for(int i = 0; i < 10; i++) {
					if (volt_scale_values[i] >= target_volts_per_div) {
						best_volt_idx = i;
						break;
					}
				}
				
				// 如果信号太小，至少使用10mV档
				if (best_volt_idx == 6 && vpp < 0.1f) {
					best_volt_idx = 0;  // 10mV
				}
			}

			osc_volt_scale_index = best_volt_idx;

			// Step 4: 计算Y偏移，让信号居中显示
			// 信号中心应该在屏幕中心（0V）
			osc_y_offset = -signal_center;
			
			// 限制Y偏移范围
			float max_y_offset = volt_scale_values[best_volt_idx] * 3.0f;
			if (osc_y_offset > max_y_offset) osc_y_offset = max_y_offset;
			if (osc_y_offset < -max_y_offset) osc_y_offset = -max_y_offset;

			// Step 5: 分析波形频率，选择合适的时间档位
			// 改进：使用更鲁棒的频率检测方法
			int zero_crossings = 0;
			int last_crossing_pos = -1;
			int total_period_samples = 0;
			int period_count = 0;
			
			// 计算信号的平均值作为零点参考
			float avg_y = 0.0f;
			for(int i = 0; i < num_points; i++) {
				avg_y += ser->y_points[i];
			}
			avg_y /= num_points;

			// 检测过零点
			for(int i = 1; i < num_points; i++) {
				if (ser->y_points[i-1] < avg_y && ser->y_points[i] >= avg_y) {
					zero_crossings++;
					if (last_crossing_pos >= 0) {
						total_period_samples += (i - last_crossing_pos);
						period_count++;
					}
					last_crossing_pos = i;
				}
			}

			int best_time_idx = 7;  // Default to 1ms
			
			if (period_count > 0) {
				// 计算平均周期（采样点数）
				float avg_period_samples = (float)total_period_samples / (float)period_count;
				
				// 目标：显示2-3个完整周期
				// 屏幕宽度 = 18个division = 720像素 = num_points采样点
				// 理想情况：2.5个周期 → 每个周期约 720/2.5 = 288个采样点
				float cycles_on_screen = (float)num_points / avg_period_samples;
				
				// 根据当前显示的周期数调整时间档位
				if (cycles_on_screen < 1.5f) {
					// 周期太少，放大时间（减小时基）
					best_time_idx = (osc_time_scale_index > 0) ? osc_time_scale_index - 1 : 0;
				} else if (cycles_on_screen > 4.0f) {
					// 周期太多，缩小时间（增大时基）
					best_time_idx = (osc_time_scale_index < 10) ? osc_time_scale_index + 1 : 10;
				} else {
					// 当前时基合适，保持不变
					best_time_idx = osc_time_scale_index;
				}
			}

			osc_time_scale_index = best_time_idx;

			// Step 6: 更新显示
			lv_label_set_text(guider_ui.scrOscilloscope_labelTimeScaleValue, time_scales[osc_time_scale_index]);
			lv_label_set_text(guider_ui.scrOscilloscope_labelVoltScaleValue, volt_scales[osc_volt_scale_index]);

			// 更新Y偏移显示
			char offset_str[32];
			format_voltage_offset(offset_str, sizeof(offset_str), osc_y_offset, osc_volt_scale_index);
			lv_label_set_text(guider_ui.scrOscilloscope_labelYOffsetValue, offset_str);
			
			// X偏移重置为0
			osc_x_offset = 0.0f;
			lv_label_set_text(guider_ui.scrOscilloscope_labelXOffsetValue, "0us");
		}

		// Simulate analysis delay
		vTaskDelay(pdMS_TO_TICKS(300));

		// Restore button appearance
		lv_obj_set_style_bg_color(guider_ui.scrOscilloscope_btnAuto, lv_color_hex(0x00FFFF), LV_PART_MAIN|LV_STATE_DEFAULT);
		lv_label_set_text(guider_ui.scrOscilloscope_btnAuto_label, "AUTO");

		break;
	}
	default:
		break;
	}
}

// Waveform area gesture handler - Handle X/Y offset adjustment via swipe
static void scrOscilloscope_contWaveform_event_handler (lv_event_t *e)
{
	lv_event_code_t code = lv_event_get_code(e);
	static lv_coord_t waveform_touch_start_x = 0;
	static lv_coord_t waveform_touch_start_y = 0;

	switch (code) {
	case LV_EVENT_PRESSED:
	{
		// Record initial touch position and current offset values
		lv_indev_t *indev = lv_indev_get_act();
		lv_point_t point;
		lv_indev_get_point(indev, &point);
		waveform_touch_start_x = point.x;
		waveform_touch_start_y = point.y;
		
		// 记录拖动开始时的偏移量基准值
		osc_x_offset_base = osc_x_offset;
		osc_y_offset_base = osc_y_offset;
		break;
	}
	case LV_EVENT_PRESSING:
	{
		// Get current touch position
		lv_indev_t *indev = lv_indev_get_act();
		lv_point_t point;
		lv_indev_get_point(indev, &point);

		// Calculate movement delta
		lv_coord_t delta_x = point.x - waveform_touch_start_x;
		lv_coord_t delta_y = point.y - waveform_touch_start_y;

		// 优先处理X/Y偏移（如果激活）
		if (osc_x_offset_active && waveform_touch_start_x != 0) {
			// Horizontal swipe for X offset (time offset)
			const float time_scale_values[] = {1e-6, 10e-6, 20e-6, 50e-6, 100e-6, 200e-6, 500e-6, 1e-3, 10e-3, 100e-3, 1.0};
			float time_per_div = time_scale_values[osc_time_scale_index];

			// Convert pixel movement to time offset
			// 使用总的移动距离，而不是增量，避免累加误差
			// 灵敏度：100像素 = 1个division
			float offset_change = (delta_x / 100.0f) * time_per_div;
			
			// 限制偏移范围
			float max_offset = time_per_div * 10.0f;  // ±10个division
			float new_offset = osc_x_offset_base + offset_change;
			if (new_offset > max_offset) new_offset = max_offset;
			if (new_offset < -max_offset) new_offset = -max_offset;
			osc_x_offset = new_offset;

			// Update display with appropriate unit based on time scale
			char offset_str[32];
			format_time_offset(offset_str, sizeof(offset_str), osc_x_offset, osc_time_scale_index);
			lv_label_set_text(guider_ui.scrOscilloscope_labelXOffsetValue, offset_str);

			// If in STOP mode, trigger immediate waveform redraw
			if (!osc_running && osc_frozen_data_valid) {
				osc_waveform_update_cb(NULL);
			}
			break;
		}

		if (osc_y_offset_active && waveform_touch_start_y != 0) {
			// Vertical swipe for Y offset (voltage offset)
			const float volt_scale_values[] = {0.01, 0.02, 0.05, 0.1, 0.2, 0.5, 1.0, 2.0, 5.0, 12.0};
			float volts_per_div = volt_scale_values[osc_volt_scale_index];

			// Convert pixel movement to voltage offset
			// 使用总的移动距离，而不是增量，避免累加误差
			// 灵敏度：100像素 = 1个division
			// Negative delta_y because screen Y increases downward
			float offset_change = (-delta_y / 100.0f) * volts_per_div;
			
			// 限制偏移范围
			float max_offset = volts_per_div * 5.0f;  // ±5个division
			float new_offset = osc_y_offset_base + offset_change;
			if (new_offset > max_offset) new_offset = max_offset;
			if (new_offset < -max_offset) new_offset = -max_offset;
			osc_y_offset = new_offset;

			// Update display with appropriate unit based on voltage scale
			char offset_str[32];
			format_voltage_offset(offset_str, sizeof(offset_str), osc_y_offset, osc_volt_scale_index);
			lv_label_set_text(guider_ui.scrOscilloscope_labelYOffsetValue, offset_str);

