Jackcdut/Graduation-project-ESP32/BSP/GUIDER/generated/events_init.c
			// Update Y baseline position
			if (osc_y_baseline != NULL) {
				// Calculate baseline Y position based on voltage offset
				// Center is at Y=200, pixels_per_volt = 40 / volts_per_div
				float pixels_per_volt = 40.0f / volts_per_div;
				int baseline_y = 200 - (int)(osc_y_offset * pixels_per_volt);

				// Clamp to display range
				if (baseline_y < 0) baseline_y = 0;
				if (baseline_y > 400) baseline_y = 400;

				// Update line position
				static lv_point_t y_baseline_points[2];
				y_baseline_points[0].x = 0;
				y_baseline_points[0].y = baseline_y;
				y_baseline_points[1].x = 720;
				y_baseline_points[1].y = baseline_y;
				lv_line_set_points(osc_y_baseline, y_baseline_points, 2);

				// Update marker position and text
				if (osc_y_baseline_marker != NULL) {
					lv_obj_set_pos(osc_y_baseline_marker, 5, baseline_y - 10);
					lv_label_set_text(osc_y_baseline_marker, offset_str);
				}
			}

			// If in STOP mode, trigger immediate waveform redraw
			if (!osc_running && osc_frozen_data_valid) {
				osc_waveform_update_cb(NULL);
			}
			break;
		}

		// 如果X/Y偏移都未激活，才处理游标拖动
		if (osc_cursor_mode != OSC_CURSOR_OFF && osc_cursor_line != NULL) {
			// 转换为相对于波形容器的坐标
			lv_obj_t *waveform_cont = guider_ui.scrOscilloscope_contWaveform;
			lv_coord_t cont_x = lv_obj_get_x(waveform_cont);
			lv_coord_t cont_y = lv_obj_get_y(waveform_cont);
			int rel_x = point.x - cont_x;
			int rel_y = point.y - cont_y;
			
			if (osc_cursor_mode == OSC_CURSOR_HORIZONTAL) {
				// 横轴游标 - 更新 X 位置
				if (rel_x < 0) rel_x = 0;
				if (rel_x > OSC_WAVEFORM_PIXEL_WIDTH) rel_x = OSC_WAVEFORM_PIXEL_WIDTH;
				osc_cursor_position = rel_x;
				
				// 更新线的位置
				static lv_point_t h_line_points[2];
				h_line_points[0].x = osc_cursor_position;
				h_line_points[0].y = 0;
				h_line_points[1].x = osc_cursor_position;
				h_line_points[1].y = OSC_WAVEFORM_PIXEL_HEIGHT;
				lv_line_set_points(osc_cursor_line, h_line_points, 2);
				
				// 更新标签位置和值
				int label_x = osc_cursor_position + 8;
				// 防止标签超出右边界
				if (label_x > OSC_WAVEFORM_PIXEL_WIDTH - 80) label_x = osc_cursor_position - 70;
				lv_obj_set_pos(osc_cursor_label, label_x, 8);
				
				// 计算时间/频率值
				char buf[32];
				if (osc_fft_enabled) {
					// FFT 模式 - 显示频率
					// 与FFT绘制使用完全相同的映射：
					// FFT绘制: for i in 0..1023: freq = i * max_freq / 1024
					// 屏幕: 688像素显示1024个点
					
					// 直接计算：像素位置对应的频率
					float max_freq = osc_fft_freq_ranges[osc_fft_freq_range_index];
					float display_freq = (float)osc_cursor_position * max_freq / (float)OSC_WAVEFORM_PIXEL_WIDTH;
					
					// 格式化频率显示
					if (display_freq >= 1e6f) {
						snprintf(buf, sizeof(buf), "%.2fMHz", display_freq / 1e6f);
					} else if (display_freq >= 1e3f) {
						snprintf(buf, sizeof(buf), "%.2fkHz", display_freq / 1e3f);
					} else {
						snprintf(buf, sizeof(buf), "%.1fHz", display_freq);
					}
				} else {
					// 时域模式 - 显示时间
					float time_per_div = time_scale_values[osc_time_scale_index];
					float total_time = time_per_div * OSC_GRID_COLS;
					float time = (float)osc_cursor_position * total_time / (float)OSC_WAVEFORM_PIXEL_WIDTH;
					if (time >= 1.0f) {
						snprintf(buf, sizeof(buf), "%.2fs", time);
					} else if (time >= 1e-3f) {
						snprintf(buf, sizeof(buf), "%.2fms", time * 1e3f);
					} else if (time >= 1e-6f) {
						snprintf(buf, sizeof(buf), "%.2fus", time * 1e6f);
					} else {
						snprintf(buf, sizeof(buf), "%.2fns", time * 1e9f);
					}
				}
				lv_label_set_text(osc_cursor_label, buf);
				
			} else if (osc_cursor_mode == OSC_CURSOR_VERTICAL) {
				// 纵轴游标 - 更新 Y 位置
				if (rel_y < 0) rel_y = 0;
				if (rel_y > OSC_WAVEFORM_PIXEL_HEIGHT) rel_y = OSC_WAVEFORM_PIXEL_HEIGHT;
				osc_cursor_position = rel_y;
				
				// 更新线的位置
				static lv_point_t v_line_points[2];
				v_line_points[0].x = 0;
				v_line_points[0].y = osc_cursor_position;
				v_line_points[1].x = OSC_WAVEFORM_PIXEL_WIDTH;
				v_line_points[1].y = osc_cursor_position;
				lv_line_set_points(osc_cursor_line, v_line_points, 2);
				
				// 更新标签位置和值
				int label_y = osc_cursor_position - 22;  // 标签在线上方
				// 防止标签超出上边界
				if (label_y < 0) label_y = osc_cursor_position + 4;
				lv_obj_set_pos(osc_cursor_label, 8, label_y);
				
				// 计算电压/幅值
				char buf[32];
				if (osc_fft_enabled) {
					// FFT 模式 - 显示幅值（dB）
					// Chart Y轴：0=底部(最小dB), 1000=顶部(0dB)
					// 屏幕Y轴：0=顶部, HEIGHT=底部
					// 映射：屏幕Y -> chart Y -> dB
					float chart_y = (float)(OSC_WAVEFORM_PIXEL_HEIGHT - osc_cursor_position) * 1000.0f / (float)OSC_WAVEFORM_PIXEL_HEIGHT;
					float amp_range = osc_fft_amp_ranges[osc_fft_amp_range_index];
					// chart_y=1000 -> 0dB, chart_y=0 -> -amp_range dB
					float db = (chart_y / 1000.0f) * amp_range - amp_range;
					snprintf(buf, sizeof(buf), "%.1fdB", db);
				} else {
					// 时域模式 - 显示电压
					float volts_per_div = volt_scale_values[osc_volt_scale_index];
					// 屏幕坐标：Y=0 在顶部，Y=HEIGHT 在底部，中心=HEIGHT/2
					// 中心对应 0V，每格对应 volts_per_div
					float center_y = (float)OSC_WAVEFORM_PIXEL_HEIGHT / 2.0f;
					float pixels_per_div = (float)OSC_WAVEFORM_PIXEL_HEIGHT / (float)OSC_GRID_ROWS;
					float voltage = (center_y - (float)osc_cursor_position) / pixels_per_div * volts_per_div;
					snprintf(buf, sizeof(buf), "%.3fV", voltage);
				}
				lv_label_set_text(osc_cursor_label, buf);
			}
			
			// 游标模式下不处理偏移调整
			break;
		}

		break;
	}
	case LV_EVENT_RELEASED:
	{
		// Reset touch tracking
		waveform_touch_start_x = 0;
		waveform_touch_start_y = 0;
		break;
	}
	default:
		break;
	}
}

// Initialize all event handlers for oscilloscope screen
// Note: Trigger mode selector removed - using auto trigger mode only
// Note: btnPanZoom (GRID) removed - grid is always visible now
void events_init_scrOscilloscope(lv_ui *ui)
{
	lv_obj_add_event_cb(ui->scrOscilloscope, scrOscilloscope_event_handler, LV_EVENT_ALL, ui);
	lv_obj_add_event_cb(ui->scrOscilloscope_btnBack, scrOscilloscope_btnBack_event_handler, LV_EVENT_ALL, ui);
	lv_obj_add_event_cb(ui->scrOscilloscope_btnAuto, scrOscilloscope_btnAuto_event_handler, LV_EVENT_ALL, ui);
	lv_obj_add_event_cb(ui->scrOscilloscope_btnStartStop, scrOscilloscope_btnStartStop_event_handler, LV_EVENT_ALL, ui);
	lv_obj_add_event_cb(ui->scrOscilloscope_btnFFT, scrOscilloscope_btnFFT_event_handler, LV_EVENT_ALL, ui);
	lv_obj_add_event_cb(ui->scrOscilloscope_btnExport, scrOscilloscope_btnExport_event_handler, LV_EVENT_ALL, ui);
	lv_obj_add_event_cb(ui->scrOscilloscope_contWaveform, scrOscilloscope_contWaveform_event_handler, LV_EVENT_ALL, ui);
	lv_obj_add_event_cb(ui->scrOscilloscope_contTimeScale, scrOscilloscope_contTimeScale_event_handler, LV_EVENT_ALL, ui);
	lv_obj_add_event_cb(ui->scrOscilloscope_contVoltScale, scrOscilloscope_contVoltScale_event_handler, LV_EVENT_ALL, ui);
	lv_obj_add_event_cb(ui->scrOscilloscope_contXOffset, scrOscilloscope_contXOffset_event_handler, LV_EVENT_ALL, ui);
	lv_obj_add_event_cb(ui->scrOscilloscope_contYOffset, scrOscilloscope_contYOffset_event_handler, LV_EVENT_ALL, ui);
	lv_obj_add_event_cb(ui->scrOscilloscope_contTrigger, scrOscilloscope_contTrigger_event_handler, LV_EVENT_ALL, ui);
	lv_obj_add_event_cb(ui->scrOscilloscope_contCoupling, scrOscilloscope_contCoupling_event_handler, LV_EVENT_ALL, ui);
	// Trigger mode selector removed - using auto trigger mode (RISE edge) by default
}
